{
  "metadata": {
    "scraped_at": "2025-11-21T13:54:55.294380",
    "total_chapters": 39,
    "novel_slug": "i-alone-am-the-sss-rank-regressor",
    "novel_title": "I Alone Am The SSS-Rank Regressor",
    "first_scraped": "2025-11-21T07:16:04.935304",
    "last_updated": "2025-11-21T13:54:55.294380",
    "is_complete": true
  },
  "novel_info": {
    "id": "i-alone-am-the-sss-rank-regressor",
    "slug": "i-alone-am-the-sss-rank-regressor",
    "title": "I Alone Am The SSS-Rank Regressor",
    "cover_url": "https://lightnovelpub.org/media/covers/batch_16/novel_12436.jpg",
    "rating": null,
    "chapters_count": 39,
    "rank": 322,
    "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/",
    "first_scraped": "2025-11-21T07:16:04.935304",
    "last_updated": "2025-11-21T13:53:53.937097",
    "scraped_at": "2025-11-21T13:53:53.937097",
    "author": "Tsukasa0",
    "status": "Completed",
    "genres": [
      "FANTASY",
      "ACTION",
      "ADVENTURE",
      "ROMANCE",
      "COMEDY",
      "MYSTERY",
      "REINCARNATION"
    ],
    "summary": "“How the hell is this possible?”Dead and betrayed in the snow with the rest of his squadron, Mikhail is surprised to find himself regressed in time.What's worse was that he had no idea how or why he regressed as his memories at the time of death were completely gone.With his element of Oath -the power to make vows in exchange for power- also now messed up, Squadron Leader Mikhail Hendrix must now navigate through this changed storyline with no clues at his disposal.He needs to try his best to keep his squadron alive in this dangerous world of gods and magic, all the while figuring about his regression and the woman.",
    "stats": {
      "chapters": "39",
      "views": "1.0K",
      "bookmarked": "19"
    }
  },
  "chapters": [
    {
      "id": "1",
      "number": "1",
      "title": "Chapter 1: Wake Me Up",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/1/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 1: Wake Me Up\n\"Wake up Mika, stop shaking it already!\"\nTwo deep blue eyes opened as the voice echoed in the encampment.\nThe cold prickled against his skin, but the panic overcame the irritation.\nHis body shot up and his chest heaved up and down with large gasps.\nThe man looked to his side where he was faced by the black walls of the room.\n\"Nightmare?\"\nAnother voice reached the man’s ears, softer and calmer.\nA contrast to the previous one.\nHis head snapped to the front, coming face with two men in front of him.\nSleek black hair with tips falling down in front of his eyes, just like him. Red crimson eyes that shone as bright as the smile on his face.\nIcarus Heliarke.\nAnd the second man.\nUnruly meadow green hair. Golden eyes that shone like the brightest amber and a calmness on his face that resembled the seas.\nModric Sylbane.\nIt took him not more than a second to recognize the two.\nAfter all, how could he not?\nThey were his squadmates. The man looked at them with widened eyes.\nThe only problem was..\nIn a snap, the man grabbed the hand of Icarus, his fingers closing around it.\nThe cold seeped into his skin, sending a shiver down his body.\nIt was real and solid.\nIt wasn’t a dream.\n’H-how? How are they...’\nIt was the only thought that ran through the 20 year old squadron commander, Mikhail Hendrix’s mind.\nThey were all supposed to be dead. He had seen it with his own eyes.\nIn fact...\nMikhail’s gaze went down to his own hands, both pale as snow and without a blemish.\nHe was supposed to be dead too.\nExcluding the ragged furry clothes, there wasn’t a single injury on his body.\n’How is this possible?’\nHad he returned back in time?\nThere was no indication of what had happened.\nForcing himself to remember, Mikhail could still vividly remember the last moments of his life.\nIn the middle of a tundra, beyond the Ironhold.\nStranded with nowhere to go, surrounded by Sylaris.\nThe bodies of his dead squadmates in front of him, the pooling blood freezing beneath them.\nMikhail himself, on the verge of death.\nAnd then...\n’Huh?’\nHis memory ran blank. He was unable to remember anything that happened past that point.\n’Urgh!’\nMikhail tried to push further but to no avail. Nothing came to his mind.\nThe only thing he knew for sure was that he had died right there.\nAlong with his squadron. Otherwise he would not be here right now.\nBut then..\nWhy was he unable to remember his death?\nSnip! Snip!\nSuddenly, snippets of memories ran through his head at once, causing him to collapse back in his rucksack.\n\"Yo Mika, you good?\" Mikhail heard Icarus, but he couldn’t focus on him right now.\nTaking a deep breath, he looked up at Modric.\n\"I’m fine, just a bad dream.\"\nHe felt Modric’s eyes pause over him for a second before he nodded.\n\"Hope it wasn’t too bad. In any case, your presence is requested at the ground for the morning drills.\"\nMikhail nodded.\n\"I’ll be there, you two go ahead.\"\nAs Modric and Icarus were about to leave, Mikhail called them out.\n\"Wait.\"\nThe duo turned, confused.\n\"What’s the date today?\"\nIcarus’ eyes widened while Modric’s eyebrows raised a little.\n\"I think he might have hit his head somewhere while-\"\nModric interrupted him, paying him no heed.\n\"It’s Tuesday, April 9th of the year 2093 today, Mika.\"\nMikhail’s eyes momentarily widened but he quickly composed himself and nodded.\n\"Thanks, you can go now, I’ll be there in a few minutes.\"\nModric nodded, stepping out the door while dragging Icarus with him.\nAs soon as the duo left, Mikhail stood up instantly, panicked like a rat.\n\"Fuck, fuck, fuck,\" He started cursing.\nHis eyes darted around the room, landing on a mirror by the wall.\nIt wasn’t that large, even having a few cracks on it.\nBut it was enough for him to see his face and body.\nAnd as he walked over, his reflection made a chilling realization run down his spine.\nMikhail knew what had happened.\nHe had regressed back in time after dying.\nOf course, he couldn’t remember the exact time or day from when he had died.\nBut if he had to make an estimate on the last thing he could remember, he had regressed back by 7 years.\nA drop of sweat beaded down his head in the cold.\nIt did not make sense to him.\n’Why me? Why only me?’\nWhy not his squadron?\nBut it was then that a possibility came to his mind.\nLooking in the mirror, his hand quickly went to the bandages wrapped around his neck, starting to loosen them up.\nWithin a minute, he was done, the bandages falling to the ground.\nHis fingers pressed against a part of the neck where a symbol was etched.\nOr was supposed to be as it had changed now, proving his fears true,\nRight above his collarbone, the crook where his shoulder and neck connected..\nWas a tattoo.\nA tattoo of an inverted rosemary cross.\nAs his eyes landed on it, the mark shone in a bright crimson color, burning against his neck.\nHis eyes twitched at the sudden pain but they didn’t leave sight of the mark.\nMikhail was left stunned.\n\"What the-\"\n’It wasn’t supposed to be like this.’\nIt wasn’t supposed to be inverted. It should’ve been straight.\nIt was a mark that people would die to get their hands on.\nThe mark, including Mikhail, was a rarity that only 8 people in the world possessed.\nIt was called a Rosaryth.\nBut after his regression, it had changed now.\nThe mark was inverted, something that wasn’t supposed to happen.\nMikhail wanted to curse again.\nMore and more mysteries were piling up and he couldn’t make sense of a single one.\nAs he was about to pick up his bandages, a head-splitting pain assaulted his head.\nCollapsing to the ground in pain, Mikahil felt like tearing his skin off as he squirmed.\nThe following second, his body convulsed, his hand automatically shooting to his mouth.\n\"Blergh!\"\nMikhail felt something wet dripping down his hand as it came out his mouth.\nOpening his eyes, he was shockingly greeted by a sight of fresh crimson.\nBlood.\nThe fresh taste of iron registered in his mouth as he looked at the crimson-stained bandages.\nBefore he could make sense of it, something more shocking took place.\n[Regression Assimilation Complete!]\n[Oath Complete!]\nSuddenly, a window popped up in front of him.\n—————〔Oath XXX〕—————\n•\nCondition: *$@*#@((@$&\n[Penalty]\n•\nDeath\n———————————————\n[Low Character Progression!]\n[Unable to display conditions of Oath XXX]\n’What!?’\nHis brain was unable to catch up with so many holographic screens in front of his eyes.\nIt was too much information.\nThe man had just landed in his world for fuck’s sake.\nUnfortunately, the worst for Mikhail was still yet to come.\nAs the next window...\n—————〔Chronicle I〕—————\n•\nCondition: Uncover the assassination and save your academy from getting destroyed.\n[Rewards:]\n•\nCharacter Progression: +15%\n•\nMana Increase: +300\n———————————————\nMade his face turn ghost white.",
      "scraped_at": "2025-11-21T13:53:54.287269",
      "content_scraped_at": "2025-11-21T13:53:54.632732",
      "error": null
    },
    {
      "id": "2",
      "number": "2",
      "title": "Chapter 2: Decision To Make",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/2/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 2: Decision To Make\nMikhail was in utter confusion at the holographic screens in front of him.\nEspecially for someone like him, who was seeing them for the first time.\n’Oath and a...Chronicle??’\nHe understood the meaning of the first one but not the second one.\nFrom what he could see it seemed like a mission that he had to complete.\n’Uncover the assassination? Save the academy?’\nWhat the hell did it mean by this?\nThe [Rewards] seemed to be the things he would be given for completing it.\nAsides from whatever assassination it meant, how could he even trust these screens?\nHis head was in confusion.\nHe had never seen any holographic power like this in his past life.\nIt wasn’t even his Dragma so what?\nAnd then, the oath screen?\nWhat oath? He couldn’t remember making any.\n’Hmm..’\nMikhail calmed his mind and closed his eyes.\nClank!\nHis eyes suddenly opened with a sharp motion.\nIt was true, he did have an oath in his body.\nBut the main problem was.....\nThe fact that he didn’t know what the conditions were, or what he had taken for swearing it.\nHe didn’t feel any power up in his body.\n’What the hell?’\nThe only clue he had was the penalty. Not like it was a good one anyway.\n\"Death.\"\nThe word reminded him of his fate in his previous life, sending a shiver down his spine.\nNo. He couldn’t squander this chance again.\nFrom knowing the oath was true, he knew at least the screens weren’t lying.\nWhich meant the rewards were true as well, and also most likely the mission.\nCurrently, the mission was the only clue to his oath too as the screens were probably connected.\nMikhail turned his eye to the mission screen.\nHe tried to remember anything remotely related to the assassination or destruction of the academy around the current date.\n’Urgh..’\nHis whole memory was a haze after the regression.\nBut then...\nClick!\nIt clicked inside his mind.\nThe Dominique’s visit soon to the academy in his previous life.\nThey were high figures in the empire that were known to do whatever the hell they wanted.\nThey often visited the wall for their own purposes or whatever the hell pleased their mind.\nAnything but the state of the wall or the world outside of it.\nWhy would they care about them?\nMikhail gritted his teeth.\nIn any case, he remembered the truth now.\nThe Dominique’s visit that day and the sudden raid of wormholes north of the wall.\nIt was all related somehow, instead of an accident as it was labelled in his past life.\nWhich meant that it was orchestrated.\nBy someone inside the academy or the Dominique themself.\nAnd it was Mikhail’s job to find out who was responsible for it, if he wanted to find anything related to his regression.\nMikhail looked at his guns and clothes on the table beside him.\nHe had been through many serious and life threatening situations in his previous life.\nBut nothing as important as this.\nLife wasn’t guaranteed for him this time unlike the last time in the horrifying incident.\nThe timeline was changed now.\nBut if he didn’t do anything, the oath would kill him.\nAnd his family.\nMikhail remained silent for a second before taking a deep sigh and standing up.\nGrabbing his guns and putting on his clothes, he moved outside.\nWell, it wasn’t like he had a choice in this.\n***\nStepping outside of his room, Mikhail felt the cold seep into his skin.\nThe sudden breath of fresh air brought a sense of refreshness to him.\nIt felt good, it felt comforting.\n\"Not for long though.\"\nHe shifted his mind back to the days that awaited him.\nBut before he could think forward, a voice interrupted him from the side.\n\"Not for long what?\"\nIt was instantly recognizable.\nMikhail turned, his aqua-colored eyes making contact with the amber gold ones of Modric.\nHe quickly excused.\n\"I was talking about the refreshness after a good sleep, it won’t be there after the drill after all.\"\nModric stared at his face for a second in silence, as if contemplating his words.\nOr maybe something deeper, Mikhail didn’t know.\nThe man was always a quiet one.\nHe saw Modric nod in the next second.\n\"You’re right. You need to hurry up, everyone is already there except you.\"\nMikhail didn’t say anything else, just moved forward.\nModric, as if it was natural, came to his right hand side behind him and started walking with him.\nIt was his place as the vice-commander.\nWalking through the camp brought a fresh line of memories to Mikhail.\nBad but nostalgic memories.\nEven if this was the place that changed him for all the years before he became a true soldier, it still held his memories.\nThe creaking of the nether wood under his feet and the buildings standing tall aside him.\nIt was where he had spent a major part of his life.\nIgnoring the architecture, he focused his gaze forward.\nTo the central space of the camp.\nHe saw most of the squadrons already assembled there, as Modric had told him.\nOn the bridge overlooking the central space, he saw the 4 masters of the encampment and the Lord Commander.\nHe saw two of the figures directing intense stares at him but he was used to it.\nIgnoring them, his gaze met with the Lord Commander’s grey eyes.\nThe message was clear.\n’Don’t do this again.’\nMikhail nodded, turning to the squadrons below who all looked up at him as well.\nAgain, a majority of furious stares were directed at him but he remained unfazed.\nWalking down the stairs, he joined his own squadron.\nGoing to stand up at the front, he greeted all of them with a slight nod.\nWords could be exchanged later, it had already gotten past the debrief time.\nAnd as said the moment Mikhail stepped up to the front, the Lord Commander Vlahovic tapped his stick to the ground.\n\"We shall start the drill debriefing now.\"\n’It’s time.’",
      "scraped_at": "2025-11-21T13:53:55.637502",
      "content_scraped_at": "2025-11-21T13:53:56.215427",
      "error": null
    },
    {
      "id": "3",
      "number": "3",
      "title": "Chapter 3: Ironhold and Routes",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/3/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 3: Ironhold and Routes\nA/N: A bit of an information dump, please bear with me.\n____\nAs Vlahovic ended his debriefing, Mikhail turned around to his squadron.\nFor a ’squadron’, there were only 5 people including him.\nIt wasn’t much but it was the most you could get on the Ironhold.\nIt was a place where people from all over the Empire landed up.\nYou couldn’t say they were nice people however.\nFrom bastards abandoned by their families, to thieves and rapists sent here as a punishment.\nYou could find all kinds of moral alignments on the Ironhold.\nIt was one of the reasons every person was a male here.\nAs for the reason Mikhail was brought here, he couldn’t quite remember.\nHe and the ones in his squadron were among the oldest people here at the camp.\nThey had been brought here as kids so naturally none of them remembered.\nTurning back to Modric, Mikhail extended his hand.\nWithout a word said between them, the former understood the command immediately.\nHe withdrew a map from the back of his uniform and handed it to Mikhail.\n\"Thanks.\"\nOpening the map, Mikhail saw a very detailed but hand-drawn map of the Ironhold and the world beyond.\nThe Ironhold was a wall that extended hundreds of meters into the sky and spread as wide as a hundred kilometers.\nIt was what separated them from the world beyond, the world of Sylaris.\nDisgusting creatures that fed on dead bodies of humans.\nIn his previous life, he and his squadron had died by their hands, north of the hold.\nHe didn’t know where however.\nLooking at the map, he saw a majority of the area above the hold unmapped.\nIt was because nobody had dared to explore the whole world beyond them.\nNobody knew what was in the far north.\nHowever, a minor part was drawn in a detailed format with lines extending from a black point on the wall.\nThe black point was their camp and the lines were the scouting routes they had to check every morning.\nKeeping these routes cleared and checked allowed them to steer clear of any Sylaris nearby the hold.\nIn case they were to attack, the camp would be prepared.\nThe wall was there to hold them back but it wasn’t enough to just let them keep there.\nThey needed to be killed.\nFortunately, the Sylaris almost never attacked the wall. They were too disunited among themselves.\nRegardless, as soldiers of the Camp Nether, it was their duty to keep guard of the wall.\nLooking at the routes, Mikhail only had 3 routes left for the taking.\nThe others had already been picked.\nThis didn’t happen before. It was the first time because they had gotten late.\nOtherwise, their routes were always the same.\nExamining the 3 routes, Mikhail tried to connect them to anything that could help him in his mission.\nIt was then that one of the routes clicked to him.\n’Wait, wasn’t this...’\nHe remembered.\nIt was where one of the riders had gone missing.\nDeaths were common on the hold, especially during scouting so no one really took it that seriously.\nBut for Mikhail at that time, it had always been suspicious.\nIt was because of the areas surrounding the death of the man.\n’Hmmm...’\nHe stared at his squadron before taking a deep sigh.\nTurning to them, he pointed two fingers at two of the routes.\n\"Modric and Oscar, you two will take this route. Yvan and Icarus, you both will go on this route.\"\nThe team looked over, seeing their routes. They already knew that the last route would be Mikhail’s.\nThere was no need to question why he was going alone. All of them had a sense of trust between them.\n\"Why do I get the shortest route again?\" Icarus whined, forming his mouth into a pout.\n\"You always ask this and you always know the answer, you are too erratic to be let out for too long.\"\nModric answered before Mikhail could.\nEveryone knew the past experiences with Icarus, his curiosity had often got them into perilous situations.\n\"It’s why I pair Yvan with you, he can keep a good eye on you.\" Mikhail continued with a nod.\nYvan, the tallest of their group, nodded quietly.\nHe was the younger brother of Modric, having his meadow green hair but different colored eyes.\nBoth of them were known to be quiet-natured.\n\"Tsk.\" Icarus clicked his tongue, not complaining anymore.\nYvan tapped him on the back, pouring more salt on his wounds.\n\"Let’s move on, you knew this would never work anyways.\"\nIcarus’ expression got worse but he didn’t complain. He knew the guy was right.\nTurning back to Modric, Mikhail continued.\n\"Be careful, the routes are new. We don’t know anything about that area.\"\nModric gave him a simple nod in his reaction.\n\"Understood.\"\nTurning to leave, Mikhail had just taken a step before Modric called him out as well.\n\"You should be careful as well.\" He stared into Mikhail’s eyes.\nFor some reason, Mikhail always felt as if the green-haired boy’s eyes knew more than what they showed.\nIt wasn’t his concern though.\nNodding, Mikhail went on his way to the stables.\n***\nArriving at the stables, Mikhail was quick to arrive near his horse.\nMost of the people had already left so there wasn’t much of a commotion or rush.\nGreeting a stable hand, Mikhail petted his abyssal-black horse.\nIt had grown alongside him and there was a strong bond between the two.\nHe even had a name for it, in an area when men mostly didn’t give one because they were common to die.\nSora.\nIt meant sky or so Icarus had told him. A word he had learned from his time holed up in the library.\nHe said that its fur looked like the clear night sky.\nStrapping up his things, Mikhail was quick to climb on and grab the reins.\nPulling them, he rushed to the only gate in the middle of the encampment.\nThe two gatekeepers had it pulled up there for them to quickly leave.\nGetting to the front, he saw the gatekeeper attach a device to his leg.\nIt was one of the academy’s ways to ensure you didn’t explore farther than what you were designated.\nAlthough nobody did, the punishment was already hefty enough.\nFurthermore, it was also made to know of deserters or traitors as it kept track of your location.\nAs the guard took note of his leaving time–something which was done to reward soldiers who got done early– Mikhail noticed something strange.\nHe wasn’t the usual one at the gate.\nIn fact...\nLooking to his right and the tunnel in front of him, none were the same as well.\nIt was normal for 2 guards to be replaced, but not the whole batch of 8.\n\"I haven’t seen you before.\" Mikhail initiated the conversation.\nThe guard looked up from his notepad, with a brown weird and a strange smile.\nIt gave Mikhail the ick for some reason but he chose to ignore it.\n\"Just got appointed last night per the Watch Guard commander’s orders.\"\nMikhail contemplated for a second before asking again.\n\"Temporary replacement or permanent?\"\n\"Permanent.\"\nMikhail felt something strange gnawing at his back.\n\"Then where are the other-\"\n\"Oi! Would you hurry up, bastard!?\"\nTurning around, Mikhail saw a squadron of 6 waiting for him to get done already.\n\"Yeah, hurry up fucker!\" Another joined in.\nGiving them no mind, Mikhail turned to the front where the guard spoke first now.\n\"You are ready to go.\"\n’Hmm...’\nAs he was going to snap his reins again, Mikhail turned back to the man.\n\"What’s your name?\"\nThe guard hesitated for a second before replying with the same smile.\n\"Rubert.\"\nMikhail was quick to reply.\n\"No, last name.\"\nThe guard shook his head, implying that he didn’t have one.\nThe suspicion in Mikhail was at an all-time high but he had to leave.\nBut he chose not to show it.\n\"Alright, thanks. Nice to meet you Rubert.\"\nThe guard nodded.\n\"Same here.\"\nWith that, Mikhail snapped his reins and sped off into the tunnel that led outside the Ironhold.",
      "scraped_at": "2025-11-21T13:53:57.221938",
      "content_scraped_at": "2025-11-21T13:53:57.839659",
      "error": null
    },
    {
      "id": "4",
      "number": "4",
      "title": "Chapter 4: The Investigation By The Lake",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/4/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 4: The Investigation By The Lake\n***\nMikhail climbed off his horse, binding it to a safestall.\nThere were multiple of them installed in the forest beyond the wall by scouts who came before.\nTaking a deep breath, Mikhail rubbed his gloved hands.\nThe cold had gotten significantly worse north of the hold. He couldn’t even feel his face.\nStepping through the thick snow and the tall thin trees, Mikhail felt an eerie feeling on his back.\nHe knew he was on the right path.\nThe main reason he had picked this route to investigate wasn’t just the man’s death.\nIt was also because what was near the area he died.\nA frozen lake. But not just any lake.\nIt was a mana source.\nA mana source were natural sources or artificial objects that contained large amounts of condensed mana.\nOftentimes, these sources were a big reason for a wormhole’s appearance.\nA source this close to the wall had to be monitored every day. One wormhole and it would prove to be very dangerous for them.\nThe Empire overestimated the strength of the people at Ironhold.\nMost of them didn’t know anything about fighting, even if you were to ignore their dwindling numbers.\nIn fact, a majority of the recruits that arrived didn’t even opt to be soldiers, they ended up choosing to become a steward or a weaponsmith etc.\nThe fear of death was too strong for some people.\nMoving back to the topic, mana sources were sensitive things.\nAny kind of disruption or damage could result in the two realities interconnecting, allowing Sylaris to break through.\nUnfortunately enough for the man, he came right next to a mana source.\nThe Magnolia Lake.\nIt wasn’t a large lake by any means but it was certainly larger than your average mana source.\nThere were definitely signs of trouble.\nBut here was where Mikhail begged to differ.\nEven though the reports stated in the past life that his death might be related to the mana source, he felt it was masked.\nIf it was due to a mana source, then a gate would have opened, which would have gotten everyone to know.\nNot to mention, in the first place, a mana disruption was quite a rare case by itself.\nSo someone had definitely covered it up.\nUnfortunately, Mikhail didn’t care enough in his past life to think about this.\nFocusing himself forward, he quickly started running.\nHe couldn’t stay idle, monsters were also known to assemble near a mana source for healing.\nFortunately, he had every bit of the map memorized over the years.\nBut the moment he took a few steps, an ear piercing scream echoed in his ears.\n\"AAHHHHHH!!!\"\nBy instinct, Mikhail’s hands went to his guns as he quickly took cover.\nHe quickly examined the area around him for any danger.\nSeeing nothing, he quietly jumped from tree to tree, searching for the source of the scream.\n’Yes this definitely leads to the lake.’\nIt only proved his point more.\nAs he took the next step however, the sound of a gunshot echoed awfully close to him.\nBoom!\nRemaining calm, Mikhail quickly pressed his back to a tree, hiding himself.\nHe heard the gunshot connect perfectly with the target’s flesh as they crashed on the ground.\nHe could hear their whispers and whimpers as they crawled on the ground.\nThey were near. Awfully close.\nMikhail readied himself for a confrontation, pressing his hands to the triggers of the guns.\nThe time window was too small to activate a spell, he couldn’t take the risk.\nBut to his confusion, the footsteps suddenly faded away from his hearing.\n’Hmm?’\nHe didn’t let his guard down just yet. It could be that they had already seen him.\nIllusion spells could interfere with his senses.\nIt was only after a couple of minutes of hearing nothing, that he decided to move.\nHowever, the moment he turned his neck to see behind the tree, he felt a cold blade press against it.\nClick.\n\"Move and you’re dead.\"\nThe voice came from right behind his ear, no higher than a whisper.\nBut it wasn’t the chasers.\nRather, from how the voice sounded at the verge of death, it was the target.\nHe probably didn’t recognize Mikhail because of his fading eyesight as he approached death.\nHe wasn’t worried, the man was on the verge of death. He could do nothing.\n\"I think you should be worried about yourself, that gun will blast your heart faster than this blade can snap off my neck.\"\nThe gun pressed deeper into the person’s heart.\nThe man laughed hoarsely, minutes away from death now.\n\"You sound pretty conf-\"\nBoom!\nBlood and flesh flew in the air as Mikhail moved his gun to his thighs in a split moment.\nThe man screamed but he paid him no heed.\nGrabbing his wrist, he spun the man in the air, throwing him away.\nStanding up, he wiped the blood off his gun and face.\n\"Who said you’re safe while speaking?\"\nDisarming the blade from him, Mikhail bent him on his back and stood above him.\nThe man had one of his legs blown off, he could do nothing.\nHe screamed but it was so light that the birds in the nearby trees remained unbothered.\nGrabbing his hair, Mikhail pulled the man’s head up, making him meet his eyes head on.\nIt was then that the man recognized him in his dying moments.\n\"Wait...wait..wai-I-\"\n\"Yes yes, I know you. Stop wasting your breath on me, you’re dead.\"\nThe man’s voice turned hopeless, realizing his fate.\nMikhail had no time for his antics however.\n\"Those people, who were they?\"\nThe man looked him in the eyes, hesitating if he should even tell when Mikhail was leaving him to die.\nThe latter was quick to remind him of his oath however.\n\"Remember your oath, you don’t want to be remembered as a traitor, do you?\"\nFor the first time, the man suddenly shivered. Mikhail knew he was a man of his word.\nCoward but would still hold up his oath.\nUnfortunately, he needed to speak quick and stop wasting Mikhail’s time.\nThe scream might have not reached those men’s ears but the boom of the gun could possibly be enough.\nHe needed to get the intel and go back.\nMikhail couldn’t go to the lake. He didn’t know how many people would be there.\nIt was a huge risk by himself. At max, he could take on only 4 or 5 people considering his rank.\nFortunately, the man finally spoke up.\n\"S-s-s...Pact....k-killed....b-b-betrayal...protect....the D-Dominique.\"\nBut before he could continue, the light faded from his eyes and he slumped in Mikhail’s arms.\nThe latter clicked his tongue, it was barely enough of a clue.\nUnfortunately, he couldn’t do anything else now. He needed to hurry back.\nMikhail gazed at the dead body in front of him.\nAs a brother in arm, it was his duty to bring his body back for a proper burial.\nUnfortunately, Mikhail wasn’t as patriotic as him.\nStrapping his guns, he quickly rushed back to his horse.\nAnd back to the Ironhold.",
      "scraped_at": "2025-11-21T13:53:58.851523",
      "content_scraped_at": "2025-11-21T13:53:59.429656",
      "error": null
    },
    {
      "id": "5",
      "number": "5",
      "title": "Chapter 5: Visit To The Library",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/5/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 5: Visit To The Library\n***\nArriving back at the hold, Mikhail checked in with the guards.\nHe was still a little suspicious of them but he had no time.\nAfter informing them that there was nothing out of the ordinary except some monsters, he was allowed to go.\nThey removed the tracker and he took his horse back to the stables.\nAs he parked it, he was relieved to see his squadron’s horses at their places too.\nAll had gone well. At least for now.\nTaking his stuff, Mikhail reported to the mess hall where he saw his friends already seated.\nModric was the first to notice his arrival.\n\"Back safe and sound?\"\nMikhail nodded.\n\"All the same. What about you all?\"\nIcarus was the first to voice up.\n\"Yeah it was all the same, there was no need for pairs at all.\"\nIt was obvious that the red-eyed boy was still mad about his pairing.\nNothing could be done about it though.\nYvan shaked his head, sighing.\n\"I sensed some mana disturbances but nothing major, don’t worry.\"\n\"Alright.\"\nA word of response was a compliment enough for all of them.\nThey looked at him waiting to join but Mikhail waved his hand.\n\"I need to report to Lord Vlahovic about today, I’ll eat later.\"\n\"Well okay, we’ll be training in the grounds if you need us later.\" Oscar replied.\n\"I understand.\"\nGiving his final words, Mikhail left the mess hall to his own quarters.\n’I can’t let them get involved in this.’\nThe words of the messenger were still ingrained in his mind.\nThis was definitely not a normal killing.\n’How did they even enter the camp’s vicinity undetected?’\nFrom what he knew, there were radars to notify about any potential intruder within a certain radius.\nVerified personnel were of course let go. And with the tracker acting like a verification device, they were safe too.\nThe trackers self-destruct when removed without a special method so there was no chance of using them.\n’Is someone a traitor from the inside?’\n\"S-s-s...Pact....k-killed....b-b-betrayal...protect....the Dominique.\"\nHis mission told him to prevent the assassination and the man had told him to protect the Dominique.\nThey were definitely related somehow.\nProtect them from the people that were chasing him?\nProbably. Or at least he was 90% sure.\nBecause he was still not sure if it were the people who were chasing the man or the monsters in his previous life.\nThere was also that vision he had seen in the morning in bed.\nAnother reason was the first word that the man spoke.\n’Pact.’\nA pact, as in a treaty or promise?\nS- pact.\nTwo words, pact was the second word. So it must have been some kind of special pact.\nS was the starting letter of the first word.\nMikhail thought long and hard but couldn’t find any clue.\nThere was only one solution to this current problem.\nThe academy library.\nFortunately, he knew how to read unlike many people here in the camp.\nIt was all thanks to Yvan, the book worm between them.\nIn fact, in this current situation, Mikhail would first go to him for help but as he had said earlier, he didn’t want to involve his squadron in this.\nThe library wasn’t that big or useful but it was his only hope.\nTo make sure the master would give him access to advanced books too though, he had to go somewhere else first.\nVlahovic Ibrynt.\nThe word from the Lord Commander of the camp would definitely allow him every bit of access he needed.\nPacking his stuff, Mikhail wrote the exact words of the man down before going outside.\nTo Vlahovic’s Quarters.\n***\n[After 2 Hours]\nMikhail arrived in front of the library, the woodsteps creaking under his feet.\nHe looked at the normal slip of paper in his hand.\nIt had nothing written on it, just a blank short piece of paper that you could find anywhere.\nThat was what it would appear to any normal guy.\nBecause it wasn’t normal. It had Vlahovic’s mana signature on it.\nAn invincible signature that would instantly be understood by the master in the library.\nIt was a temporary referral card. One-time use.\nMana signatures were something very unique to the person so it was almost impossible to replicate them.\nUp here on the hold, they were the easiest and the best way of secret identification of a person.\nHeading up the stairs, Mikhail opened the wooden door to a narrow hallway.\nImmediately, he was made aware of the silence inside the library.\nIt wasn’t because of the rules, even though it was a rule to keep the silence.\nBarely anyone came here for books, except those nerds or time passers.\nMost of them didn’t know how to read, and those that did barely had interest in reading words.\nThey were past rapists, not librarians.\nHeading further inside, Mikhail saw the hallway spread into an expansive space covered in bookshelves.\n\"Oh, Mikhail?\"\nSurprised by the noise, Mikhail flipped to his right where he saw a man so thin, he could trace his bones popping out of his skin.\nA small black patch of fading hair on his head and blue frosty eyes that could close at any moment, the master stared at Mikhail.\nHe was Master Vance de Loras.\nOne of the 4 Masters under the Lord Commander Vlahovic.\nHe was responsible for everything administrative and knowledge related in the camp.\nBasically the brain. He was rumored to be above 100 years old but none dared to ask the man.\nAs powerless as he was said to be though, Mikhail was always on his tips near him.\nSomething about the man’s presence put him on an edge. Something that none could see.\nHe could never sense him at all.\n\"Greetings, Master Vance. I’m here for a visit to the library.\" Mikhail maintained his calm.\nAn eerie smile spread on Vance’s face, the same one he always used.\n\"Ahh, a rarity for you. But of course everyone is welcome here to seek knowledge. Go ahead.\"\nMikhail nodded, not wanting to spend much time wasting words on him.\nHe handed him the blank piece of paper without any words.\nVance held it from his hands, examining it in his hands for a second as he adjusted his monocle.\n\"Very well, you can access the back shelves as well. If you have any problem or require help in finding any book, feel free to call me out.\"\nThe man smiled, throwing the piece of paper in the fire beside him.\n\"Thank you, Master Vance.\"",
      "scraped_at": "2025-11-21T13:54:00.436432",
      "content_scraped_at": "2025-11-21T13:54:01.026477",
      "error": null
    },
    {
      "id": "6",
      "number": "6",
      "title": "Chapter 6: Relevations",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/6/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 6: Relevations\n***\nIt had been an hour since Mikhail had started searching.\nAnd so far he couldn’t find a single clue of any pact or treaty related with wormholes.\nAnything with the Ironhold, or the Dominiques. Nothing.\nMikhail took a deep breath, trying to calm himself down.\nThe man whom he had faced back there. He wasn’t strong by any means.\nIn fact, in a straight on fight it wouldn’t take Mikhail more than a minute to send him packing.\nSo Mikhail doubted he could have made it far to the lake without being caught by those people first.\nIn that case, there was a very minute chance of him having overheard this S- pact thing.\nIt wasn’t information he found out from them.\nIt was something he already knew, and with how illiterate these people at the wall are, it had to be something commonly known.\nSomething famous that he would know from seeing those people.\n’What could it be..what could it be..?’\n\"S-pact, S-pact...S-pact...\" Mikhail gritted his teeth.\n\"Are you troubled, Mikhail?\"\nMikhail’s head snapped to the side, where he saw Master Vance peeking from a bookshelf.\nIn his plan of getting to his answer quickly, Mikhail chose to at least seek some help.\n\"Master Vance, do you know of any treaty or pact that starts with S? Any famous treaty, maybe related to this Ironhold?\"\nThe old man’s face caught surprise for a second, probably for a second.\nMikhail didn’t fear him much. He did give him a weird vibe but it wasn’t one of danger or distrust.\nIn fact, he was a good man, always wishing the best for everyone on the hold.\nNot every man sent to the wall was rightfully sent. The system of law in the Empire wasn’t perfect.\nPerhaps it was the worst there could be.\nThere were many people on the hold unfairly sent because they were chosen to be the scapegoat for someone’s crimes.\nMikhail knew Master Vance was one of them.\nBesides, the man was already pushing death. There wasn’t much he needed to be careful of.\n\"A pact or treaty starting with..\nhmm..\nS? A famous one too...I can’t say there are many that relate to what you need, Mikhail.\"\nFrustration was seen on the black-haired boy’s for a second.\nBut he quickly masked it.\nWhat if?\nA realization struck his hard.\nOf course, the man couldn’t have known about a pact or treaty when seeing those people.\nWhat if it was something else? What if it were the people?\nWhat if...\nS- Pact, wasn’t a treaty or pact. But an organization?\nMikhail turned to Master Vance, in perhaps his last hope of the situation.\n\"Master Vance, what if it was an organization or group? Something that’s named S-pac-\"\nMikhail was interrupted by a tap of the stick on the hard wood by Vance.\nHe saw his blue calm eyes lock with his, a confirmed expression on his face.\nAs if he knew what he meant now.\n\"You’re talking about Silent Pact, that’s the only answer to your description.\"\nMikhail’s eyes widened, and Vance knew he had been right.\n***\nMikhail stepped out of the library, everything making sense in his head now.\nSilent Pact.\nA famous organization, even later in his previous life.\nIt all clicked up.\nWhat they were famous for...\n’Famous for exploitation of mana sources and wormholes for the use of destruction and resource hoarding.’\nA single part echoed inside his mind from the sentence.\n’Mana sources and wormholes.’\nAnd they had been near a mana source just this morning.\nMagnolia Lake.\nThere was no need to wonder what they were up to.\nHe knew about it.\nForced Wormholes.\nAs the name suggested, these were wormholes forcefully opened by people.\nOftentimes, it was done for training or hunting, however, it was also a method exploited by people for evil as well.\nUsing mana sources to artificially create monster raids was one of the uncommon methods.\nA reason for this was because it took multiple days to set a single wormhole up.\nMost of the times, people would just get discovered before they could stage it.\nWhich was supposed to be the case here as well.\nThe group wasn’t even supposed to get close to the mana source without getting discovered.\nIt made no sense how they avoided it.\nThere was a very minor chance for someone to betray the academy but it was definitely a possibility.\nEspecially from outside as the guards kept record of everything.\nIn any case, what it definitely confirmed to Mikhail was that they weren’t a normal group.\nJust a normal forced wormhole required a lot of resources to open and operate.\nBut from the incident in his past life, there were multiple ones.\nNot only that but to infiltrate the academy security system was no joke.\nHowever, a point was still unclear to him.\nIt was their motive with this attack.\nNo matter how many forced wormholes they orchestrated, trying to execute a Dominique with it was plain stupid.\nA Dominique was a force to be rivaled with.\nEven they probably knew that this would not assassinate a Dominique.\nIt didn’t happen in his previous life too so why do it?\nThey were literally a one person army that you do not want to trifle with.\nA couple of wormholes were barely enough to stop them.\nMikhail could confirm this with definite surety after the incident in his past life.\nNobody would think of it as an assassination plot where the chances of the target were less than even 10%.\nUnfortunately, he needed to figure this out. It still confused him.\nHe could only have any chance of solving it after the incident though. It was useless right now.\nIn any case, most of the information he needed was in his hands now.\nHe knew the people, the targets, the time and how they would do it.\nNow he just needed to prepare for the fateful day and when it would come, he’d be ready.\nThis time for sure, he’d pass the mission and finally find out more about himself.\nClosing his thoughts, he quickly made his way back to the messing hall to eat before joining his squadron.",
      "scraped_at": "2025-11-21T13:54:02.030184",
      "content_scraped_at": "2025-11-21T13:54:02.615566",
      "error": null
    },
    {
      "id": "7",
      "number": "7",
      "title": "Chapter 7: Battle Request",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/7/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 7: Battle Request\n***\nAs Mikhail was exiting the messing halls, he saw a familiar figure in front of him.\nHis grey eyes were already staring at him, as if waiting for him for quite a while.\n\"Lord Commander.\" Mikhail nodded, paying his respects to Vlahovic.\nHe knew that he had been outside but didn’t show it.\nIt was no wonder the chatter had died down.\nVlahovic nodded, accepting Mikhail’s greeting.\n\"Mikhail, you are needed by Master Avalon in his quarters right now.\"\nMikhail tried to hide the annoyance in his face.\nHe was expecting this but it would have been better if they hadn’t linked him at all.\n’Well, nothing I can do.’\n\"Oh, what for?\" He asked, feigning ignorance.\n\"A squadron leader was found dead on a route nearby yours. His body was totally torn by monst-\"\n\"Huh?\" Mikhail was unable to hide his surprise, causing Vlahovic to raise an eyebrow.\nMasking his emotions, he quickly excused himself from the suspicion.\n\"I was taken aback by the news of someone’s death by monsters. The ones I heard were quickly taken care of by me.\"\n\"Oh. Well, it is unfortunate and all the while suspicious that we weren’t able to sense it quickly enough.\"\nMikhail nodded but inside he was just as confused.\n’Monster marks? There is no way they thought of those marks on the man’s body as a monster’s marks.’\nEither the camp was too dumb or the Silent Pact had forced monsters to attack the man’s body to cover their own marks.\nIt was probably that.\nUnfortunately, if they did that then they would have definitely found Mikhail’s involvement too.\nIt wasn’t a problem but it made his work more tougher as the group would now be more careful with their operations.\n\"You are our only clue to what happened so I hope you’ll cooperate. Taking aside your issues with Avalon.\" Vlahovic looked him in the eye.\nMatching his stare, Mikhail sighed.\n\"It’s fine, it’s his issues with me, not me with him,\" Mikhail shrugged.\nHe was right.\nThe Master of Security, Avalon, also among the two masters that were glaring at him in the morning, had unnecessary issues with him.\nWhenever Mikhail used to perform well in training or defeat his guards, the man punished him.\nUnfortunately, the black-haired boy could only suffer as he was a Master.\nFortunately, he was mostly safe from his major threats because of Vlahovic.\n\"That’s all.\" Vlahovic tapped his stick, disappearing into thin air.\n’Well, here we go.’\nMikhail prepared himself for a tiring interrogation session.\n***\n[After 2 Days]\nMikhail stood in the castle’s central ground, with his squadmates.\nHis eyes swept around the area as his friends trained in front of him.\nHe wasn’t just preparing himself with his training, he was still trying to figure out the traitor from the academy.\n’Who could it be?’\nFor the past 2 days, everything had just died down. No suspicious behavior or anything.\nIt was as if now they were just waiting for the main event.\nIn better terms, only 6 days.\nLooking at how slacked these people were, Mikhail wished he could all force them to train all day.\nThis was going to be their cause of death in the coming battle.\nThey were men of the hold, people who were supposed to protect this damn wall.\nYet, you had people looking fatter than the royal pigs here.\nAs he was about to turn back to his teammates, Mikhail was tapped on his shoulder from behind.\nTurning, he saw a group of 5 people behind him.\nJust from a glance, he could tell they were strong but their faces told a different type of strength.\nPaid strength.\nMikhail looked up above on the bridge overlooking the castle grounds, ignoring the five.\nThere he was.\nWith curly black hair with a touch of gray at their tips now and a scrawny face that was screaming displeasure.\nMaster Avalon, staring right back at him.\nThese five worked under him and probably came to him to try and interfere as always.\n\"What do you want?\" Mikhail asked, getting straight to the point.\n\"You must be the punk right, the one who’s always on Vlahovic’s dickroll,\" The man neared him.\nMikhail could smell alcohol off of him, he was drunk. He smelled like he hadn’t taken a bath in a week.\nUsually, words like what he had just said about some higher up would get you executed but not on the Ironhold.\nVlahovic knew about it and didn’t mind it too. He knew these weren’t civilized people to begin with.\nAs for why he said it, it was known to everyone that Vlahovic favored Mikhail.\nThey said it was because of his strength but Mikhail himself didn’t know.\nThe man had been looking after him since he had come here as a kid.\n\"Ay, are ya deaf you asshole?\" The man tried to push him back.\nUnfortunately for him, Mikhail was quick to react, holding his arm in place.\nOne of Avalon’s common tactics. To try and provoke them back into attacking.\nAfraid that it was too easily seen by all of them now.\n\"I don’t think your words relate to what I asked you first. You can either answer me or leave,\" He answered calmly, letting his hand go.\nThe man sneered with rage.\n\"Shut up bastard, I don’t take orders from you. If ya aren’t afraid, why not take me to the sword ay? Ya afraid?\" He roared, attracting the attention of even others now.\nMikhail sighed, already knowing where this was going.\nUnfortunately, he wasn’t falling for the bait as always.\n\"No-\"\n\"Why are you refusing Mikhail? Is the strongest squadron commander afraid to take on a mere nobody now?\"\nA familiar but annoying voice interrupted Mikhail from his rejection.\nLooking up, he saw those dirty brown eyes looking back at him.\nAgain though, this wasn’t going to convince him.\nHis squadron didn’t even bother to look. They already knew this was normal for him.\nHe was a day 1 target for Avalon.\nAs Mikhail was about to reject them again though, a sudden idea struck his mind.\nFrom every day since he had regressed back here, he had been training.\nBut not once had he been tested in a real battle like his past life. The man from before barely even counted.\nHe needed some real challenge, where he could test his [Essentia].\nAnd what better way than to experiment on the pig in front of him.\nAvalon’s goons were always trying to kill him anyways, so what better option could he have?\nAnd so, he grabbed the steel sword next to him, ignoring the training wooden ones.\nHe threw it to the man, surprising even Avalon along with everyone in the process.\n\"Alright, I guess I can take you on for a good beating.\"",
      "scraped_at": "2025-11-21T13:54:03.628669",
      "content_scraped_at": "2025-11-21T13:54:04.208961",
      "error": null
    },
    {
      "id": "8",
      "number": "8",
      "title": "Chapter 8: Oaths",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/8/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 8: Oaths\nMikhail stood in the castle central grounds with the man–who was named Burnip–in front of him.\nThe area had been cleared for their fight with all of them waiting at the edge, full of suspense.\nNormally, fights were common whether just spars or actual fights.\nNobody really cared, all of them were barbarians.\nBut this time was different. Because it was Mikhail.\nMikhail who had accepted a fight willingly into Avalon’s trap.\nEveryone knew how much Avalon hated Mikhail, it was knowledge as common as knowing he was Vlahovic’s favorite boy.\nBut not in their wildest thoughts had they predicted this future.\nEven his own squadron were staring at him with surprise, trying to figure the reason behind his decision.\nThey wouldn’t though.\nMikhail started at Burnip and the ordinary longsword on his hand.\nFor fairness, he himself had been handed two ordinary handguns.\nHe wouldn’t be needing them though.\nHe had enough of using his weapon these days. Now it was time to test up his magic.\nAs he was thinking though, suddenly a holographic screen opened in front of him.\n—————〔Essentia〕—————\n•\n[Otharis]\n﹂ ꝏ\n•\n[Aqualis]\n﹂ Herald\n•\n[Cindralis]\n﹂ Monarch\n•\n[Norvalis]\n﹂ Monarch\n——————————————\n’Oh nice.’\nThe screen was nice but the information inside wasn’t anything new to him.\nIn this world, selective people were blessed with magic as well, their name being Maguses.\nOr Magus for a singular user.\nMagical energy, or mana for easy term usage, was present all around them, even in the body of maguses.\nBut this mana when broken down had natural elements to it, resulting in six partitions.\nThe 6 elements. Cindralis (Fire), Aqualis (Water), Borealis (Air), Gaialis (Earth), Norvalis (Darkness), Divalis (Light).\nThe more elements you were blessed with at your birth, the more talented you were.\nThe rarest possibility was having 3 elements and yet Mikhail was one of those people.\nAs for why he wasn’t a talent in the Empire, he didn’t know and he didn’t care.\nFor the names written below the elements, they were his [Limiters].\nA Magus had 5 ranks they could try to reach in their life, with each rank getting progressively harder.\nMagus, Warden, Herald, Monarch and Archon.\nYour [Limiter] for an element was basically the level at which you could use spells for your element.\nA Cindralis-Magus with a Herald Limiter could never use a Monarch Cindralis spell without serious consequences.\nIt was hard for them to even rank themselves past their element’s limiter anyway.\nIt was a complicated case if you were a multi-essentia magus though.\nUnfortunately, Mikhail had no time to get into the complexities right now.\nFocusing in front of him, he prepared himself for the fight.\nReaching out in his pocket, he took out 2 bullets, loading each in his guns.\nBurnip’s expression turned visibly frustrated, thinking he was not taking him seriously.\nBut Mikhail was quick to clarify.\n\"I’m just saving my bullets, they are harder to get here on the hold.\"\nIt was true.\nIt was also why Mikhail planned to finish this guy off with just 2 of his spells.\nGetting to their positions, Mikhail saw the battle begin.\nAn announcer wasn’t needed on the battles here.\nShouts went off from behind Burnip, cheering him on.\n\"Attack this pussy!\"\n\"He ain’t even a slash’s work!\"\nIt only seemed to work in Mikhail’s favor though.\nHe saw the man’s confidence increase as they circled each other, prompting him to dive in for a slash.\nMikhail, however, knew it was faint to force him to attack.\nEven that blockhead was smart enough to know he had no chance with Mikhail in close range.\nThose guns would blow a hole in his arms or legs.\nWhich was why...\nSLASH!\nA clean whip cut through the air as Burnip’s sword slashed.\nIt was all too simple for Mikhail as he stepped outside to dodge it.\nBut he knew it wasn’t over yet.\n\"Borealis Ballium,\" Burnip pushed his palm from underneath, straight at Mikhail.\nThe latter remained calm, his eyes tracing all of Burnip’s movements.\nIn a moment, Mikhail’s arms were crossed, defending himself from the sharp push of wind in the next second.\nIt tore into his arm sleeves a little but again, he was harmless.\nInstead, Mikhail saw Burnip take more advantage of the push by putting more distance between them.\nThe latter was trying to force Mikhail into using his only two bullets in a moment of hurry.\nWith his element of wind though, the pipsqueak would be able to dodge them quickly enough.\nOnce missed, Mikhail had no weapon to defend himself with.\nUnfortunately for Burnip, the blue-eyed boy had already tested what he wanted to see.\n’I overestimated. This guy is weak.’\nIf all of them in the camp were like him, then it was no wonder a lot of them died back then.\nIn a sense, he didn’t even blame the deaths. These slackheads needed a lesson of where they were.\nBut for now, he needed to give a lesson to one in front of him first.\nFor the first time since the battle started, Mikhail’s hand went to his guns\nIn this world, there were 6 elements.\nBut there was a 7th element too.\nClick. Click.\nMikhail loaded both his guns, his eyes locked on Burnip.\nThe latter was now standing at the edge of the area, waiting for his chance to dodge and hide among people.\nHe knew now not to make any moves.\nIt was all for when Mikhail would shoot. And in his mind, miss from such a distance.\nAnd that 7th element was...\nThe element of Oaths, Otharis.\nHowever, there was another special quality about this element.\nMikhail raised his guns, taking aim at Burnip.\nIt was that this element was only exclusive to Mikhail in this world.\nOnly him and no one else.\n\"In the name of God of Oaths, I will hereby not move from my position throughout the whole battle,\" He whispered.\nMikhail felt it, the same feeling from his past life in his chest. The feeling of similarity. The feeling of chains binding him inside.\n\"As a compensation for the said condition, the shooting range for my guns in both magical and non-magical spells will be doubled.\"\nHe felt it. The chains binding closer and closer. Only one step was left now.\nLooking at Burnip’s expression, Mikhail was once again reminded of something from his past life.\nA thing that people often failed to realize while facing him.\nAnd it was that out of all the elements he possessed...\n\"This oath has been signed under the name of God of Oaths and I, the Oathkeeper, shall abide by it,\" he whispered.\nHis element of Oaths was the strongest one.\nBoom! Boom!",
      "scraped_at": "2025-11-21T13:54:05.223343",
      "content_scraped_at": "2025-11-21T13:54:05.801801",
      "error": null
    },
    {
      "id": "9",
      "number": "9",
      "title": "Chapter 9: Dragmas",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/9/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 9: Dragmas\nMikhail put his guns inside as two pieces of steel flew high in the air.\nIn the next moment, he saw the man hit the ground on his knees, his eyes widened.\nIt was as if he had just seen his life flash before his eyes.\nAnd he had. The bullets had missed by a millimeter from hitting his legs or more accurately, his private parts.\nHe also knew that Mikhail had intentionally waved off his gun at the last second.\nHe knew he had lost. Lost too, in a second of him retaliating back.\nThere was no kind of spirit left in Burnip to reply back.\nAnd the same was for everyone watching, as they were left amazed by how Mikhail even aimed so accurately.\nThe guns he was given were so basic and badly manufactured that it would take you years to control its recoil.\nYet, he did it so effortlessly.\nMikhail, however, wasn’t there to entertain them. He was staring at his pale hand instead.\nAs the fight came to an end, the oath was lifted from his body.\nAnd at the same time, a deep tiredness settled in his body. He knew it was because of the oath’s toll on his body.\nIt was still too weak. Not like his past life, where he could have handled multiple oaths on his body.\nMikhail clicked his tongue in frustration.\n\"Tsk.\"\nIgnoring his thoughts, he looked above where Avalon had already disappeared from the bridge.\nAnd so had his goons as well, taking Burnip along with them.\nWith nothing left to wonder now, everyone got back to their training.\nEven his own squadron, who knew this would happen anyways.\n’I need to get stronger.’\nMikhail clenched his hand.\n\"Spar with me, Modric.\" He called out.\n***\n\"Umbralis Phase.\"\nModric’s leg cleanly phased through Mikhail as it turned into a wisp of black smoke.\nTurning his own momentum on him, the latter grabbed his leg and spun him through the air.\nSlamming him on the ground, Mikhail called an end to their battle.\n\"You take too much time with your calculations. Put too much trust in something that can go wrong.\" Mikhail extended his hand to Modric.\n\"Yeah, I know,\" Modric replied, taking his hand to stand up.\n\"When the battle gets faster, you need to trust your instincts more. Sometimes, they are more useful than all those scenarios in your head.\"\nMikhail strapped his guns to their holsters.\nModric nodded, understanding his advice.\n\"Remember, if battles could be won by knowledge or numberly predictions, those Emperors would be scholars instead of ruthless bastards.\" Mikhail looked him in the eye.\n\"I get it. It’s just that your elements and Dragma are hard to deal with.\"\nMikhail tapped his shoulder several times, encouraging him.\n\"It’s fine, just try to find your way around it. Everything has a weakness, even the hardest of walls.\"\nHe could understand Modric’s frustration though.\nAside from just his elements, the main reason Mikhail was mainly a pain for his opponents was his Dragma.\nA Dragma was an ability granted to a person from their birth.\nIt could range from being the most useless to having the potential to even cause mass-scale destruction.\nThey were so unique that they were almost never the same between two people.\nAnd that was all Mikhail knew about them.\nThere was much more knowledge but up here, there wasn’t much you could know.\nFortunately for Mikhail, his Dragma was one of the most unique you could find out there.\nIt was the ability to form spells without doing incantation for the nodes.\nHe still needed to form the nodes but he was cut out from doing the work of saying the names.\nThat was his Dragma, called Flawlëss.\nFor example, taking a basic spell such as Aqualis Ballium, for the first node where he needed to define the element.\nRather than saying \"Aqualis\" out loud, he can do it with a hand symbol.\nDoing so, obviously uses more mana but it shortens spell times for him by a large amount.\nThis gave him a whole new edge in a battle, often taking his opponents by surprise.\nIt was why most of the people refused to reveal their Dragma.\nA good Dragma could change the tide of the battle within a second, like the one Mikhail had.\nDragmas were tied to a person’s soul tree.\nSo as the person grew in ranks, their Dragmas would evolve too.\nIt was ingrained into them.\nDone with training, Mikhail turned to Modric.\n\"Training is finished, you all can go do whatever you want now.\"\nBefore he could go, he was questioned back.\n\"Where are you going?\"\n\"Just some work, I’ll be back soon,\" Mikhail instantly replied back.\nBut as he was walking, he was again halted in his tracks.\n\"Mika,\" Modric called out.\nIt was the name that he said.\nIt was their personal nicknames that they had given to each other when they were kids.\nSo Mikhail knew it was a personal call out.\n\"Yeah Mord?\" Mikhail answered back, dropping the formalities too.\n\"You good? You seem a bit off lately.\"\nMikhail was surprised but quickly masked it.\nHe would be a fool to think he’d escape Modric’s eye.\nUnfortunately, he could still say nothing.\n\"Yeah don’t worry, just been a little stressed and busy because of the incoming visit. I’m fine.\"\nMikhail assured with a light smile, looking back into Modric’s golden eyes that were boring to him.\nFor a few seconds, there was silence between them before Modric nodded.\n\"Alright, just remember to take care of yourself. That’s the biggest part.\"\nMikhail smiled and nodded.\n\"You too.\"\nAs their conversation ended, Mikhail turned and got on his way again.\n’I’m sorry but I can’t let the same fate happen again. Not to you guys.’\nThe Dominique was about to arrive, and he needed to be prepared.\n***\nIt was finally time.\nToday was the day. The day Mikhail had been preparing for since the day he arrived in this world.\nThe arrival of the Dominique.\nAnd the attack on the camp.",
      "scraped_at": "2025-11-21T13:54:06.807211",
      "content_scraped_at": "2025-11-21T13:54:07.394429",
      "error": null
    },
    {
      "id": "10",
      "number": "10",
      "title": "Chapter 10: Dominiques",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/10/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 10: Dominiques\nToday was the day.\nGetting up early, Mikhail dressed up and headed outside.\nAssembling the squadron, he was the first to reach the drill grounds.\nVarious thoughts ran through his head as he saw the other squadrons report on the ground.\nThe routine for today was not going to be how it was any other normal day.\nThere were going to be no drills, even though they had all assembled in the grounds.\nRather, it was to welcome the Dominique who would be here in no less than an hour now.\n\"Nervous?\" Mikhail turned to ask the squadron.\nAll of them shook their heads except Icarus.\n\"I guess a little. It’s not everyday that someone this big comes to visit us.\"\nMikhail focused his gaze on him, making him shiver a little.\n\"It’s not that I’m scared. It just feels a little odd to be this strict.\"\nHe nodded, turning back forward.\n\"I can understand. But you shouldn’t think of it as something too big. As I always say, they are just Dominiques, not our gods.\"\n\"Uh huh.\" Icarus nodded, straightening up as well.\nThis was what Mikhail always tried to keep separate from his squadron and others.\nNo matter how high they were from them, he never thought of them as gods.\nTheir pride had just carried them too high.\nAnd the people here today would witness it clearly.\nThere was no way to stop what had happened in his previous life. It was clear.\nHe wasn’t able to figure out who the culprit was even after all those efforts.\nAnd even if he somehow could, he had no confirmation of their strength.\nBut what he could do now was at least minimize the casualties.\nFrom his previous life, the Dominique coming today would most likely be Celine Strathorne.\nIf he remembered correctly, she was the newly appointed Dominique La Borealis.\nShe would also be the youngest Dominique in the current council.\nA Dominique was a person only second-in power to the Emperor himself.\nIn total, there were 6 Kingdoms under the Empire, making them 7 in total.\nEach of the 6 Kingdoms represented one of the Essentia, with a Holy Church governing over each of the Kingdom.\nAll of the Kingdoms served under the Emperor and remained loyal to him.\nThe ruler of each of the respective kingdoms was the leader of their respective holy churches representing the elements.\nAlso called the Dominique of that element.\nThese Dominiques, however, were not appointed by the Emperor or by the Church.\nThey were appointed by the Gods above through a mark of a cross called the Rosaryth.\nWhoever was blessed with the Rosaryth after the death of the previous Dominique would be their successor.\nIt did not matter whether they were a peasant or a royal or a bastard or anyone.\nEven the age or gender did not matter. Under the gods, everything was a law and a rule.\nGoing against it would be against the very rules set by their ancestors of the Church and the Empire.\nHowever, a Rosaryth wasn’t only just a mark of position. It was also a mark of power.\nBecause a person blessed with a Rosaryth, had no Limiter for that respective element.\nThe power they could unlock with their element was then endless. There would never be a ceiling for its growth.\nAnd it was the same reason why Mikhail’s Otharis had no Limiter.\nBecause he had a Rosaryth.\nAnd he was also a Dominique, one not known by the Empire.\nOne whose element had no Church or Kingdom.\nHe was Dominique La Otharis.\nIn any case, going back to the original topic, Celine would arrive in an hour or or less.\nAgain, there was no known reason for why she was coming.\nMaybe it was just her interest in the world as a newly welcomed Dominique.\nOr maybe she had an alternative purpose.\nNobody knew.\nMaybe she was just here to kill some people and show her power as a newly appointed Dominique.\nShe was young after all, one could have such wants.\nAnd the Empire couldn’t care less about it anyways.\nAfter all, they thought of the people outside the walls as nothing more than filth to be thrown out.\nUnfortunately, these people here were yet to realize the harsh reality of the truth.\nThey presumed that just because she was young, she was going to take mercy on them.\nIt was all wrong for them though. Celine Strathorne was anything but naive.\nNo.\nMikhail still remembered that look she had on her face that day.\n\"Okay! Everyone, Assemble Up!\" Vlahovic shouted from the middle of the grounds.\nEveryone focused their attention on him.\n\"We have been going through this every year, so I don’t think I need to explain what will happen!\"\nHe looked at everyone for confirmation and everyone nodded.\n\"Good! Just get through this day as always and everything will go back to normal.\"\n\"Yes Commander!\" A loud voice of agreement came from the squadrons.\nThe visit routine wasn’t all that complex.\nThe Dominique would arrive at the camp.\nThey would inspect the camp. If they chose, they could also interact with the squadron leaders.\nThey would also check the drill routes outside of the academy to see how well the camp maintained the area.\nThese were the main things that made the visit so important.\nIn the first place, Mikhail didn’t understand why Celine had informed them of a formal visit.\nUsually, even if they wanted to come, Dominiques would come and go whenever they wanted or pleased them.\nIt was their world and most of them preferred it like that to not let their moves be known by the world.\nBut since it was a formal visit, there was a need for a proper visiting routine too.\nUsually, it wouldn’t take long as the Dominique would want to get out of the place as early as possible.\nBut if anything went wrong, they could do anything and the Empire wouldn’t object to it.\nTo the government, Dominiques were their golden childs.\nA couple of lives or some destruction was nothing compared to their worth.\nThey would go to any length to spoil them.\nMikhail was suddenly woken up from his thoughts by a shout.\nA shout that marked the beginning of it all.",
      "scraped_at": "2025-11-21T13:54:08.403463",
      "content_scraped_at": "2025-11-21T13:54:08.984599",
      "error": null
    },
    {
      "id": "11",
      "number": "11",
      "title": "Chapter 11: The Gate",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/11/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 11: The Gate\n\"THE DOMINIQUE HAS ARRIVED! PARADE, STAND IN ATTENTION!\"\nThe single line was enough for everyone to be brought back to reality as everyone’s feet moved in synchronization.\nTHUMP!\nEveryone stood in attention as complete silence overtook the grounds.\nNot a single sound or movement was let out as Vlahovic turned towards the entrance of the castle grounds.\nTheir position made it so that the entrance was right in front of Mikhail’s eyes.\nAnd it was from there that he saw it.\nAs clear as if it all had happened yesterday.\nTap. Tap. Tap.\nThe sound of heels tapping against the stone pathway echoed in his ears.\nAnd she entered his view, looking just how she did on that day.\nWith natural grace and poise, she entered into the ground.\nWearing the black and red military outfit that hugged her slender body, the golden ampulets displayed her status as a Dominique.\nHer blonde hair neatly fell down her face in an asymmetrical bob, almost framing her emerald green eyes.\nCeline Strathorne.\nEverything about her was calculated, as if she wasted no movement or energy.\nA sharp wind blew through the area, lasting no longer than a moment.\nAnd in that single moment, it was as if her eyes had swept through the whole area.\n’Insane.’\nEven standing this far, Mikhail could feel the passive pressure weighing down on him.\nEven the air felt as if it was much thicker than before.\nCeline turned to Vlahovic, who performed a proper salute before handing over the report for drills.\nThe whole ground stayed silent as she checked the reports in the distance.\nWithin a minute, she was done.\nShe turned over to the grounds next, walking over after handing back the papers.\nAt this point, Mikhail had already felt some people looking at her with awe and admiration.\nAnd it disgusted him to the core.\n’A few more minutes. That’s all you people will need.’\nReaching the middle of the ground, Celine straightened herself, making sure everyone’s attention was on her.\nAnd then for a minute, she just stood there in silence along with everyone else.\nAnd when it finally felt like some people were getting impatient, she opened her mouth.\n\"Filth.\"\nHer soft and monotone voice resounded in everyone’s voice as clear as the wind.\n’Resonance Magic.’\nMikhail figured out.\nBefore everyone could get confused on what she meant, Celine continued.\n\"That’s what you all are.\"\nAnd a wave of silence hit the arena the next instant. Nobody had expected her to start her speech with that.\nMikhail immediately felt a few people stirring.\n’This is just the start.’\n\"Nothing more than a useless pile of filth. Filth, unnecessary to be kept in the Empire’s clean walls.\"\nSounds of fists clenching could be heard in the crowd now.\nYet, despite all that, not a single person could dare to break the silence.\n\"Your birth inside those walls was already sufficient enough of a taint that throwing you here should feel like a blessing to you people.\"\nAt this point, except Mikhail’s squadron, signs of rage could be seen everywhere.\nEven Vlahovic had a look of shock on his face as if he couldn’t understand what happened.\nIt was well known that all Dominiques hated the Morvians.\nBut in the history of visits, there was not a single time where they bothered to give a speech on their hate.\nCeline, who could very well see what was happening, still continued.\n\"You are nothing more than a pile of rotten slaves. Your existence does not remain past the point of serving us to our use.\"\nA chilling wind blew through the area, sending shivers crawling through everyone’s back.\nMikhail could feel the rage reaching the boiling point for everyone.\nBut he also knew that Celine knew that very well.\n’Huh?’\nMikhail felt as if for a split moment, someone had been staring at his back.\nUnfortunately, he was given no time to think as Celine delivered the final nail to the coffin.\n\"Even the monsters behind those wormholes have more worth than you pathetic junks.\"\nYet, before the crowd could rage, the ground shook with a large rumble.\nRUMBLE! BOOOOM!\nIt was followed right after by an ear-deafening explosion at the gate.\nImmediately, confusion and disarray spread through the area.\nPeople struggled to maintain their balance and focus as screams erupted in the area.\n’It has started.’\nMikhail, remaining calm along with his squadron, slightly turned his head back to them.\n\"Keep them close. Let me see what’s happening,\" he told Modric, who gave an understanding nod.\nFootsteps were heard as a man came running into the ground to Vlahovic.\nHe was fully bathed in blood.\nBlood that kept pouring out of the gash on his right side, which was armless now.\nEveryone turned silent as the guard reached Vlahovic, their horrified gazes fixed on him now.\n\"What happened!?\" Vlahovic shouted, asking to get any hold of the panicking situation.\nBut the words that would come out of the guard’s mouth next would be the words that would haunt people’s minds for years to come.\n\"A barrage of wormholes...\npant...\nall of them Warden rank or below...\npant..\nand..\"\nA wave of horror swept through everyone as the reality set in.\n\"And what!!?\" Vlahovic gripped his shoulders and shouted, already fearing what was to come next.\nIf there was anything amidst this incident that Mikhail still remembered exactly on point from his past life....\nIt would be the next words echoing in the grounds from the guard.\n\"The gate. It was left opened.\"\nSLICE!\nA head flew in the air, blood splattering all over the ground and Vlahovic.",
      "scraped_at": "2025-11-21T13:54:09.998888",
      "content_scraped_at": "2025-11-21T13:54:10.580875",
      "error": null
    },
    {
      "id": "12",
      "number": "12",
      "title": "Chapter 12: Response To The Attack",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/12/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 12: Response To The Attack\nAs the guard’s head flew in the air, blood splattered in the air.\nIt fell down on Vlahovic and the others, covering their shocked and horrified faces.\nTHUMP! THUMP!\nFrom behind the trees, a humongous figure appeared into view.\nThe ground shook with every step it took.\nBlood dripped down from its sharp canines and claws as its ferocious golden eyes darted left and right for the next prey.\nShrouded in horror, every man was unable to move under the pressure of the giant feline monster.\nThe only ones who still remained in their senses were Vlahovic, Celine and...\nMikhail and his squadron.\nHe observed everything happening with a calm expression.\nAnd it was the same for the ones behind him, who had experienced much worse than this along with him.\nHowever, as said, it was not the same for everyone.\n\"Don’t you dare move bastards.\"\nVlahovic cursed the men, still remaining under the beast’s eye.\nUnfortunately, some of the weaker hearted men were too scared for their lives.\nThose stewards were seeing Sylaris for the first time.\nNot being able to take the pressure anymore, one finally made the run.\n\"I can’t!! Save me!\"\n\"No!!\" Vlahovic screamed as he quickly sprung in front of the sylari to hold him off.\nBut something even he didn’t expect was another sylari to jump out from the trees.\nWith the body of a half-mantis and half-tiger, it was smaller but much faster.\nMikhail watched Vlahovic try to counter and reach the second beast with a spell but..\n’He won’t be able to make it.’\nWhich left only one person who could reach him fast enough.\nEveryone’s eyes instinctively moved to Celine at the last moment, expecting some help.\nThese empirical bastards might hate them but they were still to their use right?\nShe was definitely not just going to let them die here. Not the whole camp.\n’Wrong.’\nThey all froze when they saw the expression on her face.\n’The same expression she had on the last time.’\nThere it was.\nOne of pure and absolute disregard of their lives.\nAs if she had no concern of what was happening in front of her.\nIt was at this moment that every man in the camp realized.\nThey fucked up.\nThe Dominiques or Empire had nothing to do with their lives or well-being.\nTheir existence was comparable to that of a simple paper.\nWeak and feeble with no importance whatsoever to them.\nIn that split second, it felt as if the time had frozen for everyone. Like it was truly the end for most of them.\nBut then...\nClick. Cluck. BOOM!\nAn ear-deafening boom resounded from the corner, as something tore through the air.\nCRUNCH!\nWithin the next second, the nearing head of the monster was torn off its body, exploding into a thousand tiny pieces.\nEvery man looked in shock at the monster’s lifeless body lying on the ground.\nIt was only when their senses started to return that they followed the trajectory of the shot.\nTheir eyes landed straight to a young man in the distance.\nThere was no sign of distress on his face as he stood there with a gun in his hand.\nHis eyes were as calm as the blue sea they embodied.\nLowering his gun, Mikhail noticed Celine spare an interested glance to him from the side.\n’I have no time to entertain their bullshit plans.’\nUnfortunately, because of her, he also couldn’t use his oath powers.\nIt was a well known fact that Dominiques could sense other Dominique’s power within a certain distance.\nIt was one of the methods they used to identify the new Dominique.\nMikhail didn’t know if it was the same for his element. However, he couldn’t take risks.\nHe had to make do with his other elements.\nFeeling that everyone’s eye was on him now, Mikhail knew this was the right moment.\nStepping forward, he reloaded his guns.\nClick. Clank.\n\"Listen closely because I’ll not repeat again. This isn’t the first time you people are facing such threats, so stop crying and screaming.\"\nEven most of the stewards here came from getting their lives in bad situations and then getting caught for it.\nMikhail turned back to Modric, giving him the gesture.\nThe latter nodded, and turned back to convey his order to the men.\n\"You have faced such beasts outside, you can face them if they come inside. Don’t act as if you are going to die.\"\nMikhail raised his gun again.\n\"Cindralic Morphis.\"\nBOOM!\nThe bullet passed straight through the crowd, blowing the head of another monster.\nIts headless body fell down the bridge from where it was trying to sneak through.\nThe men who just witnessed what happened were left in complete awe now at his precision.\nBut Mikhail quickly brought them to their senses.\n\"There’s no difference between you fighting them outside or inside. So grab your weapons and start fighting if you don’t want to die.\"\nFrom the side, Mikhail saw Vlahovic arrive as well.\nThe humongous monster he was fighting at the side was now completely torn to shreds.\n\"Mikhail is right. This isn’t your first time and it never will be.\"\nHe cleaned the blood off his sword.\n\"This is how life outside the walls is, you will need to fight and survive against such unexpected situations.\"\nEveryone visibly suppressed a gulp and nodded, now mustering up their courage and confidence.\n\"According to the information, it’s a multiple wormhole breach. Let’s hope there aren’t many to handle.\"\nVlahovic ran a look around the area.\n\"You bastards.\" he gestured to the stewards and smiths.\n\"Stop acting like you’ve never swung a thing in your life. Take whatever there is and get to fucking fighting before I blow your heads myself.\"\nSilence. Ruthless Vlahovic was one of the very rare sides that they ever got to see.\nAnd of course, they knew the price for raising their voice against that.\n\"There’s too many monsters. The moment they get inside, we are all going to die and help from other camps will arrive too slow.\"\nMikhail nodded.\nThe man was right.\nThere were 15 camps lined up along the wall. Even though theirs was the biggest, help from others was going to take a while to arrive.\nSo they needed to hold up or the place they lived in would get destroyed in a matter of minutes.\n\"Our first objective is closing the gate and clearing any monsters that have gotten inside. Only then we can move above the walls and attack them from above.\"\nVlahovic affirmed his statement.\nHe then turned to Mikhail.\n\"Take however many people you want with you Mikhail and close that fucking gate down. I’ll go up and assess the situation. You are the leader down below.\"\nThe words were also his order to everyone else in the area.\nIt was clear that people had objections but currently their lives held more importance to them.\nAnd Mikhail had clearly shown his abilities so they naturally felt safe around him.\nChecking up on everything, Vlahovic turned back to the men he had with him.\n\"Time is short. The more we delay it, the more destruction we will face. Spread out to different parts of the camps and clear the area of beasts.\"\nNot a single complaint was heard. Everyone agreed with what the old man said.\nHe clearly knew better than them.\nAs everyone started spreading out, Mikhail was called out by Vlahovic.\n\"I’m leaving the attack to you, make sure to return my trust back in full.\" he cracked him a proud smile.\nMikhail’s brows raised his surprise.\nHe had been waiting to ask this to the old man.\nHow had he given the gates and charge of the men to him so easily?\nEven if that was what Mikhail wanted to ask of the old man.\nUnderstanding his surprise, the old man spoke up.\n\"This attack, you already knew something about it didn’t you?\" He asked.\nMikhail’s eyes widened with surprise.\n\"No wonder you were acting so off these days. Don’t worry, it’s not that I think you are the main cause behind this.\"\nHe put a hand on Mikhail’s shoulder to calm the young man down.\n\"Far from it. I’m sending you there because I think you know the real people behind this.\"\nMikhail was taken aback momentarily.\n’How did he even-’\nHe saw the old man let out a slight laugh.\n\"My bones might be old young man, but not my brain. You know how to stop this don’t you?\"\nFor a moment, Mikhail was left speechless by how much he knew.\nBut returning to his senses, he nodded.\n\"I do.\"\nVlahovic smiled, tapping his shoulder.\n\"Then get going lad. I’m counting on you to end this before my bones run out of rum.\"\nMikhail bit his lip but nodded slowly.\n\"Yeah...I got it.\"\nVlahovic gave a light ruffle on the head before turning to leave.\n’Crazy old man.’\nTurning, Mikhail quickly ran to his group.\nInitially, his plan was to ditch them to run towards the gates but now, it was much easier.\nHe was just going to take the whole platoon there.\n’I’m grateful. Lord Commander.’",
      "scraped_at": "2025-11-21T13:54:11.587971",
      "content_scraped_at": "2025-11-21T13:54:12.181992",
      "error": null
    },
    {
      "id": "13",
      "number": "13",
      "title": "Chapter 13: Retaliating Back",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/13/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 13: Retaliating Back\nAdvancing through the thick trees, Mikhail’s eyes darted to the left and right.\nBeing surrounded by such a thick environment reduced their range of attack and visibility.\nSo feline monsters had it easy to sneak up on them.\nWithout stopping, Mikhail turned his head and ran an eye over the people.\n’42.’\nThat was the amount of people he had with him.\nFor the danger level of the gates, that was certainly low.\nHowever, it was fine as Mikhail alone would be the one dealing with the main problem.\nUnfortunately, there was one big problem.\nMikhail’s eyes went to the corner of the sky where he could see a woman flying above them.\n’Why is she here rather than with Vlahovic?’\nCeline Strathorne had decided to follow Mikhail’s plan instead of Vlahovic.\nFor whatever reason, he could not know with that straight expression of hers.\nMikhail resisted clicking his tongue.\n’I can’t use my Dragma now.’\nBefore, he could at least hide from the members but as a Dominique, Mikhail had no doubt that she would see it.\nNot like something would happen with her seeing it.\nBut for Mikhail it was one of the major surprise cards he had over opponents.\n’Whatever.’\nHe turned to the front, opening his mouth for the first time after running.\n\"All the tankers and shielders come to the front. The rest, slow down your pace and give them space.\"\nHaving led parties of this size in the past, Mikhail knew exactly what to do.\nHe wasn’t new to this.\nTrusting him from before, the platoon moved according to his commands.\n\"Form a wall at the front. I want the larger ones standing with even spaces in the row with the smaller ones between them. Keep your shields at the ready.\"\nHe could hear some mixed opinions coming from the crowd but they still listened.\n’These are the best positions. Walking among the trees, our weakest positions are the corners and sides.’\nThis was why he placed the larger guys there.\n\"Next up, the archers and scouts. Place yourselves between the places of the large tankers with your bows stretched out and your arrows nocked.\"\nFinally, the formation started to make a little sense to them.\nHeeding his command, the archers and scouts also came at the front, fitting between the spaces.\n\"Gun shooters stand behind the large guys, use the shields and their bodies to your advantage to hide and shoot.\"\nComing to stand in the middle as well, Mikhail completed the second row.\n\"The remaining melee attackers in the middle. Save your energy for the main battle at the gates. However, keep watching the sides for the monsters there.\"\nMikhail saw them suppress a gulp. But at least they agreed.\n\"Switch from time to time to rest and conserve your energy. Don’t tire yourself before we even reach there.\"\nReloading his guns, he gave all of them a cold stare.\nTo remind them of the reality, the situation they were in.\n\"Once again, this isn’t a drill. This is fight-or-death, just a taste of what would happen after you get out of here. Don’t over exert yourself for your ego, only to lose your life.\"\nMikhail turned to the front after finishing his words.\nThe second he did, he heard movements between the tree branches.\nHis body wasted no time.\n\"Shields!\"\nImmediately, the corner shielders raised their shields at his order.\nTHUD! THUD!\nThe very next second, contact was made with the shields. The monsters growled in pain at the sudden interference.\n\"Archers and shooters!\"\nSeizing the moment, the ready archers and shooters immediately sprung to action.\nAs soon as the shields were let down, the arrows and bullets tore through the monsters.\nIt didn’t even take a second for them to die, their lifeless bodies falling on the ground.\nCheers of happiness and awe were let out from the platoon as they realized how effective it was.\nTheir trust and respect for Mikhail increased even more now.\nHowever, Mikhail knew not to celebrate this early.\nRaising both of his guns in different directions, he spoke up.\n\"Cindralic Morphis. Aqualic Morphis.\"\nBOOM! BOOM!\nThe very next moment, two high speed bullets shot out from him to the front.\nOne was enveloped in a trail of fire while the other had a torrent of water surrounding it.\nPLUNGE! PLUNGE!\nTwo large wolf heads flew in the air from the front as the bullets made impact.\nBlood and pieces of flesh flew through the air as their lifeless bodies fell down, silencing the crowd.\nMikhail was the first to break the silence.\n\"Stop letting your guard down and celebrating as if’ we’ve already won. You are just asking to be attacked again.\"\nClick. Click. Cluck. Cluck.\n\"I’ll handle the monsters after you shoot and reload or any large monsters incapable to be stopped by the shields.\"\nMikhail turned to the front again.\n\"Now let’s move. We are short on time.\"\nThe party, who understood their mistake now, nodded.\n\"Understood!\"\nAnd they started running again.\n***\n[After 5 Minutes]\nMikhail could finally see the gates in sight, as the trees came to an end.\n\"Prepare yourselves. After we’re out of the trees and buildings, we will have no cover to ourselves.\"\nReloading his guns again, Mikhail turned to the shielders.\n\"Prepare yourselves. You will need to face the first brunt of the attack. It’s going to be hard.\"\nFortunately, after killing so many monsters, the shielders were brimming with confidence.\n\"We understand!\"\n\"Good. Get through this and celebrate all you want.\"\nAs his last words trailed off, Mikhail’s party finally came out of the trees.\n’This is the moment. Where at least 150 people lost their lives last time.’\nThe Gates Of the Massacre, as the academy would later come to call them.\nAnd as he gazed ahead now, he was reminded of his previous life again.\nMikhail could hear the people behind him already lose hope within a second.\nHorrified gasps escaped their mouths.\nRight where the gate was supposed to be first was now an army of monsters.\nIf Mikhail had to estimate, at least 60 already.\nAnd more coming out of the forest outside the gate.\n’Madness.’\nIt was the only word that came to Mikhail’s mind as he gazed at the Sylaris that were running towards them now.\nLast time, he had been in another location so Mikhail was able to survive this atrocity.\nBut not this time.\nFortunately, he was not without a plan as well.\nThere was only one option.\nPointing his guns, Mikhail could already feel the people behind looking as if he had gone insane.\n\"No don’t-\" He heard someone beg him from behind.\n\"Cindralic Morphis. Aqualis Morphis.\"\nBOOM! BOOM!\nTwo heads and a million growls escaped into the air.\n_______________",
      "scraped_at": "2025-11-21T13:54:13.194283",
      "content_scraped_at": "2025-11-21T13:54:13.776716",
      "error": null
    },
    {
      "id": "14",
      "number": "14",
      "title": "Chapter 14: Reaching the Holes",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/14/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 14: Reaching the Holes\n’Now’s the time.’\nUtilizing the chaos to his advantage, Mikhail broke free from his group formation.\nHowever, he still didn’t plan to just let them die.\nThere still needed to be someone to lead them.\nAnd his eyes went straight to a person in his row.\n\"I got something to take care of. I’ll trust you to take the lead Van.\" He tapped his shoulder.\nYvan was taken aback by his sudden action and words.\nMikhail was planning to leave these people just now?\nIt would have left any other person confused and disarrayed.\nBut Yvan calmed him self, thinking upon his words. He had just called him ’Van.’\nWithin the squadron, everyone had nicknames for each other as a kid.\nIt was normal for them to talk using those when they were alone. However, if there was one person that used them the least it was Mikhail.\nIt didn’t mean that he didn’t love them. In fact, he was the most caring one out of all of them.\nThey looked up to him as an older brother. It was just that he had difficulty expressing his emotions.\nIn the rare cases that he did use the nicknames though, the family knew that they couldn’t deny or argue against his orders.\nBecause it was a personal request from a family member to a family member rather than as a squadron commander to a subordinate.\nAnd within the family, no one ever denied to help each other.\nWhich was why he was instantly willing to take on what he said.\nHe trusted Mikhail enough that whatever he was going to do was probably more important than facing an army of monsters.\n\"I understand,\" he nodded.\nMikhail gave him a light smile to express his gratitude.\n\"Thanks.\"\nAs soon as he turned to leave, he called him out again.\n\"But be careful out there. In whatever you are doing, Mika.\"\nStopping for a second, Mikhail turned back and gave him a nod.\n\"I will,\" he said before speeding off.\n***\nThere were two ways to stop a wormhole produced from a mana source.\nOne, the most obvious one, was to just defeat the monsters that came outside of it.\nOr two, to destroy the object that was ruining the mana frequencies at the mana source.\nThe object could be anything. An artifact, a person, or even a phenomenon.\nThe point was to just balance out the mana disturbances.\nHowever, it didn’t come without high risks either.\nWhen balancing out the disturbances and frequencies, one had to be extra careful.\nOne misstep or loss of control could cause them to go haywire, making a disaster even worse than before.\nThe wormholes would either explode or even more would open up in addition to the current ones.\nWhich was definitely something Mikhail couldn’t afford.\n7 gates were already enough of a disaster as it was before.\nThe men of the hold could never handle more or even an explosion.\n7 large-scale explosions would completely destroy the mana source and atmosphere there.\nAnd this would result in an even higher rate of wormhole openings in the future.\n’I can’t mess this up.’\nMoving forward through the clouds of dust, Mikhail was left with nowhere to run when a horde of beasts jumped towards him.\n’I’m sure she can’t see me through the dust.’\nWhile he knew about Celine’s ability to observe everything through the air, he was pretty sure it wasn’t the same for dust or anything else.\nThough he could be wrong. It wasn’t anything more than a hunch.\nRegardless, there was no choice right now.\nRaising one hand in the air, he joined his two fingers with his thumb before bending them, forming a sign.\n\"Cindralis.\"\nThe first node for element.\nThen he closed the two fingers, performing another sign with his last three fingers.\n\"Fumivex.\"\nThe second node for the state of the spell.\n\"Spinora.\"\nThird node for its shape or motion.\nAnd he was done.\n\"Cindralic Hurrialis.\"\nThe instant he completed the spell, the complex circuit diagram in front of him lit ablaze in a crimson glow.\nAll the nodes connected with each other, completing the spell.\nWHIRL!\nThe very next moment, a vermillion hot tornado formed around Mikhail, mixing with the dust clouds.\nThe sharp hot winds tore through the scales of the nearing monsters, throwing them in the air.\nTaking both his guns out, Mikhail wasted no time shooting.\nBOOM! BOOM! BOOM! BOOM! BOOM!\nIt took no longer than a second, as five big holes ruptured through the now defenseless monsters.\nMikhail, however, took no notice. He had already started moving forward.\nTHUD! THUD! THUD! THUD!\nClick. Click. Cluck. Cluck.\nThe lifeless bodies fell on the ground, halting the charge of other monsters as well.\nFortunately, Mikhail had already moved ahead.\n***\nAfter half an hour of relentless killing and dodging, Mikhail was finally able to exit the camp gate.\nThe gate was in full chaos now.\nThe screams and growls could still be heard from behind but due to the large clouds of dust, he couldn’t see anything.\n’Just hold strong Yvan.’\nPeering ahead into the forest, Mikhail estimated the distance he had left.\nThe straight route from the gate took him at least 20 minutes last time.\nThe 20 minutes were also done on a horse, so it would definitely take him longer on foot.\n’I can’t go the straight route.’\nThe monsters were charging straight from the wormholes to the gates.\nSo going this way would inevitably place him right in the center of their assault.\n’It’s longer but I’ll have to take the roundabout.’\nWhich prolonged the time even more.\nA window appeared in front of him, which he had gotten used to seeing in his past few days.\nIt displayed the amount of mana he had left in points.\n—————————\n• Mana: 4100/6400 [Dragma]\n—————————\nHe had already wasted a lot of mana and yet, he wasn’t even at the main fight.\n’There’s no choice.’\nReaching there faster required him to use more spells.\n\"Cindralic Bormis\"\nThe next instant, a trail of blazing fire shot out from his hands, propelling him into the trees.\n***\n[15 Minutes Later]\nThe trail of blaze finally died down from Mikhail’s arms, landing him safely on the tree.\nHe was not so far from the wormholes now.\nRUMBLE! RUMBLE! RUMBLE!\nHe could hear the monsters charging in hordes from afar.\n’There’s definitely a summoner or tamer in them.’\nIt was the only way they could direct the monsters toward one direction.\nFrom here, he had to proceed with more caution.\nHis mana was already down to 3400.\n\"Huff...Huff..\" Mikhail could feel the tiredness from fighting too much already catching up to him.\n’Damn it with this body.’\nCompared to his past life, it was weak both physically and spiritually.\n’My condition doesn’t help as well.’\nIgnoring the tiredness, Mikhail jumped to the next tree silently.\nAnd finally, he could see his destination in the distance.\n7 gigantic wormholes, right by the lake’s shore.\nAnd right next to them were...\n’Impossible.’\nMikhail’s eyes widened.\nIt wasn’t just a group of 3 to 5 people. No.\nThere were much more.\n_________________",
      "scraped_at": "2025-11-21T13:54:14.782174",
      "content_scraped_at": "2025-11-21T13:54:15.364834",
      "error": null
    },
    {
      "id": "15",
      "number": "15",
      "title": "Chapter 15: Making Sacrifices",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/15/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 15: Making Sacrifices\n’At least 16 people.’\nMikhail assessed the dire situation with a calm expression.\nAs difficult and impossible the current scenario was, he didn’t feel any fear or nervousness coursing through him.\nHis body? Maybe. But his soul and mind? No.\nMaybe it was the effect of the battles in his previous life.\nIn any case, the problem had turned out to be much bigger than expected.\nThere were at least 16 people in front of him around and behind the wormholes.\nAll of them were dressed in oversized black robes with golden runic patterns embroidered on them.\nTheir arms and faces were both covered so he couldn’t even see who was controlling the monster’s charge.\nMuch less their faces.\n’It’s going to be impossible for me to handle them all at once if they are equal to my strength or a little less.’\nThe only slim hope he could see was if they were all Magus-ranked.\nBut that was pretty much impossible.\n’If they were, they wouldn’t be able to control all these monsters.’\nTheir control over the monsters was impeccable. To the point that not a single one dared to even attack them.\nAs soon as they got out, they charged straight to the gate.\n’This is a little problematic.’\nAs much as he wanted to kill them right here, Mikhail knew that it was impossible.\nIt wasn’t the main goal anyways.\nThe first goal he had to achieve was to close the gates.\nThere were two ways to balance out the mana frequencies and close a gate.\nOne, obviously, was to eliminate the people or sources that were disturbing them in the first place.\nOr second, was to balance out the mana disturbances with your own mana frequencies.\nThe second one was basically a myth.\nThe reason for that was that it was almost nearly impossible to do it besides a few rare instances in history where people were able to do it.\nTo explain, every attack that a magus did basically had a mana frequency to it.\nThe frequency behind that attack was determined by at least a thousand factors in the attack.\nSpeed, shape, density etc.\nSo to intentionally shape out an attack to match the mana disturbance frequency was almost unheard of.\nYou needed extreme mana control to be able to do that. And an insane amount of precision.\nA slight miss could cost him big time.\nThe number of gates would contribute to the difficulty in any other case, but not here.\nIt was because all the gates had been produced by a single source.\nSo all of them were operating at the same level.\nAll Mikhail had to do was balance out the frequencies for a sufficient time until the gates would successfully shrink and shut down.\nOf course it was easier said than done.\nThere was only one way for him to balance out the frequencies of his attacks to the wormholes.\nIt was to make an oath.\nAn oath with a Dominique present right in the area.\nHe didn’t know if Celine would sense it from that far in the battlefield.\nHe didn’t even know if she could sense Otharis.\nBut currently, it was his best chance to get done with this matter besides fighting them.\n’The problem is..’\nMikhail would need to make a high sacrifice and consequence to be able to tune his attacks down or up to match the holes.\nThe sacrifice in an oath was the condition you made for the oath.\nIt could be giving up something temporarily, an objective or anything.\nAnd the consequence was of course the penalty for failing the oath.\nOne of the main differences between the two was the comparison.\nThe consequence always had to be greater than the reward.\n’There’s no other choice.’\nHe could only hope that Celine wouldn’t sense it.\nMikhail raised his hands.\n\"In the name of God Of Oaths, I solemnly swear to not move out of range from the foes during the whole battle, remaining locked to the restricted area.\"\nJust like always, he felt the chains start to bind in his heart.\n\"As a compensation, all my mana attacks or spells shall be tuned to the specific frequency of the wormholes even if the disturbance level changes.\"\nThe chains almost covered his heart when,\nAs he feared...\nTUCK!\nThe chains suddenly halted, not moving forward.\n’As I thought, the sacrifice isn’t enough.’\nHe needed to sacrifice something more.\n\"As an additional sacrifice, I swear to not use my Aqualis element during the whole battle while limiting my Norvalis spells to Magus rank only.\"\n’Yes.’\nHe felt the chains moving again.\nCLINK!\n’Finally.’\nIt worked.\nNow the final phrase.\n\"This oath has been signed under the name of God Of Oaths, and I, as the Oathkeeper, shall abide by it.\"\nMikhail felt the chains connect together in his heart, sealing the oath.\nIt was complete.\nNow for the moment of truth.\nMikhail remained in his position for a few seconds, holding his breath.\nIf what he feared was true, then any second, she would arrive at his location.\nThump. Thump. Thump. Thump.\nMikhail could even hear his faint heartbeat in the tense silence, despite the loud charge of monsters in the distance.\nIt was as if all sound had died out for him in the moment.\nA few seconds passed by.\n’Surprising.’\nFortunately, there was no change whatsoever.\n’Seems she didn’t sense it from that far.’\nOr it could be something else.\nCurrently however, he had no time to think about that.\nHe had already wasted 2 minutes.\nTaking a deep breath to calm himself down and balance himself, Mikhail raised one of his guns.\nIt was already loaded.\nThe distance from the trees to the group in the distance was certainly far.\nBut Mikhail took his aim to the nearest one.\nIt would still be impossible for the average shooter but Mikhail had been using guns as a kid.\nEspecially the ones strapped to his waist.\nThe guy wasn’t that tall and from what he could see, he wasn’t playing that much of a role as well.\nHe just stood there, gazing into the distance.\n’Maybe he’s a guard.’\nAs much as he would like to shoot the important ones in the distance, this was the only option he had.\n’Better than nothing.’\nTaking aim, Mikhail positioned his gun just slightly above the head.\nHe couldn’t see the person’s face from here.\nOn the other hand, Mikhail started to perform hand signs again from his free hand.\n\"Cindralis.\"\nThe spell diagram appeared in front of him again.\n\"Fumivex.\"\nThe second node on the diagram lit up, joining the line to the first one.\n\"Morphis.\"\nThe third nod lit up, lighting the whole spell diagram ablaze.\n\"Cindralic Morphis.\"\nAnd then...\nBOOM!\n__________________",
      "scraped_at": "2025-11-21T13:54:16.369627",
      "content_scraped_at": "2025-11-21T13:54:16.952710",
      "error": null
    },
    {
      "id": "16",
      "number": "16",
      "title": "Chapter 16: Final Step",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/16/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 16: Final Step\nThe sound of a gunshot was heard as a clean beam of blazing fire split through the air.\nPLUNGE! BOOM!\nIt didn’t even take a second for it to be over.\nA shower of blood exploded into the vicinity as the figure’s head burst apart.\nAnd then, it was all chaos.\nAt that moment, every figure’s head snapped toward the headless member’s body on the ground.\nMikhail wasted no time taking advantage of the confusion and chaos.\nAs much as he would have liked to hunt them from the trees, he had made an oath.\n\"Norvalis Morphis.\"\nA wispy smoke covered his legs and feet as the words escaped his lips.\nClick. Cluck.\nThe next moment, he jumped outside of the trees into the field.\nLanding on the grass, however, his feet made no sound at all.\nThe spell completely suppressed it.\n’I need to get this done quickly.’\nHe could already feel his mana dwindling rapidly.\nThe oath had attuned the frequency of his attacks perfectly to the gates.\nHis eyes moved to the seven gates in the distance.\nAs expected, he could see the borders of the gates waver.\nIt was working.\nHowever, there was some good news and bad news.\nSince the disturbance frequencies were higher, the oath had heightened his mana frequency levels to match them.\nAlthough due to the oath, it canceled the stress on his body for high-frequency spells...\nThe mana consumption didn’t remain the same.\nWhich meant that for each attack he did now, he couldn’t adjust the mana consumption.\nIt would remain high all throughout the battle.\nHe could only hope it was enough to close the gates now.\nFocusing his attention on the front, Mikhail saw that the Silent Pact members had already gotten alert.\nTHUMP! RAWRR!\nSuddenly, the ground shook with a tremor, almost throwing everyone off balance.\nMikhail quickly reacted, planting his feet on the ground.\nBut it wasn’t over just yet.\nHe felt the hair on his back stand up and his instincts screaming for him to jump.\nAnd that was what he did.\nTHUD!\nMikhail had never been so fortunate to jump, as the instant that he did, a gigantic foot smashed on the ground.\nHiding in the clouds of dust, Mikhail looked up in the sky to see a humongous monster.\nAlmost the size of a dinosaur.\n’Their control probably shook with that surprise.’\nIt was the only reason that came to his mind.\nAnd it seemed to be correct, as he saw the monsters change their direction to the gates again.\n’I need to utilize this to my advantage.’\nHiding in the dust, Mikhail wasted no time to attack again.\n\"Cindralis.\"\nHe made the sign, igniting the spell diagram once more.\n\"Fumivex.\"\nThe second node.\n\"Morphis.\"\nAnd the third.\n\"Cindralic Morphis.\"\nShooting through the dust, Mikhail came right face to face with the Silent Pact group.\nAs expected, the members wasted no time sensing his presence, despite the stealth spell.\n\"It’s the intruder!\"\nHe heard someone yell, alerting everyone as well.\n’Not yet, I need to get closer.’\n\"Aqualis Boltium!\"\nTwisting on his center of gravity, Mikhail easily dodged the two hydro-bullets.\nBut it wasn’t the end of their attacks just yet.\n\"Borealic Bladis.\"\nA series of azure blades split through the wind, aimed toward him.\nSWOOSH!\nHowever, Mikhail still didn’t hold his charge. Planting his feet onto the ground, he jumped hard into the air.\n\"Aqualis Bormis.\"\nA stream of water shot out from his hands, keeping him in the air.\nSWISH! SWOOSH!\nWith experienced movements, Mikhail effortlessly maneuvered mid-air, dodging the blades with his water streams.\n’Close.’\nMikhail’s attempt to get close wasn’t just to deal more damage to them in close combat.\nIt was to keep them stressed and occupied so they wouldn’t notice the gates shrinking.\n\"Keep your distance, don’t let him get close!\" Mikhail heard the one farthest yell.\n’No, you don’t.’\nMikhail blasted his water beams at the ground, raising a cloud of dust.\nCanceling the spell, he shot to the ground with his Norvalis spell still active.\nWasting no time, he shot towards the nearest member to him in the dust, remembering the positions from above.\nAs his figure split through the cloud, he saw the member’s eyes widen.\n’From his reaction, it seems they still don’t know about my Norvalis Essentia.’\nThe figure quickly raised his hands, sending another Borealic Bladis toward him.\nBut Mikhail’s instincts were faster.\nTwisting his heel, he bent his back, dodging the blade while continuing his charge.\nThe pain that came with the sudden movement was nothing new to him.\nThe member’s body stiffened as Mikhail finally reached him.\nRaising his gun, Mikhail pointed it straight at his head.\n\"Cindralic Morphis.\"\nBOOM—\n’What?’\nTING! SWOOSH!\nHis flaming bullet bounced right off the cape as if the clothing was a piece of metal.\n’This didn’t happen before.’\nMikhail could feel the member underneath the hood smile wickedly at his surprise.\nAnd the latter wasted no time utilizing the opportunity as well.\n\"Aqualis Boltium!\"\nThe bullet pierced Mikhail right in the shoulder, springing forth a splash of blood.\nPain shot through Mikhail’s body, but the black-haired soldier showed no sign of it on his face.\nIt didn’t even halt his movement, as if it was normal.\n\"It’s going to take you more than this,\" Mikhail said.\nGrabbing the man’s arm, he spun him in the air, slamming him on the ground while ducking to dodge a bullet at the same time.\nA cry of pain erupted from the man’s mouth, which was visible to Mikhail now.\nPointing his gun to his forehead, he pulled the trigger.\nBOOM!\nA single loud shot echoed in the surroundings, easily ending the man’s life.\nMikhail didn’t even use magic for this kill.\nOne simple bullet was enough.\nClick. Cluck.\nTilting his head to dodge another bullet, Mikhail shot forward again.\n\"Next.\"\nBut the moment he did, the ground shook once more, this time with a worse intensity than before.\nIt ended up throwing him off balance along with everyone.\nRUMBLE! RUMBLE! RUMBLE!\nMikhail’s eyes shot toward the source like each member, the worst possibility already running in his head.\nJust like he thought, it turned out to be true.\nThe shaking wasn’t caused by the monsters this time.\nIt was done by the wormholes, the air rippling under their shrinking pressure\nUnfortunately for him, though, everyone knew about it now.\n___________________",
      "scraped_at": "2025-11-21T13:54:17.965494",
      "content_scraped_at": "2025-11-21T13:54:18.546408",
      "error": null
    },
    {
      "id": "17",
      "number": "17",
      "title": "Chapter 17: Final Spell",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/17/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 17: Final Spell\nIt was a disaster.\nMikhail’s eyes snapped towards the group, horrified expressions etched on their faces now.\n\"You bastards! Maintain the disturbance frequencies!\" One of the members at the forefront shouted.\n\"Beast tamers! Maintain control over the beasts, you will kill everyone here!\"\n’He’s the leader.’\nMikhail was quite sure of it now.\nFocusing on him, even the energy and power oozing off of him was unlike any other.\n’Herald rank?’\nIf so, it would prove to be quite a problem for him.\nBut there was another bigger issue now.\n\"Cindralic Bladis.\"\n\"Borealic Boltium.\"\n\"Aqualis Morphis.\"\n’Shoot.’\nA barrage of spells were launched his way, both in an attempt to nullify him and raise the disturbance frequencies.\nTaking advantage of the remaining dust, Mikhail hid his hand behind his back.\nHe performed the hand sign for Aqualis.\nFirst node.\nThen for Fumivex.\nSecond node.\nAnd then for Morphis.\nThird node.\n\"Aqualis Morphis.\"\nBOOM!\nBut the signs didn’t just stop there.\nHe synced them to another spell stream, now performing the hand signs of another spell.\nIn a matter of two seconds, he performed three spells.\n\"Cindralic Morphis.\"\nBOOOM!\n\"Cindralic Hurrialis.\"\nSWOOSH!\nA scorching hurricane of crimson launched forth through the dust, Mikhail’s bullets arching through it.\nThe incoming barrage of spells was completely demolished in front of the vortex, not even lasting a second.\nThat was the difference in strength between a spell and pre-spell.\nThe group was thrown into chaos as they quickly tried to split and dodge the incoming hurl of fire.\nBut in that quickness, they failed to see the two bullets that shot forth, striking two of the members in their leg.\nSurprisingly, unlike last time, the robe that they wore provided no protection.\nThe edges of Mikhail’s lips almost curled up with satisfaction.\n’As I thought, the ones with protection are artifacts, with shining gold embroidery.’\n\"Argh!\" He heard the two members scream in pain, their charge halting.\nNow was his chance.\nBut the moment he raised his gun to shoot, a piercing pain shot through his spine.\nHis face scrunched up in irritation as his body froze, already knowing the reason behind it.\nOf course, the quick succession of spells came with a price.\nUsually, after you cast a spell, the caster had a cooldown period for casting another spell.\nThe period varied according to the strength and qualities of the spell.\nRegardless, even the basic of spells had a cooldown period of a few seconds.\nPushing yourself to cast another spell in that period would just put more and more toll on your body.\nIn certain cases, it could lead to permanent physical damage of mana veins or cause conditions like blindness, even crippling a person sometimes.\nFor a person of Mikhail’s rank, their spell topology would just break when they would try to cast another spell.\nBut with his Dragma, Mikhail was able to cheat this limitation.\nUnfortunately, not the limitations on his body though.\nCurrently, his mana veins inside the body were facing the aftereffects of casting three spells at once.\n’Move, you weak body!’\nMikhail tried to move, but it was unfortunately to no avail.\nAnd in that time, it was enough for the opposing force to attack back.\nCRUNCH!\nA crunching kick was delivered right to Mikhail’s face from the side, sending his body crashing down the trees.\nCRASH!\n\"Argh!\"\nHe tasted iron as the sudden impact sent blood gurgling out of his mouth.\nMikhail’s vision spun, the blood from the wound on his now dripping down on his eyes.\n’Why is this body so weak?’\nHis bones ached and cracked from the impact, making him think he broke one or two.\nAhead in the distance, he saw the members of the group cautiously advancing towards him.\nThere was a wide smirk on the leader’s face underneath the hood was he walked on the front.\nMikhail saw his right leg completely covered in a thick block of ice.\n’So it was him....no wonder.’\n’I’m definitely not going back in one piece.’\nHe checked his mana.\n—————————\nMana: 1800/6400 [Dragma]\n—————————\n\"Argh!\"\nHe puked up more blood, struggling to move himself.\nThe sudden increase in the disturbance frequencies had also raised the mana consumption of his attacks.\n’At most, I can use Morphis 25 to 30 times now or Hurialis 5 to 6 times.’\nIt was most definitely not enough to eradicate the whole group.\nBut...\nMikhail gazed ahead into the distance, where he could see the gates.\nThey had shrunk again to a size much smaller than the original.\nAt most, he needed to keep it going for 2 minutes now.\nFortunately, they hadn’t run an eye on it again after raising the frequencies.\n’I can’t have them noticing it again.’\nIf they did, then he was definitely done for.\nBut Mikhail could see the signs of tiredness in the member’s bodies.\nHe couldn’t see their faces but he could definitely see it from their movements.\n’Their control is wavering. Even over the monsters.’\nHe could see the erratic movements in the monsters in the distance, showing that they were regaining some semblance of control.\n’They can’t hold it for long-’\n\"Argh!\"\nAnother wave of pain shot through his body as Mikhail threw up more blood.\nHis lush black hair and face was drenched in blood from his wound now, his piercing blue eyes locked onto the members.\n’I can feel my consciousness fading...’\nThe blood loss was hitting him.\nThe group was almost near him now.\n’I can’t run fast enough in this state to escape them.’\nHe realized.\nMikhail needed a distraction to get up again.\nJust one shot.\nOne single shot.\nHis calm blue eyes ran over the members in a split second, as if trying to find something.\nFortunately for him, that moment was right there.\n’There it is.’\nStep.\nThey were only a few steps away from him now.\nMikhail needed to act fast.\nBearing the pain, he hid his hand underneath his thigh.\nBending two fingers, he made the hand-sign for another spell.\n’Cindralis.’\nBefore the spell diagram could appear, Mikhail quickly made the signs of the second and third node.\n’Fumivex.’\n’Morphis.’\nMikhail heard the leader speaking something to him, but it all came to him as muffled sounds.\n\"You tried your best kid....unfortunately...\"\nIt didn’t matter to him right now, his focus was on something else.\nWasting no moment, he raised his gun and pulled the trigger.\n\"Cindralic Morphis.\"\nIt didn’t even take a moment for the blazing bullet to go tearing through the air, giving the group no time to react.\nBOOM!\nIt connected right with the target’s shoulder but unfortunately, despite the strength it carried, it was reflected straight forward.\nGiving no harm to the target.\nMikhail saw an expression of rage and surprise in the leader’s eyes as he realized what happened.\nHe saw certain shouts erupt out of his mouth but at this point, he could hear nothing.\nHe walked up to Mikhail with an evil smirk on his face now, the group laughing hysterically behind him.\n\"I don’t know how you pulled off that last ditch effort kid, but at least you should have used some brains.\"\nMikhail heard it perfectly now that he spoke in a low voice from up close.\n’Just there.’\nHe saw him raise his large ice-clad foot high in the air, positioning it in front of his face.\nMikhail heard him laugh once more, a creepy evil laugh.\n\"I’ll at least give you the honor to choose your last words. Go ahead.\" He grinned.\nMikhail almost felt the corners of his mouth pulling up as his calm blue eyes stared into him.\nRather than saying a word, he simply raised his hand in the air.\nOr rather, two fingers to be exact.\nStep. Step. Step.\nPointing the two fingers to his eyes, Mikhail saw the leader tilt his head in confusion.\nStep. Step. Step.\nBut then, he turned his two fingers sharply to his left, as if gesturing him to look to the left.\nUnderstanding what he was trying to say, the leader burst out laughing.\nStep. Step. Step.\n\"You really thought I would fall for-\"\nSLASH!\n\"You fucked up.\" Mikhail moved.\n__________________",
      "scraped_at": "2025-11-21T13:54:19.563095",
      "content_scraped_at": "2025-11-21T13:54:20.161009",
      "error": null
    },
    {
      "id": "18",
      "number": "18",
      "title": "Chapter 18: End Of The Battle",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/18/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 18: End Of The Battle\n\"Cindralic Morphis\"\nBOOM!\nThe flaming bullet tore through the leader’s neck, spilling forth a fountain of blood.\n’Oh? He’s not Herald ranked.’\nIf he was, the bullet wouldn’t have inflicted so much damage.\nWhich meant he was the same rank as Mikhail.\nUnfortunately, he still wasn’t dead despite the critical shot.\nBut first, he needed to get done with the beasts and the other mages.\n’Let me disable him.’\nClick. Cluck.\nBOOM! BOOM!\nA bloody scream escaped the leader’s mouth as Mikhail shot him two times in the feet.\nHis dying body crashed on the ground but Mikhail had already moved ahead.\n\"Control it! What’s happening!?\" Mikhail heard the members shouting.\nIt was all chaos now as hordes of smaller monsters came rushing after them.\nWhat Mikhail had done back there was simple.\nWith the holes shrinking, the size of the monsters able to shift through the gates had grown smaller as well.\nThe previous mammoth sized monsters weren’t able to cross into the real world anymore.\nWith the focus of the whole group on him, Mikhail assured them that they were unable to realize this fact.\nThey were just controlling the monsters that came out with instinct.\nThis was confirmed to Mikhail when he ran an eye over the group.\nHe saw three of the members just moving their hands in a pattern within the robe, their focus on him.\nWhen he shot at one of the members, it was never his point to injure them.\nNo.\nHe already knew that the controllers and disrupters had the artifact robes.\nThe bullet he shot there served two purposes.\nOne was to momentarily break the control of the tamers over the incoming monsters with the impact.\nWhich he was able to when it striked their robes, disrupting their control.\nAnd the second purpose was to divert the uncontrolled monsters toward him.\nWhich he did when that reflected bullet went striking back among the monsters.\nHis aim made it sure that it would hit the new monsters coming from the gate.\nThat hit not only enraged the monsters to come running towards him, mistaking the group as the attackers.\nBut also if the controllers were to notice them, it would be impossible to take them under control.\nThe more enraged the monster, the harder it was to control it. It was a simple rule that everyone knew.\nFortunately for Mikhail though, the stealthy nature of the beasts didn’t allow the group to sense them.\nMikhail knew the beasts.\nMilton Raptors.\nTheir body was almost a mix of raptors and leopards, combining both speed and stealth.\nTheir prideful and hot temper made it so that whenever they would see a foe, they would attack the strongest of the group.\nWhich in Mikhail’s case, was the leader of the group at that time.\nThe robe didn’t protect the person from physical damage, Mikhail had already confirmed that.\n’I need to keep using spells or the gates will start opening again.’\nFortunately, now the leader was out of the fray.\nSo there was complete disarray in the group.\n\"Norvalis Morphis\"\nSilencing his footsteps, Mikhail blended in with the now ensuing chaos of monsters.\n’The raptors won’t attack me for now. I’m too weak for them to consider me as their prey.’\nHis previous life knowledge from the battlefield was coming to work now.\n\"Aqualis Boltium.\"\n’No you don’t.’\n\"Cindralic Morphis.\"\nBOOM! BOOM! BOOM!\nMikhail countered their spells with his own, protecting the monsters.\nRight now, his safest bet to survive this was with their help.\nWithout them, he was still too weak to handle them all, even with their leader gone.\nReaching a member near him, Mikhail raised his gun to his head.\n\"Aqualis Morphis.\"\nBOOM! SPLASH!\nA fountain of blood sprung forth, splashing on him.\nIgnoring, Mikhail spun on his heel to move to the next member when a crunching pain hit his back.\nGritting his teeth to bear through the teeth, he moved on his torso.\nBOOM! BOOM!\nPutting two shots straight to the head of the raptor, he fell to the ground, panting heavily.\n\"Huff....Huff....\" He saw his vision blur, almost falling unconscious but the urgency of the situation kept him going.\n’I can’t hold on for long.’\nRunning a hazy eye over the battlefield, he saw the controllers nowhere to be found.\nThey were controlling some of the beasts from somewhere.\n’Shit, I can’t make sense of who’s controlled or not.’\nIt would be a problem if he attacked the uncontrolled ones, bringing even more fight to himself.\nHe quickly checked his mana, only to find it down to 900.\nThere was no point in choosing his enemies now.\nHis mana was only left to close the gates. It didn’t matter whom he shot, he just needed to close the remaining gates.\nBiting his lip to keep himself conscious, Mikhail tried to rise to his feet.\nCrunch. Drip.\nHis body condition was a total mess right now. Broken bones, ribs and blood loss.\nAnd now he was about to go on a spell overload.\n’Whatever, not the first time this will happen.’\nClick. Cluck. Click. Cluck.\nRaising his guns, he took aim straight at a member in the distance, who was already occupied with 3 raptors.\n\"Norvalis Morphis\"\nTing.\nThe sound was completely suppressed to a ting as the bullet split through the member’s head.\nAs his lifeless body fell down, Mikhail saw the raptors pounce upon him.\n\"..!\"\nHis instincts screamed for him to dive to the right.\nAnd he did, ignoring the gut-wrenching pain that came with it in the process.\nHis eyes moved to the back where he saw 3 raptors slash through the air where he stood before.\nHe took aim with his guns once more.\n\"Cindralic Hurialis.\"\n\"Cindralic Morphis.\"\nBOOM! BOOM! BOOM! BOOM! BOOM!\nMikhail’s shots split through the brains of every raptor caught in the crimson vortex\n\"Argh!!\"\nHe crashed on the ground as he tried to stand up again, blood dripping on the floor from his wounds and mouth.\nHe smashed his fist on the ground, anger coming over him for the first time.\n’Fuck this body. Stand up!’\n\"..!\"\nRolling over the ground, he quickly pointed his guns to the back.\n\"Norvalis Boltium.\"\nA barrage of smoke bullets cut through their bodies, sending them crashing on the ground.\n\"Huff...Huff...\"\nThe side-effects of mana overload were hitting him now.\nWith one eye open only now, Mikhail gazed over at the gates.\nIt was no larger than a small hole now.\nNo monster was able to come out from a hole of that size.\nBut the work still wasn’t done, he needed to close them completely or those disruptors would open them again.\n’I can’t be bothered to find those controllers right now.’\nForcing himself up on his knees, he ran a quick look over the battlefield, his eye searching for any shine of gold.\nAnd there it was.\nIn the distance, he found it. Right behind the trees.\n’I’ll finish this in one last attack.’\nThat was all he could muster now.\nScraping his knees on the ground, Mikhail pushed his feet against the dirt, propelling himself forward for one last charge.\nSkrrt! Swoosh!\nAs he ran through the area, he loaded his guns for one last shot.\nOne last barrage of spells.\nUnfortunately, the controllers were quick to realize his direction.\nGROWL!\nMikhail heard 3 monstrous cries from right behind him.\n’Fuck!’\nBending his ankle, he quickly changed his direction mid-charge.\nCrack!\nThe sudden twist sent a streak of pain through his ankle, breaking it.\nBut it was too late to stop for another second now.\nRaising his bloody hand for one last time in the air, he performed the symbols.\n’Cindralis.’\nFirst node.\n’Fumivex.’\nSecond node.\n’Spinora.’\nThird node.\nAnd complete.\n\"Cindralic Hurialis.\"\nWith the highest amount of mana he could put, Mikhail pushed the spell forward.\nSWOOOSH!\nAnd it worked as a gigantic hurricane of fire sprung forth, devouring everything within it.\nMikhail saw the disruptors quickly try to escape its grasp but unfortunately, it was too late.\nThey were thrown right in with the pack of raptors.\nCrashing on the ground with his world spinning now, Mikhail forced his single eye up to the hurricane.\nThere was one single reason why he had used Hurrialis despite its high mana consumption.\nIt was to throw their hoods off, providing a clean look on who they were.\nAnd to provide a clean target for him to aim at.\nSWOOSH!\nJust like he expected, the scorching winds sent their hoods whipping back, revealing their faces.\nMikhail’s eye widened with realization.\n’Ah...’\n’I should have suspected it from the start.’\nRight before him, in the hurricane were the same new guards he saw at the gate on his first day.\n’No wonder the academy security system didn’t pick them up.’\nRegardless...\nIt didn’t change his motive.\nClick....Clunk.\nMikhail loaded his gun with the last bullet he had.\n’Fuck, I’m losing conciousness....’\nHis vision spun, making his aim harder.\nBut...\n’That would be the last thing stopping me from putting a bullet in their head.’\nThese guns were an extension of his body. Shooting was as natural to him as breathing.\nRaising his gun as he laid on the ground, Mikhail took aim once more.\nNot at their heads but at a certain point in the hurricane.\nStep. Step. Step.\nHe could hear footsteps coming from behind.\nBut his form or focus didn’t waver.\nAnd after a few seconds, as soon as their heads aligned with his predicted aim, the spell canceled automatically.\n\"Cindralic Morphis.\"\nIt was the last spell he could use.\nBOOM! BOOM!\n__________________________",
      "scraped_at": "2025-11-21T13:54:21.164941",
      "content_scraped_at": "2025-11-21T13:54:21.796444",
      "error": null
    },
    {
      "id": "19",
      "number": "19",
      "title": "Chapter 19: Trip Down The Memory Lane",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/19/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 19: Trip Down The Memory Lane\nBOOM! BOOM!\nThe gunshots cleanly pierced through the guard’s head, their lifeless bodies falling to the ground.\nFeeling his consciousness fading, Mikhail saw the 7 wormholes closing for once and all.\nBut as he succumbed to the darkness, he saw the two last remaining controllers of the group advancing towards him.\n’Fuck.’\nUnfortunately, he had no energy left in him to do anything now.\nIn the final second, he saw them nearing toward him with furious expressions on their faces.\n’Such an early end-’\nSLASH!\nBefore he could understand what happened, dark overtook him.\nThe headless bodies of the two advancing controllers was the last thing he saw.\n***\nIn the remains of a destructive and fierce battle, a figure could be seen descending from the sky.\nTheir silent but fierce presence made it seem as if the world was put on hold.\nThe strewn bodies of soldiers and monsters on the crimson-blanketed ground didn’t matter.\nTheir eyes were locked to a single man who lay unconscious on the battlefield.\nAnd the only one still alive.\nHis condition was fatal, to say the least.\nThe torn clothes were drenched in blood, the majority of it being his own.\nDeep gashes and wounds covered his whole body, making his face almost unrecognizable at a glance.\nThe leaking blood pooled around his body as the black-haired man drifted to death with every passing second.\nBut unlike one would expect, his expression seemed to betray his condition.\nIt was one of peace and calm, as if what just happened to him didn’t matter.\nAs if he was at peace with what just happened.\nThe wind whipped and pooled around the ground as the figure softly stepped on the ground, cushioning the step.\nTheir emerald eyes were still fixated on the man’s body.\nDespite the man’s condition though, there was no sign of empathy or worry in the figure’s eyes.\nRather, it was one of curiosity and intrigue.\nIn the midst of the battlefield, it was her soft voice to break the stretching silence.\n\"Interesting.\"\n***\n’Hmm?’\nMikhail’s eyes opened to a small wooden house.\nWarm unfiltered sunlight entered through the open window, illuminating the simple interior of the house.\n’Why are the walls so big-’\nMikhail was unable to complete his thoughts as he felt his body move automatically.\n’What?’\nHe couldn’t control the person’s body which he was currently in, only seeing the world through their eyes.\n’Why is the world so bi-’\nRealization finally hit him.\nHe was in the body of a child.\n’No wonder.’\nDespite his large view, the house wasn’t that large from a general view.\nIt could barely even be called a house if he had to be honest, as it was no larger than a normal room.\nIt was definitely larger than their individual camp tents though.\nBut...\n’Why does this seem so-’\nBefore he could complete his thought, the boy suddenly moved from his bed.\n\"Ungh.\"\nWith his small body, he carefully got down the wooden bed, running to the door.\nNot being able to reach the handle, he hurriedly ran towards a nearby corner.\nFrom there, he carefully inserted his small hand inside of a small gap within the wooden planks.\nTaking out a small crowbar, he inserted it under the gap of the door.\n\"Hngh!\" He pulled with all the little strength he had.\nCreak...\nWith a creaking noise, the door was let out of the handle, opening up the entrance for him.\nMikhail felt joy well up within him, or rather the boy at his success.\nRunning back to the gap, he put the crowbar inside, hiding it carefully.\nFollowing that, he ran to a nearby table, not caring about losing his breath.\nIt seemed as if he was in a hurry.\n’Why does this-’\nHis eyes widened when he saw the boy pick up a book from the table.\nThe cover wasn’t all that shiny or well-kept, even torn from the edges a little.\nBut it was the title that left him surprised.\n’21 Stories Of Freedom And Love’\nBefore he could think anything about it again, he was taken by surprise when the boy happily rushed out of the house.\nThere was a rising sense of happiness and enjoyment within him.\nAlmost as if it was the best moment of the day in the boy’s daily life.\nBut the ongoing question still plagued Mikhail.\nWhy was he enjoying this? And why did it feel so familiar?\nThe boy couldn’t be him.\nThere was no memory in his early life where he ever did this.\nThe difference was of heaven and earth.\nBut then, why?\n’I need more information.’\nFor now, all he could do was just see what happened later on with the boy.\nComing out of the house, he saw the bright sunlight hit him straight in the eyes.\nAs he adjusted to the brightness, the view before him became clear to his eyes.\n’It looks like a village.’\nThere were wooden black houses all around, placed at even distance on the sides of the ground he was standing on.\nBut there was something strange...\nThe streets. Or rather, the whole village..\nWas completely empty.\nNot a single person could be seen in the area.\n’What is this place?’\nHe was certainly sure that he never knew any place like this or even similar to this.\nIt made no sense.\nThe boy moved once more.\nBut unlike what Mikhail was expecting, he didn’t run through the streets of the village.\nRather, he snuck around to the back of the house, as if hiding from something.\nSneaking around in the long grass and behind the trees, the boy hid in the shadows.\nMikhail saw him keep moving like this until he reached an exact same house as before at the end of the street.\nFrom there, he saw the boy look around at the backside of the house, as if trying to find something.\nIt was then that a voice entered the boy’s ears.\n\"Here.\" It was a soft whisper of a girl.\nA warm feeling of joy rose in the boy’s chest as he quickly ran to the voice.\nThere, in the corner of the house and hidden in the long grass, he saw a little girl.\nBut...\n’What the hell?’\nThe girl’s face..\nHe couldn’t see it.",
      "scraped_at": "2025-11-21T13:54:22.813597",
      "content_scraped_at": "2025-11-21T13:54:23.397973",
      "error": null
    },
    {
      "id": "20",
      "number": "20",
      "title": "Chapter 20: Back To Reality",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/20/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 20: Back To Reality\nIt all appeared as a glitching blur to him, with only her smile available for him to see.\nJust like the boy, she had a warm and teasing smile on her face.\nShe quickly put a finger to her lips before the boy could say something.\n\"Shhhh, hold your excitement.\" She whispered.\nThe boy finally realized where he was and nodded, scratching his head in embarrassment.\nThe girl chuckled, standing up as the boy gave her his hand.\nIt was only then that Mikhail realized that she seemed to be older than the boy, standing taller than him.\nOf course, he could be wrong as he was only judging from the height.\n\"Let’s go.\" She whispered, not leaving his hand.\nThe boy nodded happily, the two quickly running away from the houses in the long grass.\nMikhail saw the two head down the long grass and trees for a few minutes before finally stopping.\nThere, before him, stretched a large lake, the clean water shining under the sunlight.\n\"There.\" The girl whispered, gesturing to a spot under the shade of a tree right by the lake.\nEven though they were quite a distance away from the village, the girl was still whispering.\n’They are hiding from something.’\nThat much was confirmed.\nAs the two sat down under the shade hand-in-hand, Mikhail felt a rising warmth in him.\n’This boy...’\nFrom what he could tell from just his emotions, it looked like the girl meant the world to him.\nThe current moment was his happiest time of the day.\nBut why...\n’Why do I feel so attached to her as well?’\nWhy did it still feel so familiar?\nNothing. He could remember not a single moment from this dream that had happened in his past.\n’It must be since I’m in the boy’s body.’\nHe was seeing what he was seeing. He was feeling what he was feeling.\nThat was the only reasonable explanation.\nUnder the shade of the tree, Mikhail saw the two happily enjoy the breeze of the wind, looking out over the lake.\nIt was then that he saw the boy take out the story book from his back.\nThe instant that he did, he saw a blush come up on the girl’s lips.\n\"You brought it?\" She asked, almost saying it out loud from her excitement and happiness.\n\"Un.\" The boy nodded cheerfully.\nMikhail saw the girl’s smile turn wider as she pulled the boy into a hug.\nCalming the girl down, the boy opened the book, turning to a specific page number.\n’This doesn’t seem to be the first time he’s doing this.’\nThe two happily poked their heads in the book, with the boy tracing his small finger over the words so the girl wouldn’t lose track.\nThey read silently and blissfully, enjoying each other’s company.\nTime stretched for a long time before Mikhail saw the boy take a loud yawn.\n\"Are you sleepy?\" The girl whispered, chuckling.\nThe boy nodded after a moment from embarrassment, trying to hide his face.\n\"You didn’t sleep last night?\" she asked.\nThe boy stopped, frozen at her question.\nBut after a moment, he nodded slowly again, trying to hide the blush that was creeping on his face.\nMikhail saw the girl laugh, the cheerful smile on her face spreading wider.\n\"It’s okay,\" she said, adjusting her position before putting his head in her lap.\n\"You can rest for a while here before we leave.\" She chuckled, ruffling his hair.\nMikhail saw the boy freeze at the sudden movement, embarrassment welling up in him.\nBut more than embarrassment was happiness and enjoyment.\nIt was clear that he was loving it.\n\"Come on now, don’t waste your time and close your eyes.\" She pouted.\nThe boy hurriedly nodded, not wanting to make her sad.\n\"Un.\" He closed his eyes, not able to see the smile that returned on her face.\n\"Good boy.\" She ran a hand through his hair.\nDarkness overtook Mikhail as well when the boy closed his eyes, now only being able to hear the girl’s voice.\n\"Rest and sleep well.\"\nHer soothing voice hit like a comfortable pillow to the boy’s ears, tiredness overtaking him.\nUnfortunately, Mikhail knew that this dream wouldn’t just be a happy one.\nThere was definitely something up.\nAnd he was right when he heard a sharp cry of pain from the girl in the distance, his eyes opening with a snap.\nMikhail, or rather, the boy woke up to being dragged by a group of people, fully covered in black.\nIn the distance, he could also see the girl being dealt the same treatment by another group.\nThe boy’s shocked eyes met the girl, who had tears streaming down her face now.\nA sense of struggle and desperation overtook the boy as he tried to force himself to break free.\nUnfortunately, he was too weak.\nHis hand stretched out in a hopeless attempt to grab the girl despite the distance.\nAnd the girl did the same.\nMikhail could feel the pain and hopelessness in the boy as he saw the girl being dragged away from him.\nIt was as if his world was breaking down into pieces.\nNot just the boy...\nBut Mikhail as well.\nHe didn’t know the girl.\nHe didn’t know the boy either.\nHe didn’t know anything that was going on.\nBut then...\n’\nWhy does it feel so damn familiar!?’\nHe cried out, his thoughts unable to get out.\nWhy did the boy’s pain and desperation feel as if it were his own!?\nWhy did he want to fight those captors for the girl?\nAs Mikhail saw the girl being taken away from his vision, he cried out loud, despite knowing his voice couldn’t be heard.\nJust like the boy.\n\"NOOOOO!\"\nAt that moment, the world around him disappeared with a snap, his body shooting up from his bed.\nThe scene around him changed to the infirmary where he saw his squadron around him, worried looks in their eyes.\nHis clothes were drenched in sweat, with his breath coming out in hurried gasps.\nMikhail was back.\nBack to the real world.\nAnd a notification appeared before him.\n—————〔Chronicle I〕—————\n• Condition: Uncover the assassination and save your academy from getting destroyed.\n[Rewards:]\n• Character Progression: +15% [Granted]\n• Mana Increase: +300 [Granted]\n[Status: Completed]\n———————————————",
      "scraped_at": "2025-11-21T13:54:24.401455",
      "content_scraped_at": "2025-11-21T13:54:24.981642",
      "error": null
    },
    {
      "id": "21",
      "number": "21",
      "title": "Chapter 21: Reports (Interlude)",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/21/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 21: Reports (Interlude)\n\"What happened!?\" The infirmary doctor rushed in.\nMikhail’s panicked eyes saw everyone staring at him worriedly, realizing now that he was back to reality.\n’What the hell was that dream?’\nCalmness returned to Mikhail as his breathing settled down.\n\"Are you feeling alright?\" The doctor asked, trying to examine Mikhail physically.\n\"I’m fine. Can you leave us alone for a while?\"\nThe doctor looked at Mikhail strangely, almost about to refuse when Modric stood up.\n\"He’s our Squadron Commander. I’m sure he knows of himself so please allow him some space to settle down.\"\nThe doctor gulped, hesitating before speaking up.\n\"If so, then I’ll need to ask you people to leave as well. It’s the only way I can leave the patient alone.\"\nModric was about to interject before Mikhail stepped in.\n\"That’s fine. Though, I’ll ask you to leave Modric with me as my Vice-Commander.\"\nModric’s eyes met Mikhail’s, both of them communicating with their thoughts.\n’It’s fine, I can convince him to let the whole squadron stay.’\n’Don’t. It would just cause more problems. Just you are fine.’\n’If you say so.’\nThe two looked at the doctor who hesitatingly nodded.\n\"Alright. But do know if something happens to the patient, that will be on you, yourself.\"\n\"We understand.\"\nThe doctor gave them a gruff nod before leaving out the door.\nIt was his way of saying\n’I don’t really care about you but I have to since it’s my duty. If you die, that’s on you.’\nMikhail gave a single glance to the rest of the group and they nodded, standing up.\n\"I appreciate it.\" He gave them a grateful smile.\n\"Don’t worry about it. Rest well.\" He tapped his shoulder.\n\"You’ll have to tell me what you did back there when you come back though.\" Icarus pouted.\nMikhail laughed lightly.\n\"Sure.\"\n\"I’m glad you are fine.\" Yvan gave him a relieved smile, tapping his shoulder before joining the group.\nBut before they could leave, Mikhail called them all out.\n\"You all.\"\nThey turned, confused.\n\"I’m glad you all are fine and I’m proud of how you handled that situation.\"\nSurprise instantly came on their faces, even the usually calm Modric.\n\"Man, you are going to make me cry.\" Icarus wiped his eyes to clear his fake tears.\n\"Since when was Mika so kind?\" Oscar looked around with shock.\nThe only ones who just seemed to look at him with shock were Modric and Yvan.\nThe reason for their reactions was his compliment.\nAll of them knew Mikhail to be a man of few words. They could not remember the last time he had complimented them.\nBut when he did, despite it being a simple few words, it brought them a whole nother level of satisfaction and happiness.\nMikhail gave them one of his rare appreciative smiles.\nTheir expressions turned from shock to cheerfulness now, as all of them hit a salute.\n\"You can count on us.\"\nMikhail nodded and all of them turned to leave.\nAs the door closed, the former turned to look at Modric now, his smile disappearing to an expression of dead seriousness.\nModric nodded, already understanding what he wanted to ask.\nHe knew that Mikhail hadn’t stopped him to discuss what happened to him or his health.\n\"48 men died. 2 Wardens and 46 Magus.\"\nHe got straight to the point.\nSilence settled in the room as both of them paid their mutual respects.\nDespite not caring about them or even knowing them, Mikhail at least knew to respect the dead.\nEspecially the ones who died fighting.\nTurning to his thoughts, however, Mikhail was satisfied.\n74 wasn’t a small number. Rather it was a grave loss.\nBut it turned out to be much better than his previous life where at least 84 ended up dying.\n’My involvement definitely helped.’\nAs the silence ended, Modric continued automatically.\n\"93 people were injured. 68 of them, light injuries. 9 or 10, heavy injuries. 5 to 6 with fatal injuries or loss of an organ.\"\nMikhail nodded.\n’Better than last time as well.’\nIt was well-worth all the pain he had to go through.\n\"The infrastructure damages are still being calculated so we are unsure about that.\"\n’Hmm..’\nHe turned to Modric.\n\"How long was I out for?\"\n\"A day.\"\nSurprise came over Mikhail at how early he had woken up.\n’I thought it would take more considering my injur-’\nHe was interrupted by Modric’s words.\n\"You were only diagnosed with mana overload and tiredness so it didn’t take long to fix you up.\"\nMikhail’s eyes widened with shock.\n’Huh? What?’\nImpossible.\nMana overload was the least of what he had gone through in that battle.\nHe had broken bones, mana exhaustion, concussions and so much.\n’How the hell?’\n\"Is something wrong?\" Modric asked at Mikhail’s expression.\n\"Nothing. I was just surprised at how early I woke up.\" The latter shook his head.\nModric’s golden eyes bore into him but he didn’t pry further.\n\"I see.\"\nIt was then that Mikhail realized something.\n’Wait..’\n\"Who brought me here?\"\nSomething didn’t add up.\nThe person who found him at the battlefield must have seen his injurie-\n\"From what they told us, you were found at the gate by the academy reinforcements. Unconscious, they brought you here and informed us.\"\n’What?’\nMikhail hid the surprise and confusion inside him.\n\"I see, alright.\"\nWho found him from there and brought him here?\nIt was then that he remembered a memory before passing out.\nSLASH! SLASH!\nThe two controllers that were running towards him were killed in a single second.\nEven their artifacts couldn’t hold up.\n’Was that reinforcement squad?’\nMikhail wasn’t sure.\nBut he needed to find out who it was that rescued him.\n’They were certainly strong.’\nHe would just look into it later when he would get discharged.\nMikhail turned back to Modric, who still stood attentively for any questions.\n\"Anything else worth mentioning?\"\n\"Well...\" Modric trailed off for the first time, confusing Mikhail.\nHe had even reported the deaths without any remorse.\nSo why was he hesitating now?\n\"Hmm? What happened?\"\n\"Well, about the Dominique.\"\nIt was only then did Mikhail remember about her visit.\n’Did something happen to her?’\nIt was unlikely considering how strong she was. She could have single-handedly closed all the 7 gates if she wanted.\nThen what else?\n\"What about her?\"\n\"In the middle of the attack, she decided something.\"\n\"What was it?\"\nModric sighed, stopped for a second, before speaking again.\n\"She decided to shut down this camp because of the lack of security and checkups.\"\n________________",
      "scraped_at": "2025-11-21T13:54:25.992000",
      "content_scraped_at": "2025-11-21T13:54:26.574327",
      "error": null
    },
    {
      "id": "22",
      "number": "22",
      "title": "Chapter 22: Tree Of Yggdrasil",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/22/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 22: Tree Of Yggdrasil\n\"What?\" Mikhail blurted out, unable to control his surprise.\nThis hadn’t happened in his previous life even with all those deaths.\nThen why now?\nBut before Mikhail could ask again, Modric already relieved his worries.\n\"Well, that was what she said first. After the battle, she changed her decision for some reason.\"\n’Huh?’\nSeeing Mikhail’s expression, Modric continued.\n\"Yes, that’s what she said, refusing to elaborate further. Although she refused to report this incident to the Empire, she stated that from now on, the camp will be subjected to multiple visits in a year.\"\n’This is different.’\nNone of this had happened in his previous life when she just left, despite the number of the deaths.\nThen why?\nWhat happened during the middle of the battle to make her change her mind?\nHe needed to find out.\nBefore he could conclude the conversation, Modric added more.\n\"Not only that, but she stated that all of the visits would be done by her. And any more breaches would make her permanently shut down the academy.\"\n\"Hmmm..\" A thoughtful expression appeared on Mikhail’s face.\nThis was intriguing.\nHe needed time to think about this new information. Time to process it himself alone.\n\"Alright, you can leave now.\"\nNodding, Modric did a customary salute before turning to the door to leave.\n\"Thanks for your efforts, Mord.\"\nThe others called him but Mikhail called him ’Mord’. Something he only did.\nModric didn’t mind whatever he was called.\nThat didn’t mean that the boy had no emotions. He did.\nJust as much as everyone. He just didn’t know how to express them.\nBut in any case, Mikhail genuinely meant the compliment.\nIf not for Modric, he could have definitely never gotten this mission done.\nThe understanding the two had for each other was top-tier.\nModric didn’t turn back to look, standing frozen at the door with his hand on the knob.\nMikhail took this chance to joke between them after a long while.\n\"I’m not smiling like a girl, you are.\"\nImmediately, Modric stuttered.\"\n\"S-shut up, bastard.\"\nOpening the door, he quickly stepped out and slammed the door shut.\nBut as he left, the wind carried a message in Mikhail’s ears.\n\"No problem but...trust us more or at least, me.\"\nAs the words trailed off, a laugh escaped from Mikhail’s mouth.\n’So he knew after all.’\nThese people knew him too well.\n***\n[At Night]\nMikhail stepped out of the infirmary, finally discharged.\nHe stretched his arms in the air, feeling constricted after all that time.\nBut except the physical tiredness, he was feeling all well.\nNo signs of mana overload or anything.\n’I should check my Spirit Tree.’\nClosing his eyes, he focused on reaching his spirit pool and instantly, he felt his consciousness fading.\nHis senses warped and distorted but he felt no weirdness.\nIt used to be present for everyone at the start but now it felt normal.\nAs the distortion went away, Mikhail knew he was there.\nOpening his eyes, Mikhail was greeted by an ever stretching expanse of darkness.\nExcept a single source of light, nothing could be seen in the place.\nExcept that source, nothing was present in the place as well for one to see.\nFeeling wet, Mikhail looked down, only to see the whole expanse covered in water that came up to his ankles.\n’I always forget about this.’\nBut the sea wasn’t his focus right now.\nIt was that ginormous source of light in front of him, standing high and tall at the center of the space.\nWith its grand golden branches stretching high above into the ceiling-less black expanse, Mikhail’s Tree of Yggdrasil looked healthy as ever.\nSplush...\nMikhail started to walk towards the tree, parting through the water.\nWith its gigantic golden body shining as ever, the grandness of the tree reflected in the water.\nAs Mikhail reached near, he saw golden leaves of the tree floating on the surface of the murky water.\nThis gigantic tree was called the Tree Of Yggdrasil, or in short, the spirit tree of a person.\nAs a person advanced through the ranks of a Magus, his spirit tree would grow as well.\nIts branches and roots would spread out and it would grow larger.\nThe leaves of the tree represented the mana of a person.\nAs a person grew older or their life started to diminish, the leaves would start to fall down.\nFor demonic entities such as monsters, they had a spirit tree as well.\nUnlike Magus’ though, it was called The Tree Of Sephiroth.\nJust like humans, they had 5 ranks of progression as well but the effect with each rank-up was different.\nThe Tree of Yggdrasil represented the human’s journey or ascension towards divinity.\nWhile The Tree of Sephiroth represented the monsters or demon’s journey or descending towards profanity or madness.\nTo further show this, The Tree of Sephiroth was inverted in the Spirit Sea.\nRather than growing from the ground, it would grow from the top of the expanse.\nIt was also why each rank induced not just strength changes, but personality and behavioral changes in a person as well.\nLooking at his healthy tree, Mikhail knew that he was perfectly fine.\nIt was then that he realized the completion of the quest.\nBefore his dream could end, he saw that both of the rewards from his quest had been granted.\nHe quickly opened his information tab.\n—————〔Information〕—————\n• Character Progression 0 ––> 15%\n• Mana: 6400 ––>6700/6700 [Dragma]\n—————————————————–\nIt was true. His mana had actually increased.\nAlthough, after the quest, he felt the reward to be a little underwhelming as compared to the risk he had gone through.\nLooking at the Character Progression, Mikhail still didn’t understand what it meant.\nWait.\n’Was this the reason why I had that dream?’\nMikhail still didn’t know what that dream meant. Nor did he have the time to think about it.\nHe had no idea as to why it would contribute to his character.\n’I can only wait and see.’\nWanting to leave, Mikhail closed his Spirit Tree, but the moment he left, something happened.\nA leaf fell from his tree.\nBut not only that, what stood out about it was its color\nRather than shining in a golden light like the rest.\nThe leaf floating on the surface glowed in crimson-red light.\n_____________",
      "scraped_at": "2025-11-21T13:54:27.583047",
      "content_scraped_at": "2025-11-21T13:54:28.167201",
      "error": null
    },
    {
      "id": "23",
      "number": "23",
      "title": "Chapter 23: Assessment Tests",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/23/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 23: Assessment Tests\n[A week later]\nMikhail stepped outside of his camp dorm finding his squadron already assembled outside.\nAs always, he wasted no time with the group already following behind him.\nWalking towards the drill grounds, he looked around at the state of the camp.\n’Still a lot to work on.’\nA whole week had passed since the incident.\nBut the reminders of the destruction were still there.\nBroken buildings. Broken Glass. Broken Trees and Plants.\nDry blood marks on the ground.\nThe recovery process was very slow but Mikhail couldn’t blame the camp for it.\nThe incident wasn’t reported to the Empire so of course, there would be no help provided from them.\nThe castle was trying to procure resources from other castles and towns in the wilderness for the meantime.\nThe Stables had also been partly destroyed, making most of the drill routes too long to be checked.\nMoreover, Vlahovic had suffered quite many injuries in the battle, so there was no one to direct them.\nBut despite the losses, Mikhail didn’t fret over the results.\nAs he had said before, it was much better than last time.\nAt least one thing the academy maintained was its liveliness with the men.\n’Something that was lost in the past life.’\nIf anything, Mikhail appreciated the Empire not giving the academy any help.\nThis incident had served as one of the catalysts to open every men’s eyes.\nThe betrayal they felt when they weren’t saved by their-so-called god, the Dominique, had made them truly realize their situation.\n’Everyone has no one to rely on but themselves.’\nEntering the grounds, Squadron 21 was quick to go and stand in their position.\nThe past week had been given off to everyone to recuperate and rest up.\nSo this was their first call-out ever since the incident.\nAnd as everyone came to stand, for the first time, they came to notice in reality just how many people they lost.\nThe ground, which almost seemed to be filled to the brim before with this wall of men standing in formation at the edges...\nWas now left empty in certain parts.\nIt was as if the wall of men had cracks in it now, with a lot of people missing from certain squadrons.\nIn fact, Mikhail could only see 11 squadrons or less that hadn’t lost any member in the fight.\nHis squadron being one of them.\nThese 11 squadrons were all the squadrons with 5 members or less.\nOr in other words, they were the squadrons that had the strength within themself to fight the monsters.\n\"Do you feel something different today?\" Icarus asked from the back, sensing the energy.\n\"It isn’t just the silence of the deaths, it feels like some oppressive atmosphere has descended on the ground,\" he continued.\nFrom the front, Mikhail nodded.\n\"It is. It’s the squadrons that lost a member or two in the fight. Look at them.\"\nListening to his words, the whole squadron looked around.\nAnd instantly, they felt the aggressive glares and stares from the mentioned people.\n’They are acting like children.’\nRather than blaming it on the stronger people, they should just blame themselves for their weakness.\n’But of course, it’s much easier to find flaws in someone else than yourself.’\nIt was just nature’s course. A child’s maturity level.\nMikhail didn’t feel anything about it. The same had happened last time.\nIn fact, it was much worse last time as the squadron’s that didn’t lose a member were not more than 3 or 4.\nThe treatment they got was much worse but Mikhail’s squadron couldn’t care less.\nNot that time and not this time.\nThey were only concerned with themselves and the well-being of their family.\n’As it should be.’\nIf only these people were able to reach this level of understanding.\nTo become strong enough to protect yourself rather than seek protection from the strong.\nJust like how they did with Dominique.\n’Too naive. Too weak.’\nMikhail concluded calmly.\nOne of their weakest traits.\nHowever, there was another difference this time around.\nA major difference that wasn’t present the last time.\nAnd Mikhail knew what it was. Even his squadron felt it.\n\"Mikhail,\" Icarus called from the back.\nHe didn’t answer so he continued.\n\"Why are a lot of them glaring at you instead of us?\"\nIt was true.\nA large majority of the glares directed their way weren’t at his squadron.\nIt was at him. Mikhail Hendrix, 1st Platoon Leader in the raid.\n\"I’m sorry Mika-\" Yvan apologized from the back.\nBut Mikhail was quick to make him stop.\n\"Don’t.\"\nTurning his face for the first time, he looked him dead in the eye with his blue calm eyes.\n\"I wasn’t able to say it before but, you did a great job handling the platoon in my stead.\"\nHe took a pause.\n\"No one could have done it better than you and I mean it.\"\nHe genuinely did.\nIn all of the deaths that had been reported to him by Modric, only a record 6 deaths were from the 1st Platoon.\nOnly 6.\nHe couldn’t be more proud of the way he handled that large of a platoon.\nEspecially considering he had no experience in doing so.\n\"It’s their fault for being weak. They need a target to channel all this hatred into. Now that they found one, the best you can do is ignore and focus on yourself.\"\nAt Mikhail’s compliment, Yvan was left speechless just like the hospital.\nEveryone knew how much Yvan admired Mikhail.\nWell, everyone in the squadron did but Yvan’s devotion to Mikhail was something else.\nHe quickly nodded/\n\"Y-yes, I understand.\" he tried to calm himself, now fixing his expression.\nIf Mikhail had appreciated him, he needed nothing more.\n\"Good.\"\nTurning back to the front, Mikhail focused on himself.\nHe didn’t want to make his squadron feel the pressure from these glares or opinions.\nThat was all he thought about.\nThe hatred directed at him personally? Mikhail couldn’t find himself caring a damn about it.\nIt wasn’t the first time and it wasn’t going to be the last one.\n’Just a natural process.’\nFocusing back on the ground, Mikhail saw the substitute staff finally enter the ground.\nSince Vlahovic was in recovery, they were the ones handling the squadrons.\nMikhail knew what they were assembled for here today.\nIt was going to be the same as last time.\nA small way of keeping them busy until the academy got back on track.\nAnd that was...\n\"Assessment Tests.\"\nYes, they were going to be tested for their fitness and mental strength.\nEspecially after how many were left traumatized after the attack.\n________________",
      "scraped_at": "2025-11-21T13:54:29.182327",
      "content_scraped_at": "2025-11-21T13:54:29.767316",
      "error": null
    },
    {
      "id": "24",
      "number": "24",
      "title": "Chapter 24: The Truth In The Lies",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/24/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 24: The Truth In The Lies\n\"Good morning everyone.\" Master Avalon greeted the cadets.\nUnlike usual, there was no response from the cadets.\nIt was clear that the mourning air of death was still there after a week.\nBut here was the difference...\n\"Let’s continue on our normal schedule,\" he said.\nBut as he was about to continue, a voice came from the crowd.\n\"Do you guys really don’t feel anything over what happened?\"\nIt wasn’t anything more than a whisper.\nBut in the silence of the large ground, it echoed like a haunting question.\n\"Hmm?\" Avalon turned, his eyes now toward the cadet who spoke out from the Squadron.\n\"Elionor Marvin from Squadron 24, speak clearly on what you mean.\"\nThere was no expression of annoyance or irritation on Avalon’s face.\nIt was completely calm.\nThe respective cadet, Elionor, finally couldn’t take it anymore as he raised his voice.\n\"Are you people just going to ignore what happened a week ago!?\"\nHe came walking out the squadron.\n\"Those people risked our lives with us to save this academy!\"\nHe started shouting now.\n\"Yet! You people couldn’t even give them a proper funeral!?\"\nThere was complete silence in the ground as Elionor shouted.\nHis voice echoed in the large space, right into the ears of the Avalon, who was calm as ever.\n\"You, you people couldn’t even protect your own castle!\"\nHis voice finally died down, reducing the noise in the ground back to the whispers of the wind.\nMikhail observed the situation silently with his squadron.\n’As said, these people are too weak and naive.’\nAt this point, they were just finding reasons to put the blame on.\nTheir weakness was too hard to accept.\nMikhail’s eyes turned to Avalon, waiting to see his response to the words.\nAnd after a few seconds of silence, Avalon turned back to his original position.\n\"There. These few seconds of silence are enough for their honor.\"\nFacing the cadets, he was about to speak again when Elionor tried to shout again.\n\"You can’t-\"\nUnfortunately for him, Avalon was done with his bullshit.\nThis was the moment that the men of Castle Blackmire would finally understand their worth.\nAnd Mikhail had been waiting for it.\nTaking the gun out by his waist, Avalon pulled the trigger.\nBOOM!\nThe shot travelled straight past Elionor’s head, grazing his cheek.\nThe boy’s eyes widened with horror and panic as if his life just flashed past him in a second.\n\"A little to the right and you would’ve been dead.\"\nAvalon strapped the gun back to his waist.\n\"Now tell me, if you were to die right here, who would’ve retaliated to your death?\"\nHis question was heard loud and clear in the ground, the silence as flat as ever.\nElionor, who had collapsed to his knees in fear, was unable to answer.\nHis mind was still reeling from the shock of how close he had been to death.\nStep.\nAvalon started walking toward him.\n\"Your squadron?\"\nHis sharp black eyes went to the squadron he came from, searching for answers.\nElionor’s trembling eyes turned to the back, only for a horrified gasp to escape his lips.\nAll of them..\nNot a single one was meeting his gaze.\nAll of them had been reduced to absolute rats with one shot of the gun.\n\"None.\" Avalon finally reached him, his eyes locking down on him from above.\n\"In fact, I’ll ask this, which person from here would even bother to mourn your death if you were to die here?\"\n\"Look around and see. Raise your hand if you would mourn for him.\"\nBut this time, Elionor was too defeated to even try. The reality had been too harsh on him.\nUnfortunately, it would only get worse for him as a crunching kick was delivered to his cheek.\nCRACK! THUD!\nBlood spilled in the air as Elionor’s face slammed on the ground.\n\"None. That’s your worth in this world.\"\nGrabbing the boy’s bloody face by the hair, Avalon pulled him up close to his head.\n\"You, to me, to the Empire, to these people are nothing more than a mere speck of dirt.\"\nAt this point, there was not a single spark of rebuttal left in Elionor’s eyes, with tears streaming down his face.\n\"Honor and respect is never fully earned. That’s a fat lie.\"\nAvalon spat on the ground.\n\"It’s half-given from your birth and half you have to earn. But your respect and honor?\"\nA smirk spread on Avalon’s face.\n\"The only respect you were given at birth is to be discarded by your parents to the hold rather than being buried alive at a day old.\"\nAvalon let go of Elionor’s hair, letting him fall to the ground, now completely broken.\n\"If these people who died had done enough in this world, then they would’ve definitely been honored. Not just the camp but the whole world.\"\nHe started walking away.\n\"But the problem?\"\nAvalon turned back.\n\"You people think too highly of yourselves. Too important. Too worthy.\"\nMikhail listened to the whole truth with a calm expression.\nHe knew a lot of people were getting butt hurt right now.\nBut unfortunately, that was the cruel truth.\nThe best thing you could do was just accept it.\n\"But the reality?\"\nAvalon spat on the ground.\n\"You sit at the lowest of the lowest in this world. Thrown out of the wall like trash.\"\nHe pointed to the spit on the ground.\n\"In the eyes of the Empire, this spit holds more value than your life.\"\nHe started walking back to his original position.\n\"So don’t come crying about respect and honor. If you had enough respect, the Dominique wouldn’t have watched you die like insects that day.\"\nEvery word of his stabbed into the hearts of the cadet like a hot knife.\n\"So realize that you aren’t even the worth of a normal human. You are worthless and the fact that none of you can say anything about it, proves it as the absolute truth.\"\nHe ended his speech, the ground still in the echoing silence as it was before.\nElionor’s body lay on the ground, now defeated and broken.\n’A clear delivery of truth to the cadets.’\nAnd the defeated expression on everyone’s face clearly showed it.\n\"Now, let’s continue.\"\n_______________",
      "scraped_at": "2025-11-21T13:54:30.782940",
      "content_scraped_at": "2025-11-21T13:54:31.366343",
      "error": null
    },
    {
      "id": "25",
      "number": "25",
      "title": "Chapter 25: The Second Mission",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/25/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 25: The Second Mission\n\"Let’s move on to today’s task. Assignments.\"\nThe whole ground was completely silent after his speech, now focusing on his words.\n\"Since the camp is still in reconstruction, most of the drill routes can’t be checked. The stables aren’t in the best of conditions right now.\"\nMikhail already knew that and so did probably everyone else.\n\"So in the meantime, we have decided to conduct your assignments ahead of schedule.\"\nAssignments weren’t something new to everyone.\nThey were conducted every 6 months in the camp.\nBasically, they were a series of tests conducted to see who was in shape and who needed working.\nIt helped to see who was the strongest, who was above who and all that.\nThese tests included everything from one-on-one spars, to physical exercises, to mental examinations.\nNo one in his squadron had ever failed them so there was nothing in it for them to be afraid of.\nIf anything, Mikhail was hoping for these to see how far he had come with all these bonuses.\nIt was a good thing that they were being conducted early this time.\n\"Due to the reconstruction, even in the assignments, some exercises can’t be conducted due to unavailability of their facilities.\"\n’Makes sense.’\nAvalon continued, making the most surprising news for them now.\n\"Unfortunately for everyone, due to shortage of time, you will only have a day to prepare for these tests.\"\n’That’s new.’\nThe last time, they had given quite a while to prepare.\nMaybe it was because of the new recruits that arrived after those deaths.\n’They probably wanted them to adjust properly.’\nMikhail could see the expressions of discomfort and despair on people’s faces at Avalon’s words.\nHe didn’t have any problem with the time. Nor did his squadron.\nTheir abilities–not just mana but also physical– were enough for them to always place high enough in the list.\nEspecially Mikhail.\nOutside of just his squadron duties, he made sure to keep himself in shape physically.\nAs for his mana abilities, Mikhail was known to have the largest–if not, one of the largest– mana pools among the men.\nIt was the difference between his squadron and the majority of other ones.\nDespite their strength, they made sure to keep improving.\n\"That’s all. If you want, you can use the available grounds for training.\"\nAvalon pointed out.\n\"The list for the exercises and schedule will be sent to the squadron leaders in a few hours.\"\nEnding his speech, Avalon left the ground, leaving everyone alone.\nMikhail turned back, addressing his squadron now.\n\"Nothing new. Same as last time, maybe even easier because of the reduced exercises. However, as always, don’t take it easy,\" Mikhail said.\nEveryone nodded.\n\"I’m looking forward to the elemental tests,\" Oscar excitedly said.\n\"Of course you would, it’s a breeze for you.\" Icarus sighed.\nIt was true.\nOscarl’s rank for Cindralis Essentia was higher than anyone else among the men.\nMikhail’s flames were nothing compared to him.\n\"I’m looking forward to the races.\" Yvan chose to put his thoughts forward as well.\n\"Again, it’s because of your Essentia.\" Icarus pulled his arms behind his back.\nYvan chose to strike back at him.\n\"You are just salty you can’t win against Oscar in elemental tests.\"\nThe attack seemed to work as Mikhail saw Icarus shudder before quickly waving it off.\n\"Whatever, I’m better in physical tests anyway.\"\nMikhail turned to Modric.\n\"What about you?\"\nAt his question, Modric simply shrugged.\n\"Never had any interests to top in these aspects.\"\n’It’s true.’\nMikhail remembered.\nDespite having the highest rank for Borealis and Thundralis, Modric had never been the competitive type.\n\"Though..\"\n\"Hmm?\"\n\"If there’s one thing I’m looking forward to it’s one-on-one spars,\" Modric said, the corners of his lips almost pulling up.\n\"Yeah, same.\" Oscar exclaimed.\n\"Me as well.\" Yvan raised his hand.\n\"Me too,\" Icarus smiled at Mikhail.\nMikhail knew what they meant.\nThey weren’t looking forward exactly to the one-on-one spars.\nThey were looking forward to fighting him.\nAnd he had no problem with that.\n\"Sure.\" Mikhail accepted their challenge, knowing what they meant.\n\"What about you though?\" Icarus asked.\nAt his question, everyone’s heads turned toward Mikhail as well, filled with curiosity.\nAll of them knew about what kind of person Mikhail was.\nDespite being one of the strongest men at the camp, he didn’t like to display much of it.\nHe was one of the only few men in the camp with 3 Essentia and the only one if he chose to reveal Otharis.\nHe had not one but two elements at the second highest rank possible.\nBut this wasn’t all.\nMikhail had the record for highest scores in physical and mental examination for a year.\nSo there was pretty much nothing that he couldn’t get a good score in.\nYet, even with all this, he didn’t show much of it willingly.\nIt was not to say that he didn’t try or he was hiding it from the public.\nNo.\nThat was not the case.\nIt was just that Mikhail never saw a point in such competitions.\nWhat mattered to him was at the end of the day, only his and his squadron’s survival.\nTrophies and accolades were nothing if you couldn’t survive in a war or battle.\nHis whole squadron knew about this as well.\nSo even though they knew the answer, they wanted to see if he would try at least this time around.\n’Hmmm..’\nMikhail didn’t know what to think about it.\nNormally, he would have declined to do much but, this time around, it was different.\nHe had to change his ways.\nIt was the only way to change his future later on.\nThe plotline would certainly mess up a lot, but when did he ever care about that.\nIt had already started changing the moment he accepted the first quest.\nThe moment he changed the drill routes.\nSurprisingly, at that moment, a notification came in front of him.\n—————〔Chronicle II〕—————\n[Condition:]\n•\nPlace as the highest rank in 3 categories you have never participated in or never topped in.\n•\nBreak the records of your previous categories.\n[Rewards:]\n•\nCharacter Progression: +5%\n•\nMana Increase: +80\n———————————————\nThere it was.\nThe final nail in the coffin.",
      "scraped_at": "2025-11-21T13:54:32.373074",
      "content_scraped_at": "2025-11-21T13:54:32.957896",
      "error": null
    },
    {
      "id": "26",
      "number": "26",
      "title": "Chapter 26: Selections (Intro)",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/26/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 26: Selections (Intro)\n[The Day After]\nMikhail had accepted the request given to him by the system.\nThough he couldn’t understand the purpose of the quest.\nIn his mind, the quests given to him by the system related with his future in this life.\nNot just the Character Progression, but the overall meaning of the quests as well.\nIn a sense, the previous quest did relate to his future.\nIt allowed him to change a significant point of his previous life, turning around the complete future.\nSo he couldn’t understand how this new quest would do that.\nOr maybe it wasn’t meant to have any relation to his future and were just random quests at the current point in time.\nMikhail made that hypothesis just after one quest after all.\nLast night, the list for all the aspects in the assignments test had been given to him.\n___________________\n•\nElemental Tests\n•\nTrack Race\n•\nPhysical Tests\n•\nMental Examination\n•\nSurvival Tactics\n•\nAlchemy Tests\n•\nSpellcasting Tests\n•\nOne-on-One Spars\n__________________\nA total of 8 categories, unlike the usual 10.\nCategories like Medical Tests etc weren’t able to be conducted right now.\nQuite a portion of the infirmary had been damaged under the attack and the rest was still filled with heavily injured cadets.\nIn any case, in the given 8 categories, Mikhail always took Physical Tests and Mental Examination.\nHe had the top record in both of the tests.\nAnd while he could try doing the same for other records as well, he never did it.\nUnfortunately or fortunately, because of the quest this time, he had to not only pick 3 different categories other than his usual ones.\nHe had to also top them at the 1st position.\nFrom the above list, Mikhail already picked the 3 categories he was going to participate in.\nThey were Elemental Tests, Spellcasting Tests and One-on-One Spars.\nFor the first, he could guarantee himself a top position as a Norvalis Magus.\nFor Cindralis, it would be hard to beat Oscar and his talent in Aqualis wasn’t that high enough.\nThe second was obvious. His Dragma was the perfect tool for this aspect.\nNot to mention his oath abilities that further allowed him to reduce his casting time.\nAs for the last category, it was obvious as well.\nJust like his squadron, Mikhail himself was eager to fight them as well.\nOnly by assessing their abilities in battle himself would he be able to provide them further advice.\nHowever, at the same time, he feared that this was the riskiest category he had taken.\nBecause of course, his squadron wasn’t going to be the only team he would fight.\nAnd in fighting different people–even though he was confident he would win–there was definitely a chance for him to lose.\nWhich meant the failure of the quest.\nAll in all, he could just try his best.\nToday was the first day of the assignment tests which would further span over a course of a week.\nAs he headed outside his tent, Mikhail was quick to see his squadron, waiting for him.\n\"Morning.\" He greeted, making their faces turn.\n\"Morning!\" Oscar waved, gesturing to him to come quickly.\nJoining them, the team started to move towards the grounds.\nUnfortunately, they were due to separate soon because of their different categories.\nThere were 8 categories and the time was short. So the ideal way was to carry out multiple of them at the same time.\nAnd with that, each category would have a different venue as well.\n\"It’s Physical Tests for me first.\" Icarus told the team, his arms wrapped behind his head.\n\"Elemental Tests for me.\" Oscarl declared in response as well.\n\"Survival Tactics for me.\" Yvan smiled.\nAll of them turned toward Modric, the second last person left.\n\"It’s Spellcasting for me,\" he said, showing no excitement unlike Icarus or Oscar.\nBasically, all categories were open at all times. You could go and attempt at any time you wanted.\nExcept some certain ones.\nAt the end of the day, your record would just be shortlisted among the men.\nAs he had said before, it wasn’t an exam or anything. It was a simple fitness test conducted to see who was in shape.\nAs they were about to separate, Mikhail heard Yvan ask from him.\n\"What about you Mikhail? What are you going to attempt first?\" He put his palm to his chin in curiosity.\nMikhail, not surprised by his question, barely showed a reaction on his face and answered after a moment of thought.\n\"I think I’ll take the Mental Examination first.\"\nThe first one to respond was Modric with a nod.\n\"That’s a good idea. The fresher you are in that category, the higher score you can obtain,\" he explained.\nMikhail returned the nod, affirming his words to the confused team.\nModric was used to taking the Mental Examination as well, so knew about it.\n\"Since the Mental Examination tests your willpower, your resilience and your pain resistance, it is advised to go and attempt it with a fresh mind.\"\nMikhail summed it up for the team, providing them the basic idea of the test.\nJust as he expected, the team understood the rest of what he meant by those words.\n\"Ah,\" Yvan nodded to his words.\n\"In any case, let’s split up here. The faster we get done, the faster we can meet up later on.\" Mikhail advised.\nModric nodded, supporting his decision and the team followed a second later.\n\"Okay. Good luck to everyone! Let’s meet up here later with good news.\" Icarus smiled,\nThe team–except Mikhail, as always—smiled lightly at his words.\nIcarus put his hand forward in a fist bump, gesturing everyone to join him\n\"On the count of 3, everyone join your hands as always.\"\nIn the team, it was common for Icarus to do this before any event.\nAccording to him, it boosted his and the team’s morale for the event.\nSeeing no problem as always, the team joined their hands together, even Mikhail.\n\"Alright, everyone! Once again, good luck for your assignment exams!\" Icarus retraced his hand along with everyone, pushing it in the air.\n\"Yeah.\" Mikhail smiled lightly.\nIt was good to be back with them.",
      "scraped_at": "2025-11-21T13:54:33.965229",
      "content_scraped_at": "2025-11-21T13:54:34.548000",
      "error": null
    },
    {
      "id": "27",
      "number": "27",
      "title": "Chapter 27: Mental Exam",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/27/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 27: Mental Exam\nMikhail entered the Mental Examination building, now alone and separated from his squad.\nIt wasn’t his first time coming here so he already knew the way.\nThe building wasn’t too small but neither was it too large.\nIt was moderate in size with its entire structure being decorated in white tiles.\nThe building’s furniture had different lab equipment and machines placed inside, giving one the feeling of a research lab.\nIt was all basic equipment however, nothing that advanced.\nWell, in a certain sense, it already was.\nMikhail saw different higher-ups quickly walking through the building, trying to get the equipment ready.\nAlong with their normal black coats, they wore white lab coats that highlighted their position.\nMikhail could already see some of the men present in the facility, waiting for their turn.\nThey weren’t all that much however.\nA major reason for this was the toll that mental examination put on a person.\nEven though he had said that it was recommended to come here because of a fresh mind, it had the opposite effect as well.\nThe tests taken during the examination could induce stress and exhaustion in the person, even making him feel dizzy.\nIt was why most people who wanted to attempt multiple categories in a day avoided taking this test.\nOf course, it wasn’t the same for himself. He was just built differently.\n\"Oh you’re here. Same as last time?\"\nMikhail heard a feminine voice from behind him, turning after recognizing him.\nThere she was.\nA woman that seemed to be in her late 20’s with short black hair styled in a bob-cut with blue eyes just like him.\nEmily Tate.\nMikhail knew her well.\nShe was the lead researcher here in the mental examination lab, overseeing all the tests and results.\nAlso one of the only few women ever allowed on the wall. For what purpose she got sent here, he didn’t know.\nHe had gotten well acquainted with her over time when coming for his tests.\n\"Yes.\"\nMikhail nodded.\n\"Hmm...\" Emily put the pencil to her chin, leaning closer and examining him from all sides.\nFeeling weird because of her closeness, he was quick to ask.\n\"What’s wrong?\"\n\"Nothing much, I’m just checking if you have any injuries from that incident. It would be a problem if our star prospect had any problems.\"\nShe searched his face to see any reaction about being mentioned as a ’star prospect’.\nUnfortunately for her, she found nothing but a straight face.\nMikhail saw her face twitch as if she got annoyed.\nHe quickly changed the topic.\n\"I’m fine. Just some light injuries but I recovered quickly.\"\nEmily smugged, spinning the pencil in her hand as she turned to guide him.\n\"Of course you did. Why was I even getting worried about you?\"\nMikhail stared at her back as she walked.\nShe wasn’t even worried for him personally.\nShe was worried about the state of their ’star prospect’ not ’Mikhail’ himself.\nDespite their informal way of talking, they were nothing more than acquaintances.\nHe knew the woman only saw him as a means to her research because of his exceptional talent.\nNormally, one would stay away from such a person after knowing this but not Mikhail.\nBecause it wasn’t like he wasn’t getting anything out of her.\nIn addition, he knew that the woman was aware that Mikhail knew about her plans.\nIt was a mutual relation where both were using each other.\nUnfortunately for her, Mikhail barely gave her any chance to take unnecessary advantage of him.\nAs they walked through the lab, Mikhail saw various men seated on the benches at the side, waiting for their turn.\nHe could feel their stares of envy and jealousy digging a hole in his back.\nThese men barely ever got to see a woman up here after all. And now she was getting smuggy with him.\nBut they knew this would happen.\nAt this point, they were used to Mikhail always having the first turn in this examination.\nIt was the reason why they didn’t bother to make a queue already and remained seated on their benches.\nReaching a white door, Emily turned back to him.\n\"As always, head inside and get ready. I’ll report to the lab and we’ll start the examination right away.\"\nMikhail nodded.\n\"Alright.\"\n\"Tell me if you feel the slightest inconvenience or weirdness okay?\" She asked, signs of fake worry in her eyes.\nMikhail ignored her question, opening the doors and heading inside.\nFrom behind he could hear Emily chuckling.\n\"Straightforward as ever huh?\"\nIgnoring her once more, he focused forward.\nThrough the doors was a large square-shaped room completely decorated with black concrete all around.\nThere was absolutely nothing in the whole room.\nNot even a source of light as Mikhail saw the dimly illuminated room because of the outside light.\nHowever, there was one thing that could be noticed.\nIt was the medium-sized white circle boundary in the middle of the room.\nJust from a glance, one could feel that it seemed to be a space separate from the rest of the space.\n’And it is.’\nClosing the doors to shroud the room in darkness again, Mikhail started walking to the circle.\nAs the room was covered in dark again, the boundary suddenly illuminated to provide an eerie luminescence.\nFrom the walls, Mikhail heard Emily’s booming voice.\n\"You know the drill don’t you?\"\nMikhail didn’t answer, only doing a simple nod to confirm.\n\"Good, settle down and we can start the tests. It should take no longer than 30 minutes.\"\nStepping inside the small circle, Mikhail instantly felt as if his body was entering a separate dimension.\nHe could feel his senses distort and a weird sensation pass through his body.\n’Illusias Magic.’\nWithout wasting any moment, he sat down inside the small circle.\nIt wasn’t that large in size. Moving a lot would definitely place him out.\nReadying himself, Mikhail spoke up.\n\"I’m ready.\"\nTo show that his confirmation was heard, the boundary light of the circle just turned from white to red.\nThe whole place gave off a haunting, eerie vibe now.\nMikhail gave no reaction, already used to the process as he closed his eyes.\n\"The test will commence in 3, 2, 1.\"\n\"Now.\"\nThe second it began, Mikhail felt his surroundings change, as if he was warping through something.\nThe test was simple.\nThrough the use of Illusias and Spiritalis Magic, the castle would induce various traumas and scenes for the participant inside the circle.\nThe experiences given would vary from past memories to even purely crafted imaginary scenes to see the participant’s reactions.\nAt a certain point, even various emotions like pain would be pushed into the participant to see his reaction to the situation.\nAt any point in time, if the participant passed out or chose to run and moved out of the circle, the test would be over.\nWith each passing second, the hardness and severity of the challenges would increase.\nAnd the further user showcased his mental endurance, the higher his score would go.\nThe scores of the participants were given from 1 to a 100 and the average score of a normal participant was 46 to 55.\nIn talented cases, this score could even go up to 60 to 65 but no further than that.\nAny further and the participant had to be a psycho or mental patient to endure that much.\nOf course, adults could go way higher but we were talking about 19 to 20 year old young people here.\nEven if they were killers or some of the most morally disgusting people here on the wall, everyone had fears.\nBut only one certain man had displayed a score that was never seen before in the history of mental examinations.\nAt just the age of 21, he had a mind-breaking score of 72.\nAnd that man...\nWas none other than Mikhail Hendrix.\n___________",
      "scraped_at": "2025-11-21T13:54:35.551594",
      "content_scraped_at": "2025-11-21T13:54:36.151150",
      "error": null
    },
    {
      "id": "28",
      "number": "28",
      "title": "Chapter 28: One Who Withstands Despair",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/28/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 28: One Who Withstands Despair\nThe moment Mikhail felt the surroundings change, he also started hearing them.\nSpirits.\nEven with his eyes closed, the darkness in front of his eyes started to subside now.\nIt gave way to a bright light that illuminated his whole surroundings, which were now in the form of a bright desert.\n’Hmm?’\nHe was now seated in the middle of a long and cracked railway track, one that parted through the sands into the far light.\nThe heat immediately assaulted his thick clothes and bandages and the bright sun made him squint his eyes.\nWherever he turned to see, there was nothing but sand all around.\nHowever, not for long as he suddenly heard a booming sound from behind.\nCHING!\nThe sound of a train, tearing through the air at unmeasurable speeds.\nBut despite the nearing danger, Mikhail felt no sort of nervousness.\nCarefully, with one sharp motion, he turned his head back to see the train.\nOnly to find it an inch away from his face, about to send him flying when suddenly..\nCHING! WHOOSH!\nThe moment it connected with him, the train disappeared into a wisp of smoke.\nMikhail felt nothing.\nBut then suddenly, he felt a booming noise of the train ramming into him from behind.\nBOOM!\nMikhail felt pain coursing through his whole body and his brain screamed to dive forward.\nFortunately for him, he had been through this before.\nIt was all fake.\nBearing through the pain, Mikhail ignored the urge to dive and remained rooted in his place, despite the threatening voice from behind.\nThe pain continued for a good minute before suddenly disappearing, along with the scene.\nAs it did, Mikhail heaved a large sigh of relief.\n’Bring it on.’\nFrom the corner of the darkness, he heard a group of hysterical shrieking laughs.\n\"Oh ho, we have an interesting prospect. Hehe.\"\nThe next moment, the voice suddenly came right beside his ear and a painful sensation of nails dragging across his back was felt.\n***\n[In the Lab]\nEmily gazed at the screen curiously, seeing Mikhail’s progress.\n\"23. 24.\"\nShe turned to a member beside her, who focused on another screen.\n\"What’s the heartbeat?\"\n\"It’s still stable at 74 but we can see signs of rise.\"\nEmily tapped the pen against her chin turning back to the monitor that displayed the inside of the room.\n\"Hmm, I see. Impressive as always. Most people would start breaking by now.\"\nOn the screen, she could see the dark room with Mikhail sitting in the center with his eyes closed.\nThe illuminated circle lit up Mikhail’s face, which was currently a peaceful calm.\nThere were no signs of distress or frowns on his face. But then again, it was just the start.\nAt least for him.\nEmily turned to another member on the other side.\n\"Any changes in his body?\"\nThe reply came instantly.\n\"Nothing yet. Stable as ever, he’s taking it very well.\"\nEmily nodded, turning her gaze quickly back to the screen.\n\"Of course he is, he’s Mikhail.\"\n***\n[After a couple of minutes]\nLight gasps escaped from Mikhail’s sweaty face now.\n’Annoying spirits.’\nHis gaze went down to his bandaged arms, or at least what they formerly were.\nNow, the bandages had been ripped and blood and flesh dripped all over his arms.\nStabs of pain coursed through his whole body from time to time, making his face scrunch.\nLeg first.\n\"Tch!\"\nThen suddenly, his shoulder.\n\"Argh!\" Mikhail gritted his teeth.\nThe shrieking laughter from time to time right by his ear and then away were making his control slip away.\nSuddenly..\nSCREECH!\nA tearing scream echoed in his right ear, making his body convulse with instinct to close his ears.\nUnfortunately, it slipped away from his control.\nHis chest pressed heavy against him as a tearing pain tore through his abdomen, like a spear had ripped through him.\n\"Argh!\" He collapsed to the floor.\nStruggling to breath with the increasing pain, Mikhail felt his consciousness slipping.\n’What is this?’\nHe couldn’t understand.\nHow long had it been?\n5 minutes? 6 Minutes?\nHow much of a score would be for this amount of despair?\n39? 40.\n’P-pathetic.’\nThis was way lower than his usual attempts, so why was he struggling?\nWhy was he struggling even after a life full of despair behind his back this time?\nWhy was he so unfamiliar with despair after all the loss he had sustained in his previous life?\nAfter going through all those struggles and pain in the outer world, he was struggling with this?\nWhat about the despair when he witnessed his squadron right in front of him?\nWhen despite the oath to always protect them, he was helpless as he watched the beasts devour them?\nIncomparable. Nothing could describe what Mikhail felt at that moment.\nWhat about all those days that he spent in the harsh snow, watching himself wither to death?\nWhen all he could see with his fading vision was the strewn bloody bodies of his death, slowly rotting away?\nWHAT OF IT!?\n’Pathetic.’\nPATHETIC!\n’Disgusting. Despicable. Trash. Pathetic. Bullshit.’\nWas this all that he could amount to after all that pain and despair?\nWas this all he could show for what he went through?\nWas this it!?\n’NO!’\nNo. This wasn’t his relation with despair.\nThey weren’t strangers. No. They were far from it.\nIf he was an orphan, then despair was his adopter.\nIf he was helpless, then despair was his helper.\nIf he was hungry, then despair was his feeder.\nIf he was crying, then despair was his relief.\nIf he was screaming, then despair was his soother.\nIn whatever situation he was in, despair had always been with him.\nIt was always there for him to embrace.\nIt was his friend. His other half. His mentality.\nSo how could he come here and then despair like he didn’t even know what it was.\nNo. This wasn’t it.\nIt wasn’t how it was going to work.\nIt wasn’t who he was.\nHe was the friend of despair.\nThe student of despair.\nThe son of despair.\nThe lover of despair.\nHe was Mikhail Hendrix, One Who Withstands Despair.\n________________",
      "scraped_at": "2025-11-21T13:54:37.157488",
      "content_scraped_at": "2025-11-21T13:54:37.735892",
      "error": null
    },
    {
      "id": "29",
      "number": "29",
      "title": "Chapter 29: The Secret Behind Mikhail",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/29/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 29: The Secret Behind Mikhail\n\"Insane.\"\nIt was the old word that left Emily’s mouth as she saw the screen before her.\nShe couldn’t understand what just happened.\nIt all changed so fast.\nInitially, if she had to be honest, she was kind of disappointed at the progress of Mikhail.\nThe score was increasing as steadily as ever but he had already started to show signs of struggle early on.\nAt 40, he was struggling quite much against the spirits.\nDespite increasing the difficulty a little, the scale to measure his mental endurance was still the same.\nSo it made no sense to her what was happening.\nAt 52, Mikhail was almost going to collapse on the ground or dive out of the circle.\nThe sweaty and breathless expression on his face showed that he was almost done.\nAnd yet, the score was nothing more than an average cadet.\nEven with using all of her brains, Emily found it hard to find the problem in him.\nHis bodycheck before the test showed that there were no medical conditions that affected him.\nSo then why?\nTo prevent any further hardship for their future prospect, she was almost going to shut down the test when something unexpected happened.\nThe score that was increasing suddenly turned stagnant.\nIt stopped at 53.\nAt the same time, anger and self-hate came on Mikhail’s expression for the first time in Emily’s life.\nThe black-haired boy was an intriguing person to him, even outside the tests.\nHe barely showed any expression and when he did, it wasn’t much.\nSo this was the first time seeing such an intense emotion on his face.\nShe was startled when she saw him gritting his teeth and banging his fist on the ground.\nEmily was convinced that this might be where he would finally give up.\nNot just her but the whole lab.\nBut all their expectations were broken when his expression went back to as it was.\nNo. It wasn’t anything like before.\nThere were no signs of even a frown on his face. It was perfectly calm.\nRather, a deadly calm.\nBut the real shock hit them when suddenly, the mental endurance counter shot up at a breakneck speed.\n53..\n56..\n60..\nEmily stared wide-eyed at the monitor, not understanding what was going on.\n64..\nHer shocked eyes went to the monitor where Mikhail was seated.\nAnd his expression...\nIt was calm as ever.\nA collective intake of breath echoed in the room as all of them tried to grasp what was happening.\nMikhail’s heartbeat went back to normal. His blood pressure lowered back down.\nEverything that showed signs of warning went back to their normal signs.\nAnd yet, the mental endurance counter...\n70..\nAnd it broke his previous record.\nUnable to let out a sound much less a word, Emily’s trembling eyes went to the monitor.\nWhere Mikhail was seated.\nAnd his expression..\nIt was still calm.\nBut there was something else there now...\nDrip. Drip. Drip.\nEmily’s eyes widened and she rushed out of the lab room, towards the test room screaming,\n\"ABORT THE TEST, NOW!\"\n***\nAll of a sudden, the resistance he felt vanished.\nThe pain and struggle he felt vanished.\nMikhail felt at peace. True peace for the first time he came into the world.\nIt was as if he could feel nothing. No true emotion. Fear, pain, surprise, it was all gone.\nNo. It was wrong.\nHe could still feel them but...\nMikhail found them to have no effect on him.\nThey felt nothing more than a tickle or a mere fleeting feeling.\nNo matter what the spirits tried, his mind was at a perfect calm.\nHowever, he felt the tickle turn into pinches soon enough.\nIt was getting more effective now.\nInstead of continuing the trial though, everything suddenly disappeared before Mikhail.\nDarkness returned and he felt his body warp back to what it was before, making him aware that the test had ended.\nSlowly opening his eyes, he was assaulted by the bright light of the room.\nAdjusting, he was surprised when he saw Emily in front of him, her eyes wide from shock.\n’Hmm?’\nHe chose to quickly ask the question that was plaguing his mind.\n\"Why did you end the test?\"\nThere was no frustration in his voice. And neither his face or eyes.\nNot even anger or any other emotion, just plain curiosity.\nAt his words, Emily startled awake as if she was out of it before.\nMikhail saw her eyes avert from his gaze, confusing him on what happened.\n\"Y-yes, the test is cancelled.\" He heard her stutter.\n\"Why?\" He asked back.\nMikhail saw her raise a finger and point towards his face, confusing him again.\n’Huh?’\n\"Y-your face.\"\n’What abou-’\nIt was then that realization hit him and he started to feel it.\nThe taste of iron, in his mouth.\nDrip. Drip. Drip.\nAnd the sound of something dripping became clear to his ears.\nHe quickly touched his mouth and the edges, feeling his bandages become wet.\nRetracting his hand, he looked at it.\nCrimson Red. Blood.\n\"Quickly head to the infirmary and treat this. How did you not notice?\" Emily ordered him, turning to leave.\nShe was still not looking at him.\nIt was true, how did he not feel the blood while talking?\nQuickly standing up, Mikhail started to head towards the door, leaving for the infirmary.\nHe didn’t bother to ask Emily why she was avoiding him. He was still out of it.\n***\nAs Mikhail left the room, Emily was finally able to heave a sigh of relief.\nNot just one, but multiple gasps.\nIt was as if her throat had just been released from a chokehold, making her able to finally breathe.\n\"W-What the hell was that?\" Her shocked voice still stuttered.\nThe moment she entered the room, Emily was surrounded by a thick energy of bloodlust.\nShe was a Herald, and despite all that, it was as if death was lurking right by her side.\nIt was thick and heavy, making her heart heavy.\nDespite not being the fighter type, she was able to handle energies like bloodlust quite well.\nThey were normal reactions from her target subjects.\nBut this one, no. It was as if it was the same but at the same time completely different.\nIf others said, I want to kill you, this one said, I’m going to kill you.\nAnd the origin of this bloodlust?\nThe 20-year old black-haired boy sitting in the middle of the room, his expression as calm as ever.\nThe moment he opened his eyes, and those blue-crimson tinted eyes stared into her, she felt the bloodlust increase multiple folds.\nEmily felt if she stared into it for a minute, breathing would become an impossible task for her.\nThat’s how heavy it was. And yet, even with all this, she couldn’t understand the reasoning behind it.\nWhat did a 20-year old boy have to do to have this much bloodlust?\nThis wasn’t just a criminal-level intent. It was a pure demonic intent.\nOne that she should have immediately reported to the authorities upon seeing it.\nBut she didn’t. She didn’t want to lose Mikhail.\nHe was too valuable. Too perfect for her. He was a once-in-a-lifetime opportunity.\nAnd this phenomenon only served to increase her curiosity.\nOr maybe, if she had to be honest, it was something else.\nA fear at the back of her mind that reporting wouldn’t do good to her.\nThose crimson-tinted eyes dared her to try and report and unfortunately, she didn’t have the courage to do so.\n’I can’t lose him, he’s way too important for me.’\nEmily licked her lips.\nThe boy had just turned all the more interesting for her. All the more close.\nBut what still left her shocked was his final score.\nShe turned to stare at the hidden monitors in the walls, speaking to them.\n\"What was the boy’s final score?\"\n***\n\"Oh, I forgot to ask for my final score.\" Mikhail realized as he sat on the infirmary bed.\n’Whatever, I’ll just ask later.’\n***\n\"8-84 Ma’am.\" The reporter struggled.\nThat was the mental endurance of an expert Monarch and yet, a 20-year old undertrained cadet had just achieved this record.\n______________",
      "scraped_at": "2025-11-21T13:54:38.743572",
      "content_scraped_at": "2025-11-21T13:54:39.324706",
      "error": null
    },
    {
      "id": "30",
      "number": "30",
      "title": "Chapter 30: Julian Perez",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/30/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 30: Julian Perez\nSitting in the infirmary, Mikhail drank a glass of water.\nHe was about to be discharged after being stuck in bed for an hour.\nThe nurse informed him that he had overloaded his cerebral mana veins.\nIt was fortunate that Emily had stopped the test or it could be much worse.\n\"You are fine now so you can go. Though, I heard it was your first test. Stop pushing yourself too hard or you’ll end up a cripple.\" The doctor lectured him.\nMikhail nodded, paying half-hearted attention to his words.\n\"I’ll try.\" He shook the hand of the doctor, before turning to leave.\n\"With the condition you are in, you will kill yourself in the near future.\"\n\"Okay.\"\nMikhail walked out of the infirmary.\nTowards his next test.\n***\nMikhail entered the elemental grounds, finding them already crowded.\nIn the distance, he could see the signs of different elements to guide the incoming participants.\nLooking around, he could still find some signs of the previous battles.\nBroken trees and claw marks on the ground.\nIt was definitely a fierce battle here and it made sense.\nElemental grounds were different from physical or drill grounds.\nThey had a higher density of mana particles in the surroundings through artificial sources.\nIt was still weaker than a place with natural density but it worked.\nThe academy used spirit magic and other artifacts to perform this phenomenon.\nStaring ahead, Mikhail saw the elemental tests already underway.\nAnd the one that caught his eye instantly...\nWas the brown-haired easily outperforming everyone in the Cindralis section.\nThe way his crimson eyes instantly reacted to the miniscule movement of the figures.\nAnd how his hands instantly weaved the spell to act, it was masterful.\nThe eye-body coordination was almost perfect.\nTo the point that the people near him didn’t even bother to try, already accepting their outcome.\nThat boy was Oscar.\n’He’s as good as ever.’\nA light smile came on Mikhail’s lips, feeling a sense of pride in him.\nEarly on in his childhood, he was the first one to notice how much of a talent Oscar had in Elemental Magic.\nPossessing Cindralis himself, he was the first person to teach him on the uses of the element.\nIt was funny how quickly he surpassed him in this aspect. Terrifying.\nBut Mikhail didn’t feel the slightest jealousy over it. Oscar was family to him.\nThe more he advanced, he would only be happy for him.\nAs if hearing his thoughts, he was startled when Oscar’s eyes suddenly snapped toward him in the distance.\nHis crimson eyes locked with his sapphire ones and a wide cheerful smile spread on his tired face.\nHe waved his hand in full force at him in the distance, ignoring his test.\nReciprocating the gesture, Mikhail gave him a light smile and waved his hand before giving a thumbs up.\nIt expressed his satisfaction over his performance.\nAnd that was all that Oscar needed.\nMikhail immediately saw his spirits rise up by a mile as he turned back to blitz through the test.\nBesides him, he could see some boys staring admiringly with their mouths open at him.\nAnd some staring at him with jealousy and rage.\nMikhail didn’t care though.\nHe was certainly protective of the boy, more than one would think.\nHis family was one of the things that could make him truly flip a switch.\nBut he never had to interfere, the men by themselves were enough to handle them.\nLeaving Oscar to complete his test, he turned to his respective element.\nNorvalis.\nHe saw the respective emblem of the element hanging in the distance, with the tests already underway.\nUnlike Cindralis, there weren’t many people in Norvalis.\nIt wasn’t even Norvalis.\nIt was well known that the chance of awakening a Non-Materialistic element was much rarer than a Materialistic element.\nIn terms of power and strength, Non-Materialistic elements definitely lacked against the vice versa early on.\nThey were harder to control and lacked versatility in spells early on.\nHowever both of them would be fixed with due time where the Materialistic elements would turn weaker.\nOf course, if you never had much of a talent in any Non-Materialistic elements then you were done for.\nStepping forward, Mikhail walked over to the Norvalis section where he saw a gruff instructor overseeing the tests.\nHe seemed to be in his mid-30s, with a rough beard and wide stature.\nHis facial features displayed a rough persona, with a scar on his cheek and grey hair.\nThere were dark eye bags under his eyes, a well known side effect of overuse of Non-mat elements.\nThey placed too much stress on the caster, a reason why Mikhail opted to use it less even with all his talent.\n\"67, Next.\" The instructor’s deep voice came over the students.\nElemental Tests were graded in the same way as Mental Examinations.\nFrom 1 to 100.\nThere were a total of 10 exercises where in each exercise, 5 points were given for completion and 5 for the time in which you completed it.\nThe cadet who just went by had scored a total of 67 marks.\nMikhail was about to raise his hand when someone intervened.\n\"I’ll go ahead.\"\nHe heard a familiar voice from beside him, graceful and polite.\nTurning, he saw him.\nIt didn’t take him more than a moment to recognize him, just like every other cadet in the area.\nJulian Perez, the commander for the 14th Squadron.\nOne of the famous men around the camp.\nThe Norvalis Prodigy, known for his exceptional control and power over the element.\nThere was no one in the camp that could match his skill level, or so it was said.\nAs their eyes met, an expression of shock came over Julian before he quickly masked it with politeness.\n\"Oh, Mika, I didn’t notice you were here. Please go ahead by all means.\"\nHe gestured forward.\nYes, Mika.\nMikhail already had quite a history with him.\nAnd it was safe to say that it wasn’t good by any means. But it wasn’t bad either.\nAlmost like a rival friend/enemy relationship.\n\"No, it’s fine. You raised your hand first, I’ll wait. You can go ahead,\" Mikhail said without changing expression.\nHis words caused a playful smile to spread on his lips as he leaned closer, his eyes peering into him.\n\"Come on, you don’t have to act like we’re strangers.\"\nMikhail showed no reaction, almost making Julian click her tongue.\nBut he seemed to resist and lean even further into his ears.\n\"I’ll deal with you later, show-off.\" His tone completely changed.\nTaking a step back, he turned.\n\"Now then, who am I to refuse if a gentleman like you allows me to go first.\"\nIgnoring the glares at him from his followers, Mikhail focused on him as he stepped forward.\nIt had been 2 years since they last competed against each other.\nHe would be lying if he said he didn’t want to see how far he had come from that day.\n_________________",
      "scraped_at": "2025-11-21T13:54:40.335420",
      "content_scraped_at": "2025-11-21T13:54:40.921480",
      "error": null
    },
    {
      "id": "31",
      "number": "31",
      "title": "Chapter 31: Their Past",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/31/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 31: Their Past\nThree wispy black claws tore through the wooden moving structures with dot-accurate precision.\n\"That’s it.\" Mikhail heard the instructor announce.\nAt the same instant, the claws vanished and the responsible figure for them in front of Mikhail, relaxed.\nHe’d underestimated the black-haired boy.\nJulian, in fact, had gotten much more powerful from the last time they completed.\nAnd that was shown through his scores.\n\"79, next.\"\nFrom a score of 62 2 years back to 79 now. A shocking improvement.\nOne that definitely wouldn’t be possible without hard work or artifacts and other illegal methods.\nBut since the latter ones weren’t available, there was only one plausible method.\nAnd Mikhail could see the answer from his proud and happy expression as he turned to walk up to him.\n\"Did you see that!?\" Hee asked, unable to hide his excitement.\nMikhail nodded.\n\"I did. Congratulations.\"\nJulian smiled happily, a rare contrast to his usual attitude that he showed everyone.\n\"I know right-\"\nNot to let his true persona slip out, Mikhail was quick to help him by putting a hand on his shoulder.\n\"We are in public.\"\nThe few words were enough to startle Julian out of his self-joyment.\nLooking around, he realized where he was and a bright red came over his face..\n\"I-\"\nMikhail resisted a sigh.\n’Whatever.’\nTo divert the attention from him, Mikhail quickly raised his hand.\n\"I’ll go next.\"\nThe instructor in the distance, looked over at him, his eyes trying to assess him.\nA second later, the man nodded.\nThe words from Mikhail were not only enough to shift the attention towards him, but it also helped Julian compose himself.\nCuriosity overtook his embarrassment as his eyes turned to Mikhail, who was now walking up ahead.\nIt was the only reason he even chose to be even here after the test.\nTo see how far Mikhail had progressed as well.\n***\nMikhail Hendrix.\nThat was his name.\nIt was a name that had always intrigued Julian.\nA mysterious cadet, rumored to have the same rank as him in Norvalis.\nThe element in which he was hailed as a prodigy.\nJust the idea of someone even being able to rival him in his strongest field disgusted the young prideful Julian at the time.\nFor him, he was the best.\nThere could be no competition. There could be no person who’d even dare to take the throne from him.\nBut deep inside, even he was intrigued to see the boy who was rumored to be as strong as him.\nWhen he saw him for the first time in person, he found him to be even more interesting than he expected.\nNot just the powers but as a normal guy as well.\nThe young boy of 18 rarely showed expression on his face, even with his taunts or challenges.\nUnlike him, he seemed to have no intention to challenge him back or beat him.\nHe didn’t even seem to enjoy showing off his power, opting to just be with his squadron.\nJulian found him unique.\nHis behavior was unlike other boys of his age, having no interest in games or fun.\nRather, he seemed to always be practicing or training.\nUnfortunately for the black-haired boy, even with all his tries to avoid a match, they eventually ended up in a match-up.\nWhen they met that day on the ground, Julian could still vividly remember the scene of the battle.\nHe was crushed, his pride destroyed.\nBrutally.\nUtterly.\nHe’d heavily underestimated the boy. The difference between their final scores was shocking.\n62 to 69.\nA whole difference of 7 points between two people in which he was said to be the stronger one.\nA whole difference of 7 points. Julian still knew the whirlwind of emotions he felt back then.\nHe felt embarrassment, shame and frustration over his loss.\nAdditionally, knowing that the boy would now rub his loss over his face worsened it.\nBut once again, the boy proved him wrong by giving the match no thought.\nIn fact, he gave his hand to him on the ground, pulling him up and commending him with a \"Good job.\"\nThere was no emotion on his face while saying so but for some reason Julian knew he genuinely meant it.\nThe praise hit him differently, a reaction one would not give someone on their loss.\nIt was there that he realized how different Mikhail was from others. The boy was special in the sense of both power and mentality.\nWhich was why, in a move of surprise, he asked Mikhail to be his teacher rather than his rival.\nHe wanted him to teach him, despite being the same age.\nJulian had learned to set differences and pride aside for improvement.\nEven going as far as to request a squadron transfer.\nUnfortunately for him, he was denied in both his requests by Mikhail himself.\nThe boy refused to teach him, telling that he had to improve and figure out his element himself.\nIt was his part, not Mikhail’s.\nHe was also disgusted at the fact that he would leave his whole squadron just to join him.\nJulian could remember that it was the first time he saw an emotion on his face.\nThe refusal hit him a little badly. He did not expect it to go this way.\nBut he was able to take it better when Mikhail offered him a few pieces of advice.\nHowever, the biggest problem for him started after that.\nFrom the point of their friendship where he called him his nickname casually, it suddenly went to a point where Mikhail cut off all contact.\nHe refused to meet him or even look him in the eye when they were close.\nWhen he called him, he didn’t respond as if he wasn’t able to listen to him.\nHe had completely cut him off, as if they were two unknown strangers to each other.\nThe stranger treatment hit him hard, breaking his spirit. He didn’t know what he had done to him for this.\nHis squadmates gave him no reaction as well.\nIt was a difficult time for Julian. One in which he then turned to hate Mikhail.\nThe anger within him caused him to despise him for what he did to him.\nAnd there was only a single way to fuel his anger, by getting stronger and demolishing him the next time they were to battle.\nFast forward 2 years, Julian turned into not just the self-proclaimed strongest Norvalis Magus among the men but also one of the strongest men available.\nIn the Massacre Of the Gates, he had been given the charge of a whole group after arriving from another castle.\nIt was where he noticed Mikhail for the first time again after 2 years.\nJulian wasn’t even sure if he hated him at this point. At one point in his quest to become stronger, he had forgotten about him.\nHis true purpose was to get stronger.\nBut after seeing his performance in the incident, it sparked that fire in him to battle him again.\nWhich was why the moment he saw him in today’s elemental tests, he knew it was the perfect chance for him.\nTo truly show him how much he had improved. To thoroughly crush him in the test, making him realize his mistake 2 years ago.\nWith a score of 77, Julian was very satisfied that he wasn’t going to be beaten.\nHe didn’t see him using Norvalis Essentia much so hhe knew that he had been slacking off on it for these 2 years.\nIt would be close.\nBut he would inevitably win.\nStaring ahead at his back that got ready to fight, Julian knew it was finally time.\nTime for him to get his win over him.\n_______________",
      "scraped_at": "2025-11-21T13:54:41.930118",
      "content_scraped_at": "2025-11-21T13:54:42.508977",
      "error": null
    },
    {
      "id": "32",
      "number": "32",
      "title": "Chapter 32: Mikhail’s Turn",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/32/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 32: Mikhail’s Turn\nMikhail stood ready at the starting point for the test.\nTurning to the instructor, he looked him in the eyes, nodding to indicate he was done.\nThe instructor nodded.\n\"We will begin now.\"\nHe gestured forward to the empty space in front of Mikhail.\n\"The first test is simple. I’ll tell you some shapes and the faster you mold your spell to that, the more points you get.\"\nMikhail nodded, already knowing the process.\n\"Okay. In 3, 2, 1..\"\nThe black-haired boy focused on his front.\n\"Begin. Solid Circle.\"\nMikhail wasted no time, raising up his spell diagram.\nThere was no pre-spell for simple spell shapes so one had to form them by themselves.\n\"Norvalis.\" He spoke.\nThe use of Dragma for this challenge wasn’t allowed so he couldn’t use signs.\nNot like he would reveal his card for a petty challenge anyways.\nAs he spoke, the first node on the spell circuit lit up like a black wispy marble.\nThe young man quickly moved to the next node.\n\"Solivex.\"\nThe second category that came after elements in a spell structure.\nIts state.\nAnd as said by the instructor, Mikhail chose Solivex, the runic name for Solid.\nThe second node lit up instantly and the spell segment that connected the first node with it also shone in a black glow.\nMikhail heard a multitude of gasps escape from behind at how seamlessly he transitioned.\nHe even felt the instructor looking at him impressively.\nWhen forming a spell, there were several other factors that came into play.\nThese factors played a minor but important role in how the spell would turn out.\nAs an example, the first was mana input.\nOverloading or underloading a node with mana could cause the whole harmony between the spell to break.\nThe mana resonance frequency between all the nodes had to be the same so the structure would hold up.\nAny minor mistake and the spell could go into a failure and blast in the caster’s face.\nIt was one of the reasons why maguses often opted for pre-spells.\nSpells took time and focus to be casted and a moment of distraction could cause their whole node structure to break.\nA perfect input of mana into the nodes and a stable resonance frequency would allow seamless and faster connection of the nodes.\nJust like how Mikhail did, adjusting his mana input to the perfect frequency for the spell.\nIt was the same tactic he used in the fight against Silent Pact.\nAs a Warden, Mikhail only had access to a 3-nodular spell framework.\nAs you advanced through the ranks, the number of nodes you could add would increase, allowing you to adjust further aspects of the spell.\nResulting in more complex and powerful spells.\nIt was both risky and advantageous.\nA lot of tweaking could again, cause a spell-malfunction as well.\nBeing a certain rank didn’t mean he was restricted to only 3 nodes.\nHe could definitely add more. However, 8 times out of 10, he would be unable to tune the spell.\nAnd even if he could cast it, he would definitely lose control of it.\nSo he wasn’t going to take the chances.\nTurning back his attention to the spell, he moved to the third node.\nTaking care to take care of all the factors, he completed the spell with the third node.\n\"Circora.\"\nRunic name for Circle.\n\"Norvalic Circorium.\"\nAnd sure enough, the moment he said it, the third node lit up and connected with all the nodes.\nAs the spell was completed, the diagram disappeared and a solid black circle formed in front of him.\nNo more than 4 seconds.\nA collective gasp was let out in the air from behind him and even the instructor was surprised at his speed for a second.\nComposing himself, he nodded with satisfaction and moved forward.\n\"Fluid Square.\"\n\"Norvalic Squalius.\"\n\"Gas Triangle.\"\n\"Norvalic Gossius.\"\nAnd there on, it continued back and forth.\nMikhail performed the said task in literal seconds, not even taking time to understand or tweak the spell structure.\nIt was muscle memory for him. All the variable values in the nodular structure.\nAfter a minute long back and forth, the instructor finally realized he had to move on.\nHe had gotten too immersed in the test with Mikhail.\nEveryone could see how intrigued and impressed he was with the black-haired boy.\nCoughing, the old man quickly moved on to the next test.\nThe second test was an extension of the first one.\nHe had to form a spell and move it to any desired spot the instructor told him to.\nIt was to show he had control over his spells.\nThere was no problem for Mikhail though. This was all child’s play to him.\n\"It should land here.\" The man pointed to a spot.\nNodding, Mikhail immediately formed a large black circle, sending it flying to the desired spot.\nA second later, it crashed perfectly on the target.\nEven for the aim, speed and precision of the spell, the caster had to tweak the aspects of the spell so they wouldn’t override each other.\nSpell Physics was a major subject taught in everyone’s courses.\nMikhail had it on his fingertips. There was no need to think about it in his mind.\nWhen forming a spell, his mind automatically adjusted all the values accordingly in his mind.\nIt was like a machine, showing how used he was to it after years of experience.\nThe tests continued like water, Mikhail breezing through them one after another.\nHe wasn’t perfect as his completion was still delayed in some tasks.\nBut it was still the best the instructor had seen till far.\nAfter 5 tests of control, precision, aim, durability, the instructor moved to attack tests.\nMultiple earthen structures were raised in front of him by the support staff.\nWith the instruction to break them, Mikhail quickly made short work of them.\nHe didn’t have the [Monarch] rank in Norvalis for nothing.\nAs the tests continued, the instructor posed several restrictions on him for the tests.\nHe had to adopt various paths and sometimes even destroy them all in a specific order.\nIt required a little more focus and input from Mikhail but overall, it didn’t pose much of a problem for him.\nAt this point, the whole crowd behind him had turned silent, even tired of gasping.\nThey got used to Mikhail just demolishing the task in a minute or less.\nIt was the same for the instructor who uttered one exercise after another.\nFinally, after a mind-boggling performance of 8 minutes, Mikhail was finally done.\nBOOM! BOOM!\nWhere Julian previously used claws to destroy the structures, his bullets ruptured a clean hole in their heads.\n\"That’s it.\" The instructor said, indicating the end.\nMikhail relaxed, wiping the sweat from his face as he finally relaxed.\nThe fact that was gasping slightly after all that showed that he wasn’t all that strong.\nBut he was definitely a monster.\nMikhail turned to the instructor, waiting for him to announce his results.\nLooking at the sheet in his hand, the instructor raised his brows.\n\"Impressive. You tore through them like a breeze.\"\nMikhail nodded, accepting the compliment.\n\"Thank you.\"\nThe instructor nodded, before finally moving to his score.\n__________________",
      "scraped_at": "2025-11-21T13:54:43.510387",
      "content_scraped_at": "2025-11-21T13:54:44.124339",
      "error": null
    },
    {
      "id": "33",
      "number": "33",
      "title": "Chapter 33: Oscar’s Surprise",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/33/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 33: Oscar’s Surprise\nMikhail walked out of the Norvalis Area after hearing his score.\nA mind-blowing number of 81, allowing him to top everyone else in the test.\n’1 category confirmed. Spellcasting and One-On-One Spars left.’\nOut of the three he had chosen, he had 2 left now.\nIn the other 2 where it was normal for him to top at 1st, he was quite sure that he had clutched Mental Examinations again.\nDespite it going a little unusual, Mikhail had a hunch that it went better than usual.\nPhysical Tests wouldn’t be a problem. It was the category he was most sure about.\nCurrently, he was heading over to his Spellcasting Tests.\nIt would be his last test for the day and he would do the last 2 categories tomorrow.\nSpellcasting Tests were simple.\nThey were basically the same as Elemental Tests, but they focused more on the backend rather than the frontend of the spell.\nThe backend of the spell was the part where you formed and adjusted the spell and how you would release it.\nThe backend was known to be a more important and complex study than the frontend.\nIf one could master the factors involved in the backend, the overall strength of the spell could even advance a rank.\nThese minor factors could largely contribute to the result of a battle.\nSince Spellcasting Tests weren’t all that different from Elemental Tests, they were held in the same ground.\nBoth of them required the use of mana so that was another factor.\nAs he was walking through the grounds, he heard a familiar call from behind.\n\"Mika.\"\nFollowed by a tap on his shoulder to indicate their presence.\nTurning over, he saw Oscar arrive right beside him, done with his tests.\nThere was a bright smile of pride on his face, already indicating his results.\nNot like he expected anything less from him.\nHe was a beast in Cindralis Magic.\n\"Oh hey, finally done with your tests?\" He fell into step alongside him, allowing him to join him.\nThe brown-haired boy gave him a cheerful nod, his attitude as fiery as his element.\n\"Yup, it was a total breeze.\"\nMikhail smiled lightly before complimenting him.\n\"Good job.\"\nHe saw his expression freeze from surprise but then morph into a satisfied smile a second later.\nIt was apparent that a compliment from Mikhail was all he needed.\nAs they walked together, it was Oscar who spoke now.\n\"What about you Mika? How did your tests go?\"\nIt showed on his face that he had been dying to ask this question.\nOscar or Icarus weren’t good at hiding their thoughts or intentions.\nThe twin brothers, Yvan and Modric were much better in these aspects.\nMikhail could understand why he hesitated to ask about it.\nHis whole squadron knew that he never performed to his full power in the tests.\nMikhail never had any intention or interest in doing so which was why he never topped these tests.\nOscar wanted to ask about his score, but didn’t want it to come across as a rude gesture that he was flexing his position.\nMikhail didn’t really care about it if he had to be honest, but he understood where she was coming from.\nHe would tell them even if he didn’t perform well, because he never tried clearing on top in the first place.\nHowever, this time, it was an entirely different case.\n\"I got a score of 81,\" he told him.\nAn inquisitive look came on Oscar’s face as he tried to think on what to say.\n’He doesn’t understand how good 81 is in Non-Mat elements.’\nAs Mikhail said before, Non-Mat elements were hard to control and weak at first.\nSo as compared to Mat-elements, their high score ranges were usually less.\nWhich was why it was a problem for Oscar.\nHe lightly tapped him on the back of his head.\n\"It’s the top score in my element. I won.\"\nThe words caused Oscar to freeze for a moment, as if he was trying to make sure he heard right.\nHis shocked crimson eyes locked with his blue ones, the thought causing him to freeze in his place.\n\"Wait wait, you won? Like like, you got first place in your category?\"\nHis expression seemed to wonder if he was standing before the wrong Mika.\nHowever, the nod of confirmation from Mikhail sent a punch of air through Oscar.\nA second later, his expression was replaced by an otherworldly happiness for him.\n\"That’s great Mika!\"\nMikhail felt some weird stares from the people beside him and he tried to calm Oscar down.\nUnfortunately, it would take him a good 20 minutes to do so.\nThe cheerful guy was just more happier for his scores than his own ones at this point.\n***\nA stressful 25 minutes later, the duo arrived at the Spellcasting grounds.\nOscar didn’t pick this category up but he still followed Mikhail to see him perform.\nWith his talent in Cindralis, one would think that Oscar could perform exceptionally good here as well.\nBut surprisingly, that wasn’t the case.\nAnd the reason for it was the furthest thing from what one would expect.\nIt was because Oscar didn’t think about spell factors or their values.\nHis body or his mind just calculated and set them on instinct.\nThe surprising part was that his instinct was so terrifyingly good that the spell would never break.\nIt would remain in perfect harmony.\nOf course not everyone could do it. His Dragma also played a significant role in this.\n\"You can spectate from here, I’ll go ahead now,\" Mikhail informed him.\nOscar nodded.\n\"Okay. I’ll be watching you from here. Good luck.\" He apped him on the back.\nGiving him a thumbs up, the young squadron commander went on ahead.\nHe saw that the tests had started for this category already as well.\nThere were already some candidates giving their tests up ahead.\nEven though the use of Dragmas wasn’t allowed, Mikhail could get past the restriction with an Oath.\nHowever, he didn’t see the need to use both.\nInstead, he planned to just breeze through the category with his natural ability.\n\"Alright.\"\n’Let’s do this.’\n_____________\nA/N: I’ll be skipping the spellcasting tests because they are more or less the same as shown in the elemental tests.\nI don’t want to dump too much information about the spells right now.",
      "scraped_at": "2025-11-21T13:54:45.135712",
      "content_scraped_at": "2025-11-21T13:54:45.712613",
      "error": null
    },
    {
      "id": "34",
      "number": "34",
      "title": "Chapter 34: Cadet’s Dilemma",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/34/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 34: Cadet’s Dilemma\nMikhail let out a tired sigh as he walked out of the Spellcasting arena,\nHe was trying to ignore the shocked stares behind his back.\nIt was something he was going to need to get used to when doing this quest.\nEven Oscar, who knew him better than anyone, was standing in front of him speechless.\nTurning around, he saw the top 3 scores of the test written on the wooden board.\nThe second highest score was by a cadet named Clark Larrabee.\nAnd that score was 74.\nBut then, his eyes went to the top scorer.\nMikhail Hendrix with a mind-breaking score of 86.\nSpellcasting was a difficult field, especially early on.\nThe physics and mechanics behind it were known to break even the toughest and most intellectual of minds.\nIt was the reason not many picked it up as well.\nJust scoring 80 or above 75 would place you as a genius cadet in the field.\nBut scoring above 80 in the early ranks? Unheard of.\nAnd that was what Mikhail ended up doing.\nIt wouldn’t have been much of a surprise if he was doing it continuously.\nNo, everyone could swear that he used to score between 65 to 70 before.\nSo how did this big leap occur?\nThat was what the Spellcasting teacher, Morgan Quagmire, tried to ask Mikhail.\nOnly to be rejected politely that he was tired for the day and he would answer him some other time.\nIt wasn’t even a lie.\n3 tests continuously had placed a high mental toll on him, making his head hurt.\nWalking up to Oscar, he saw that the brown-haired boy was now more worried about his condition than what he did.\n\"Are you okay Mika?\"\nMikhail tried to force a proper look on his face.\n\"Yeah, I am. Just a little tired.\"\nOscar nodded.\n\"Then let’s go back home.\"\nMikhail nodded, letting Oscar lead the path.\nBut as he was being led, he saw an unnecessary amount of stares being directed his way.\nBefore he could say something, Oscar was quick to point out the reason.\n\"You have gained too much spotlight with these tests.\"\nHe turned back, his crimson eyes interlocking with him.\n\"You are in their eyes now Mika. They finally recognize you for what you are.\"\nFor a moment, Mikhail could have sworn he saw a hint of sadness and inquisitiveness in his eyes.\nBut the next moment, Oscar had already turned and started leading him again.\nNow, staring at the silent stares directed at him while he walked under the orange sky, Mikhail finally understood.\nWhat the quest’s purpose actually was with this.\n***\n[The Next Day]\nMikhail came out of his tent at the slightest sight of dawn.\nAfter an early jump to bed last night, he was feeling perfectly refreshed.\nHe would usually wake up his squadmates whenever he’d wake up but this time he chose to not do so.\nThey had a tiring day yesterday so they deserved to rest.\nEspecially for today’s tests as well.\nAfter hearing about their performances, Mikhail was well satisfied with them.\nThe only time they ever placed under were if they competed against strong squadron leaders.\nOtherwise, they mostly dominated the charts.\nWhether it was Track Race or Alchemy tests.\nGeared up after a shower, Mikhail started to head towards the physical grounds.\nPhysical Tests were held early on in the day to get a good measurement of everyone.\nWhere the air was fresh and everyone was on an empty stomach.\nReporting at the physical grounds, Mikhail found quite many people already there.\nFocusing on the main motive, he walked to a safe spot in the ground and started doing his warmups.\nHe could feel a multitude of stares cast his way.\nNot just because people were familiar with his record in the Physical Tests but also because of yesterday.\nFrom what he heard from Modric, the name Mikhail Hendrix was a famous topic in the academy now.\nMikhail couldn’t care less about how it affected him anyway.\nAs he stood there doing warmups, Mikhail saw a familiar face enter the ground after a long while.\nVlahovic.\nDespite the signs of tiredness and aging on his face from the battle, his energy was as strong as ever.\nTo the point that a single step from him in the ground was enough to alert everyone.\nSilence fell through the whole ground at his appearance after a long while.\nUnlike the last time, even if someone wanted to this time, nobody dared to object or question him about the incident.\nNo one could.\nThat’s how much people were terrified of this man.\n\"It’s been a while.\" His raspy hoarse voice echoed in the ground.\nPeople could see how weak he had gotten from the battle.\nYet, for some reason, they felt as if his will didn’t waver at all.\nAnd the curving of his lips into a sinister smile was all that they needed for confirmation.\nThat smile on his lips. It was infamous among every Physical Test candidate.\nThey called it the Smile of Doom.\nBecause if Vlahovic, the head of Physical Training, was to smile like this,\nEvery cadet knew hell was about to come.\nAnd that’s exactly what it was.\nMost of the tests followed the same structure of 100 Marks, like with Elemental and Spellcasting Tests.\nAnd unsurprisingly enough, it was the same for Physical Tests.\nOnly that the 10 Tests carried out in Physical Tests were to vary instructor by instructor.\nThey could give you anything as long as it was related to your physical fitness.\nA reason why not many people liked to pick this test up.\nEspecially not with Vlahovic as the head instructor on it.\nAs if to illustrate the despair every cadet was feeling in their heart, he pointed to a spot in the distance.\nFollowing his cane, Mikhail’s eyes landed on a large pile of rucksacks and weapons by some trees.\n\"You each will take a rucksack and carry two weapons on your back.\" Vlahovic ordered, sending a horrifying chill down the cadet’s spine.\nBut his next words were what sent the nail down their coffins.\n\"Carrying at least 140 kilos on your back, you will climb the mountain behind your back and come back,\" he smiled deviously.\nNo wonder he was so infamous for his smile.",
      "scraped_at": "2025-11-21T13:54:46.727931",
      "content_scraped_at": "2025-11-21T13:54:47.302743",
      "error": null
    },
    {
      "id": "35",
      "number": "35",
      "title": "Chapter 35: Mountain Race",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/35/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 35: Mountain Race\nMikhail gazed around him, observing the participants.\nAnd he was disappointed, if he had to be honest.\nIt had not even been 10 minutes since they started the test.\nAnd yet, he could already see multiple tired faces around him.\nWhile it was true that they couldn’t be blamed for a sudden rise in the weight from 70 to 120 this time, it was still a disappointment.\nThey were men of the hold.\nThey had to be used to unexpected situations.\nAnd 120 wasn’t even all that much, at least not for Mikhail.\nEven with all the weight on his back and the sharp incline of the hill, he had yet to break a sweat.\nHe was feeling as perfect as ever.\nAmong the 150 to 200 men that were running right now, he wasn’t that far behind.\nAlmost between the 120 to 140 mark.\nHe had intentionally not chosen to break forth to the top right from the start.\nThis was his usual strategy every time to crack the competition.\nBy staying behind first, it saved both his stamina and gave him time to assess the traps ahead.\nThe ones at front acted like dummies to test most of the traps anyways.\nUnfortunately, Dragma and offensive use of magic wasn’t allowed.\nMikhail didn’t even dare to find a loophole since he knew the overseer was Vlahovic this time.\nThat guy’s awareness was on another level.\nMoreover, he didn’t feel the need for his Dragma as well.\nMagic use was allowed for evasion of traps and pre-spells were enough for this.\nFocusing upward, Mikhail now started to increase his pace.\nHe saw people staring at him with wide expressions at how calm he was even with all the weight.\nMost of them didn’t bat an eye though, they were already used to Mikhail.\nThey already knew what kind of monster he was.\nIn fact, when discussions were carried out for the results of Physical tests, the positions to be debated were always counted from second.\nThere was never a discussion or debate for the first position.\nBecause the holder’s name was already set in stone on that position.\nBending his knees, he focused his power on his toes, stopping his motion for a second.\nThe next moment, he shot straight up the mountain, through the trees like a meteor.\nGrabbing branch to branch from trunk to trunk, Mikhail advanced through the terrain as if it was his home.\nThe flexibility in his body left even the most acrobatic of men speechless.\nIt was just a result of all the training Mikhail had put into his body.\nStep.\nSuddenly, as Mikhail’s foot landed on a branch, the twig snapped under his weight.\nLosing balance, Mikhail started to fall down where a large hole opened in the ground.\nA multitude of spikes shot out, intending to impale through him like a knife through butter.\nBut Mikhail’s expression betrayed his situation.\nIt was completely calm.\nPlacing his hands in front of him, he wasted no time to cast a spell.\n\"Cindralic Bormis.\"\nWithin a second, a trail of fire shot out from his hands, towards the spikes.\nUsing the reactive force, Mikhail skilfully maneuvered himself in the air to dodge the spikes.\nThey passed harmlessly from where he was before, meanwhile Mikhail had already moved ahead.\nCancelling his spell, Mikhail now landed on the ground.\nBut the moment he did, he felt a rope close around his leg, pulling him into mid-air.\n’The number of traps have increased.’\nMikhail noticed.\nSpinning on his heel, he tried to quickly force break free from the trap.\nBut the moment he tried, he suddenly felt a suppressive force on his body.\nLosing his balance at the sudden force, Mikhail almost fell on the ground if not for his quick thinking.\n\"Aqualic Bormis.\"\nBlasting a stream of water on the ground, Mikhail propelled himself into the air again.\nBarely dodging another volley of spikes that awaited him if he so touched the ground.\n’That old man..’\nMikhail realized.\nThere were some traps intentionally laid out for him, to make it difficult and test him at the same time.\nBut he didn’t feel frustrated.\nRather, Mikhail felt excited for this challenge.\n’Alright, bring it on.’\nCurrently, he jumped straight to at least among the top 50 men with that sudden leap in pace.\nThe faster he finished, the better it was for him.\nIt had been almost 12 minutes.\nHis record time for the whole Physical Tests was 42 minutes with a score of 78.\nHe didn’t know if he had to beat the time or the whole score.\nRegardless, he would just do both of them.\n’Time to pick up the pace.’\nHe gazed up at the mountain, seeing a couple of men ahead of him advancing steadily through the traps.\nFor the first time in these tests, he was feeling a little thrilled.\nThis was why he liked Physical Tests and what the old man often gave him to challenge.\nStanding on the ground, Mikhail looked at the bandages on his arms and legs.\nThese bandages weren’t just for fashion or show.\nThey were training equipment given to him by Vlahovic.\nEach of these bandages around his arm, added at least a 10kg weight on one side.\nIn total, he was carrying at least 50 KG extra weight more than everyone else.\nBut the most shocking part was that he had been doing this for months.\nHe had gotten so used to the weights that it didn’t even feel weird with the additional pressure.\nNot just that, but the tight bandages also served to restrict his flexibility and momentum.\nIt was to restrict and make him challenge the attack head on more times than rather evading it.\nBut there were often times that Mikhail used to untie them to relieve himself of the weight.\nAnd for some reason, this time just happened to be one of them.\nTHUD! THUD! THUD!\nMikhail loosened the bandages around his arms and legs and let them fall to the ground, producing a loud thud.\nThat’s how heavy they were, which also casted some strange stares from him on the side.\nBut Mikhail didn’t care about that.\nRight now, the only thing he was focusing on was the top of the mountain.\nImmediately, the effects were felt by him as he felt a new sense of freedom and flexibility to his body.\nDoing some light stretches and cracking his bones, Mikhail bent his knees, placing his hands over the ground.\nStretching his legs as far as he could, he pushed himself at full speed in the next second.\nAnd the result...\nWas a blur crashing through the trees at a break-neck speed.\n__________",
      "scraped_at": "2025-11-21T13:54:48.318765",
      "content_scraped_at": "2025-11-21T13:54:48.909801",
      "error": null
    },
    {
      "id": "36",
      "number": "36",
      "title": "Chapter 36: End Of Physical Tests",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/36/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 36: End Of Physical Tests\nWHOOSH!\nMikhail sped through the trees, descending down from the mountain to the finish line.\nThe moment he landed back on the ground, he let go of his sprint.\nSmall huffs escaped from his mouth as slowed down to a stop, wiping the sweat from his forehead.\nHe was back, and he was first.\nThe moment he took off his weights was when it all became a breeze for him.\nHe passed through the cadets and returned to the first place in a flash.\nAnd it only took him a total of 19 minutes.\nCatching his breath, Mikhail looked over to Vlahovic, who was standing in the distance.\nThe old man had a surprised but impressed grin on his face, nodding to express his satisfaction.\nMikhail nodded back, acknowledging his praise.\nHe turned back to look at the mountain, seeing the remaining cadets now arriving down as well.\nThe first one to pass the finish line after him was someone he knew very well.\nCameron Brooke, Commander of the 18th Squadron.\nHe was famous for being one of the only few commanders that were a tanker.\nIt was also why his physical abilities excelled so much.\nHis gigantic muscular body already coupled with his Size-Increasing Dragma, made him one of the strongest people around.\nDespite being a heavy-hitter/tanker.\nHe was one of the major position holders in the Physical Tests, often ending up at 2nd or 3rd.\nBehind him was someone he knew as well, albeit barely.\nWith short brown hair, the boy’s muscular body was the clear evidence of his current result.\nJames Thorneheart.\nHe was the Vice-commander of 12th Squadron, known to be a heavy-hitter as well.\nUnlike Cameron though, he preferred using knuckles and his body for fights.\nMikhail had only heard his name time and time around but never knew him well enough.\nUnlike Cameron.\nThat guy was also present in his platoon during the incident.\nFor some reason, Mikhail could not remember what happened to him in his previous life later on.\nBeing quite close in their pursuit of the line, it was unfortunate for James that Cameron was the first to win.\nThey arrived just some minutes after Mikhail, their bodies covered in sweat.\nArriving after 30 minutes would result in an automatic disqualification.\nMikhail saw both of them glare at each other for a second, the rivalry clear between them.\nBut then, both of them turned to stare at him meaningfully.\nThere was no angriness or frustration in them though, Mikhail could only see acceptance.\nAt this point, they had gotten used to being beaten by Mikhail.\nFrom behind, Mikhail heard more noises of cadets arriving, their bodies out of breath.\nIgnoring them, he focused on Vlahovic.\nThe old man was known to give no breaks between tests, making them extremely difficult.\nAnd he was right.\n\"Nobody will take off their weights. Get down on the ground for 500 push-ups. Right now,\" He said, showing absolute calmness.\nTerror instantly took over the cadet’s face at the order.\nBut Vlahovic’s face expressed no sympathy, erasing any chances of raising their disapproval on the task.\nTHUD!\nA sound echoed in the ground, making everyone’s faces turn.\nIt was Mikhail, who had already started doing the task without any hesitation.\nIt was useless to look at Vlahovic for changes, they were just wasting their time.\nAnd Mikhail couldn’t waste any time. He had a record to set.\nAs their gazes landed on Mikhail, two more sounds were heard.\nTHUD! THUD!\nThey were Cameron and James, who immediately followed Mikhail with no intention to lack behind.\n\"We are just wasting our time, hurry up!\" One man shouted, getting to the ground as well.\nIf their collective time got over 1 hour for the exercises, that would result in failure as well.\nFurthermore, in this exercise, if they failed to do 3 push-ups correctly or took a space of more than 5 seconds between pushups, they were disqualified.\nFailing one exercise would result in failure in the whole category.\nThis was how difficult Vlahovic’s Physical Tests were.\nAnd why not many picked them up.\nPeople like Oscar and Modric would brutally fail here.\n***\n[30 Minutes Later]\nIt was finally over.\nAfter a brutal half hour of harsh exercises that ranged from just legs to the whole body, the Physical Tests finally came to an end.\nDrip. Drip. Drip. Drip.\nMikhail wiped the sweat from his forehead, looking out at the other cadets.\nHe could see cadets with closed eyes, dead on the ground, unable to move even a muscle.\nIt was clear how tough the tests were.\nEven Mikhail’s clothes were completely drenched in sweat, sticking to his body.\nThey highlighted his toned and athletic muscles underneath, often hidden by his oversized white shirt.\nHe felt several glances at him from all around but he chose to ignore them.\nHe was only focused on the thing, the results.\nAnd it was now time for them to be announced.\nComing forward to the middle of the ground, Vlahovic tapped his supporting cane at the ground.\nEveryone’s attention moved to the old man, who carried a list in his hand.\n\"Now, I’ll be announcing the marks of the top 3 positions.\"\nThere was no exciting reaction from the crowd, but it wasn’t surprising.\nIt was always like this.\nThe first 3 were always more or less the same, especially this time with the harder difficulty.\n\"First off, at the third position, with a clear time of 48 minutes and 04 seconds is, James Thorneheart. 71 Points.\"\nThere were some appreciative claps heard from the crowd while the short–haired girl just nodded.\nNodding back to express his acknowledgement, Vlahovic moved on.\n\"Then, at the second position, with a clear time of 47 minutes and 11 seconds is, Cameron Brooke. 74 Points.\"\nAgain, some claps were heard from the crowd while the giant guy nodded to show his satisfaction.\nNodding, Vlahovic moved to the final result.\nAt the same time, Mikhail felt every gaze directed at him.\nBecause this time, there was something curious about his performance.\nDespite the test being harder, this time, Mikhail was one of the fastest to complete the tests.\nThe difference between him and Cameron was quite a lot, making them wonder if he had broken his own record.\nEven Vlahovic gave him a meaningful stare.\n\"Good job, Mikhail. I saw the effort you put in these tests.\"\nMikhail nodded, accepting the rare compliment from Vlahovic.\nIt was known among everyone how much the old man favored the 21th Squadron Commander.\nHe moved onto the final result next.\n\"Now, as for the result. For the first position, as always, with a record-breaking clear time of 39 minutes is, Mikhail Hendrix. 81 Points.\"\n____________",
      "scraped_at": "2025-11-21T13:54:49.922559",
      "content_scraped_at": "2025-11-21T13:54:50.515190",
      "error": null
    },
    {
      "id": "37",
      "number": "37",
      "title": "Chapter 37: Avalon’s Message",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/37/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 37: Avalon’s Message\n***\nRolling up his bandages, Mikhail walked back to his castle dorm where everything was already getting lively.\nOn the way, he was subjected to many stares but he had gotten used to it by now.\nHe had come to terms with the fact that it was going to be like this ever since he had been topping every category he was in.\nAnd he knew this was the purpose of the mission too.\nHis mind went back to the flashback he had seen on the first day with Modric and Icarus in the room.\nHe remembered how their faces suddenly changed to rotten headless sacks resting in the snow.\nHis whole squadron laid dead before him with their bodies strewn out.\nHis own broken body covered in blood, resting against the wall of the warehouse in the wild.\nHe remembered those flashes from his past. It was his last days before his death.\nBut then, there was someone else with him.\nA woman.\nShe was there with him in his last days, in the same condition as him.\nHer face and features were blurred and so were the words she spoke to him.\nHe could remember nothing about her at all.\nAnd then the vision had ended.\nHe still needed to find who that woman was.\nMaybe someone from beyond the hold?\nAfter all, it was where he had died.\nHe couldn’t be sure.\nThere wasn’t much to see in the vision, whether she was nice towards him or bad.\nShe might have just been the cause of speeding up his death or even delaying it.\nHe didn’t know this either.\nBut he knew one thing for sure, it was that she was tied to his death.\nAnd potentially even maybe this oath imposed on him after he woke up.\nHe needed to find more about it.\nAnd fortunately, he had found one main source for this after the main quest.\nCharacter Progression.\nHe was currently at 15%.\nAnd he was sure that the vision he saw with the girl after completing the quest was due to this.\nNot only that but after the quest something else had changed too.\n—————〔Oath XXX〕————\n•\nCondition: En*#2e the pr@*@#*$n of #*@#*@(#\n[Penalty]\n•\nDeath\n———————————————\nThe first three words were visible now, just a little at least.\nAfter that it was still, random letters.\nHe still couldn’t make any sense of it, even the first words on what they were.\nBut at least, he knew how to reveal the oath now.\nAfter a month in this world, he knew the ropes around this new system now.\nHe basically needed to do the missions and the Character Progression would gradually reveal his oath and his past memories.\n’Well, if it works like this, then fine by me.’\nHe still needed to find on what basis the missions were given to him though.\nIt would make it easier for him to predict the future ones and be more prepared.\nBecause he was only a misstep away from losing his life away in the first mission.\nLost in his thoughts, Mikhail didn’t realize when he was back at the castle grounds.\nHe was quite hungry so he headed straight to the kitchen where most of them were seated.\nOnly one category was left now.\nOne-on-One spars.\nThey were to take place in some hours so everyone could rest well.\nEntering the mess, he saw his squadron already seated at the table.\n\"You’re back, congratulations.\" Modric congratulated him and started clapping.\nThe rest of them joined in with him.\nMikhail was sure they hadn’t even heard the news yet because they knew he would come first.\nEvery year, they started clapping without even hearing the marks first.\nMikhail gave them a slight smile.\n\"Thanks.\" He sat down on the last empty seat on their table.\nMikhail saw other people on the tables stare down at him too, but speak nothing.\nJust like his squadron they had come to terms with the fact that he’d come first.\nBut as the people who gave the tests came from behind him, the kitchen turned into a staring session.\nAll of them were staring at him.\nAnd of course, Icarus was immediately to point that out.\n\"Why is everyone from the tests staring at you like that? Did you kill a bastard on your way up or something?\"\n\"Pfft-\" Oscar restricted a laugh.\nWhile on the other hand, Mikhail heard the creaking of several tables as the men were shaking in their toes to get up and start a fight.\nUnfortunately, all the masters and Vlahovic were seated above too.\nMikhail saw other people who weren’t at the tests stare at him too, waiting for an answer.\nLetting out a deep breath, Mikhail answered their queries.\n\"I broke my own record. Scoring 81, I was almost 8 whole minutes faster than the second place.\"\nFor a moment, Mikhail heard some forks dropping in the kitchen.\n81!? Under Vlahovic’s Test!?\n\"Holy gracious fuck...\" Icarus said, his eyes widening as he leaned back into his chair.\nThere was silence in the kitchen as the people tried to contemplate what Mikhail had just said.\nAs for the man himself, he was restricting himself from sighing.\nHe hated these types of moments. This quest was already piling a million problems on his head for the future.\nAnd one was already about to start soon.\n\"Fuck this bastard.\" The silence was broken by a familiar voice from behind Mikhail.\nTurning, he saw Cameron’s huge body staring down at his seat in anger.\nHe was glaring so hard that his eyeballs were almost popping out.\n\"This bastard definitely cheated!\" He shouted, trying to grab Mikhail.\nMikhail didn’t even dare to dodge the hand as the guy was already thrown into the wall before it reached him.\nNobody saw what happened as it all happened in the blink of an eye.\nLooking to his right, Mikhail saw Master Avalon dusting his hands.\n\"If you don’t want to eat your food then take your complaints down your ass.\"\nAs he was about to disappear again, Mikhail saw Avalon glare at him as well.\nIt was apparent that he was also displeased with the result.\nBut at least the man wasn’t delusional enough to not accept it.\nAs the others saw Cameron’s body smashed into the wall unconscious, they quietly went back to their own meal.\nIt was better to just accept the result now.\nAfter all, how much more could they deny it?\nThe man in front of them was just a natural monster at everything.\nWhat he was doing at the Ironhold and not in the Empire’s Army or in a Church’s ranks had them confused.\nWell they couldn’t complain. He had saved their asses after all in the attack.\n________",
      "scraped_at": "2025-11-21T13:54:51.521595",
      "content_scraped_at": "2025-11-21T13:54:52.111154",
      "error": null
    },
    {
      "id": "38",
      "number": "38",
      "title": "Chapter 38: Where It All Goes Wrong",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/38/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 38: Where It All Goes Wrong\nIt was finally time.\nFor the one-on-one spars.\nUnlike what one would expect, this wasn’t a whole tournament.\nAfter all they were just evaluating the progress of the men and these were simple assignments.\nThe process was simple.\nEvery man was pitted against two other men of closest strength to him.\nEach fight earned you a score.\n50 for winning the fight or 25 if you lost. And the rest 50 was for how fast you beat your opponent, how much damage you took yourself and other factors.\nThere weren’t many men on the hold so it didn’t require many people to supervise the fights either.\n2 fights would be overseen by one single higher up which were further overseen by a Master, who would be overseeing 10 fights.\nThe score would be given by the masters. The higher up was just there to ensure no cheating or something bad would happen.\nSo in a sense, Mikhail could only fight 2 people too.\nWhether they would be from his squadron or not, it would be seen later.\nThe matchups were decided through a mutual agreement by the Masters.\nReporting to the drill grounds where the fights would take place, Mikhail saw several pieces of papers pinned to the wooden pillars.\nThey were the matchups for every cadet.\nMikhail and his squadron waited for the crowd to disperse before going over to look for themselves.\nAnd they were quick to find their matchups.\nFor Mikhail, it was:\nMikhail Hendrix vs Loriel Marthford\nMikhail Hendrix vs Modric Sylbane\nOh.\nLoriel was the Commander of Squadron 19, he was famous as the best spearman in the castle.\nAs for the other matchup, it was the one Mikhail was most excited for.\nHis fight with Modric.\nMikhail looked at his squadron’s matchups too.\nModric was apparently matched up with James for his second match.\nOscar and Icarus were paired against each other so that would be an exciting battle.\nYvan was paired against someone from Squadron 17 and against Julian.\nEven as a supporter of his own squadron, Mikhail could see very little possibility where he could squeeze past Julian.\nThe latter had jumped a lot in strength.\nBut he still believed in Yvan.\nHowever, despite all their interesting matchups, Mikhail still saw a sad expression on their faces.\nAnd he knew exactly why.\n\"It’s fine, these assignment tests aren’t the only time we can fight against each other.\" He tapped them on their shoulder.\n\"Cheer up,\" he said.\n\"Yeah he’s right, remember the stronger you get, the more chances you have. This should be a source of motivation for us.\" Oscar tried to be positive.\n\"Oscar’s right. This is why you should train more Mikhail, so you can hopefully get a chance to be paired against me next time.\" Icarus tapped him on the back.\n\"You pipsqueak.\" Mikhail smiled at the joke.\nThe group laughed together, the mood considerably better now.\nAs everyone was now confirmed about their matchups, the door to the central building opened finally.\nAnd all the Masters walked out, directing everyone’s attention to them.\n\"It’s time for the final stretch of the assignment tests, the one-on-one spars.\" Avalon announced.\n\"Hopefully, after all these results, you all will continue to improve upon your results for the next time.\"\nVlahovic nodded.\n\"Indeed, we hope that the castle will be back to its full capabilities soon too so we can resume our normal operations,\" he said.\n\"Now, without further ado,\"\nAvalon nodded to the higher ups standing below.\n\"Start the matches.\"\n***\n[After Some Hours]\nMikhail saw multiple matches pass by, but none of his own yet.\nThe scores were to be told to the men as a combination of both fights at the end.\nModric had to fight against James whom he was able to beat in a span of 5 minutes.\nWhile he did have a physical edge against him and put Modric in considerable difficulty, the latter was able to lure him into his traps effortlessly.\nIt was only a matter of time before the knight fell.\nUnfortunately, the time could prove costly to his scores.\nAt the same time, the same couldn’t be said for Yvan.\nThough he beat his first opponent in the snap of an eye, he struggled to adapt against Julian.\nAs a Magus who focused on Materialistic Essentia, it was expected for him to win against Julian, the opposite.\nUnfortunately, the skill gap was too big.\nThat didn’t mean Yvan went down without a fight though.\nIn fact, in some parts of the fight Julian was forced into very tight situations that Mikhail could barely see anyone else getting out of.\nHowever, Julian being the quick shadow he was, was able to squeeze past.\nThough he did win, it wasn’t an easy fight.\nAnd Mikhail was proud of Yvan, giving him his support.\nCurrently, it was Oscar vs Icarus going on.\nAnd it was safe to say none of them were willing to give up.\nBoth of them being exceptional Cindralis users, the whole area was turning into a battle of flames.\nEven the other spectators had shifted their attention to the fight.\nWatching them all made Mikhail realize that they had gotten stronger.\nStronger than they were at this point in his last life.\nAnd the reason for that was obviously him, though he didn’t know at what point he made it.\nAll in all, he was very happy with all of them and their development.\nHowever, there was still something nagging in the back of his mind.\nAt this point, everyone in the ground had faced their first match.\nEveryone except..\nMikhail.\nSomething wasn’t normal, though he was unable to tell what.\nTaking his eye away from the fight, he looked up.\nStraight to the Masters.\nAnd then..\n’..!’\nHe found Vlahovic looking right back at him through the flames.\nHe knew it.\nSomething was definitely not right.\nBut he couldn’t pinpoint what.\nWas the man trying to tell him something?\nMikhail saw a deep sadness in his eyes. He didn’t know what it meant.\nIt was as if he was apologizing to him.\nMikhail’s heart pounded against him.\nAll this time, everything had been going right in the assignment tests.\nAt what point did something turn wrong? What had he overlooked?\n’Shit, I’m panicking.’\nMikhail tried to calm himself, taking a deep breath.\nIt was alright.\nMaybe he was just stressing too much over it.\nEven if it was an issue, Mikhail didn’t see it being anything like the previous attack.\nIf so, Vlahovic wouldn’t have been sitting still. He would have known and he would be ready right now.\nIf it was just something minor, Mikhail could handle it.\nHe was certain he could.\nSuddenly, a voice shook him out of his reverie.\n\"Winner, Icarus Heliarke.\" The announcer raised Icarus’ hand as everyone started clapping.\n\"And now for the next fight, Mikhail-\"\n\"That won’t be needed.\" A sharp feminine voice cut right through the grounds.\nOne that had everyone shaking and rooted in their spots.\nMikhail’s eyes trembled at the thought.\nEveryone knew that voice. It was all too familiar.\nIt had just been with them not too long ago after all.\nStrengthening himself, Mikhail raised his shivering eyes to look up.\nAnd there she was.\nCeline Strathorne.\n’..!’\nWith her violet eyes staring right at him.\n_______________\nThis is the last free Chapter folks.\nI hope you enjoyed the ride till here and keep supporting the novel!!",
      "scraped_at": "2025-11-21T13:54:53.116244",
      "content_scraped_at": "2025-11-21T13:54:53.696368",
      "error": null
    },
    {
      "id": "39",
      "number": "39",
      "title": "Chapter 39: Interruption",
      "url": "https://lightnovelpub.org/novel/i-alone-am-the-sss-rank-regressor/chapter/39/",
      "original_time": "3 months, 2 weeks ago",
      "novel_slug": "i-alone-am-the-sss-rank-regressor",
      "content": "Chapter 39: Interruption\nMikhail’s back was covered in sweat as he made contact with Celine.\n’What the he-’\nThe very next moment, she disappeared from his sight.\nBut before Mikhail could even register the move, he felt someone beside him.\n\"Hmm...\"\nHer face was so near him that he could feel her breath as her violet eyes peered into him.\nIt was as if he was being skinned mentally, layer by layer without even him realizing it.\nThat was the power of a Dominique.\nMikhail did not dare to move. More like his body couldn’t even if he tried.\n\"Hmm...\" Celine hummed, raising her hand.\nHer delicate fingers touched Mikhail’s cold cheek.\nHe felt their warmth despite it being as cold as a blizzard.\nCeline ran down her fingers to the side of his face to his chin, before lifting his face up.\n\"I was right.\"\nHer voice echoed in the silence of the ground, where everyone stood in shock.\nMikhail’s clothes were now drenched in sweat.\nHer mana field was so thick, it was making him suffocate.\nBut finally, she removed her sight from him.\nHer face turned straight to the stands, where her eyes met Vlahovic.\nThe latter instantly bowed his head.\n\"Milady,\" he said.\n\"I’ll be taking this boy with me,\" she replied, wasting no time.\nBefore the words or the shock could even settle in the ground or even in Mikhail, Celine had already acted.\nA humongous gust enveloped her and Mikhail covering them before breaking the next second.\nOnly that the two weren’t there anymore.\nThey were gone.\n***\nBefore Mikhail could understand what happened, the gust around him disappeared.\nOnly that he wasn’t in the castle anymore.\nAround him was white and white all around with thick long trees that stretched above into the sky.\nMikhail knew where he was.\nHe was beyond the hold now.\nAnd not just at any point..\nIt was the place where he had fought the Silent Pact.\nHe could still see some dry faint marks of blood and the broken remains of trees.\n’Why am I back-’\n\"We are here finally.\" Celine interrupted his thoughts as she let go of his chin.\nMikhail’s eyes widened as he was reminded that she was beside him.\n’I couldn’t even notice her.’\nShe was well beyond his league.\nHe was quickly about to make distance before Celine interrupted again.\n\"I won’t kill you,\"\nFuck.\nHe realized that he was panicking, making him read him like a book.\nMikhail took a deep breath, trying to calm himself.\nBut..\n\"At least not yet.\"\nSuddenly, an invisible slice of wind cut through the air.\nIt was so fast that before he could even understand what she did, Mikhail felt something trickle down his cheek.\nA shiver ran down Mikhail’s spine.\n’Too fast.’\nHe felt the blood slide down his cheek to his neck.\nDrip.\nSwish.\nAs he felt a drop of blood drop from his neck, another blade cut through the air.\nAnd for the second time, Mikhail felt wet on the other side of his cheek.\nCeline’s indifferent violet eyes were staring right into his blue ones.\nDespite the stings of pain, he did not dare break contact or make a move.\nHe felt as if the moment he did, his body would be sliced into pieces.\n\"Impressive instincts.\"\nHer graceful voice cut through the air into his ears.\nIn the next second, Mikhail saw her relax her fingers.\nBefore she spoke again,\n\"Go on, give it your all. Hit me.\"\n’Hu-’\nWhat kind of deathly command was-\n\"If you can so much manage to even hit me once, I’ll grant you anything.\"\nBefore Mikhail could speak, she reaffirmed her words.\n\"Anything.\"\nFrom this, he knew she meant anything.\nTheir freedom, wealth, power, her life.\nAnything, she was willing to bet.\nMikhail knew it was easier said than done though.\nIt was almost impossible.\n\"I won’t attack back or even move from my spot.\"\nHe wanted to tell her that those didn’t improve his chances.\nOnly negated of him being dead during the challenge.\n’Here goes.’\nMikhail took a deep breath readying himself.\nHe knew he was going to fail eitherway.\nDefinitely without his Oath and Dragma.\nRaising his hands, Mikhail formed a spell circuit.\n\"Cindr-\"\n\"Your all.\"\nCeline’s voice echoed through the air, disrupting his spell.\nShivers ran down Mikhail’s spine but he calmed himself down.\nHe restricted a sigh.\nHe didn’t know why he was planning for her to not know.\nAfter all he had seen, it was apparent he had been severely underestimating her.\nEspecially his Dragma. He had been kind of hoping that she wouldn’t see it.\nWell, whatever.\nTurning to her, Mikhail readied himself on his feet again.\nThe next second, the ground cracked under his feet as he shot forward.\nSince she had given her word to not attack back or move, there was no harm in getting closer.\nHe didn’t trust her but it was better to take her word for it.\nAfter all, he had nothing to lose. If she wanted to attack, she could have killed him in a second.\nClosing the distance between them, Mikhail took out one of his guns.\nWith his free hand, he performed spell signs in quick succession.\nHe needed to focus right now.\nThe chance that he could hit her even from a millimeters distance was equivalent to finding a needle in a haystack.\n\"Cindralis Morphis.\"\nBOOM!\nA streak of red shot through the meter that was left between Mikhail and Celine.\nMikhail’s blue eyes watched as the bullet neared her before..\nWhoosh.\nThe flames died out and the bullet was cleanly caught between Celine’s fingers.\nIt was as if it gradually slowed down before suddenly halting perfectly in her fingers.\nFor a moment, he was captured in awe of her powers.\nBut he had no time to spare, he needed to give her no time to relax.\nIt was the only way he could force an opening, allowing him a chance to attack.\nThis time, he took out both of his guns, resorting to pre-spells.\n\"Cindralis Morphis. Aqualis Morphis.\"\nBoom. Boom.\nRather than waiting for the bullets to land this time, Mikhail shot forward too.\nJust like last time, the streak of crimson and blue neared Celine before suddenly dying out in her fingers.\nHowever, she was given no room to breathe.\nAs Mikhail was already under her sight now, within striking distance.\nLetting both of his guns go, he performed signs in quick succession once more.\n\"Cindralis Hurrialis.\"\nWHOOSH!\nA torrent of flames erupted from his arms, enveloping Celine whole.\nBut within a second, Mikhail was grabbed by his neck and pulled close from within the flames.\nThe torrent died out a second later and he came face to face with Celine, who stared deep into his eyes once more.\n\"Is that truly your all?\"",
      "scraped_at": "2025-11-21T13:54:54.703506",
      "content_scraped_at": "2025-11-21T13:54:55.289053",
      "error": null
    }
  ]
}