{
  "metadata": {
    "scraped_at": "2025-11-20T20:36:00.540277",
    "total_chapters": 70,
    "novel_slug": "starting-over",
    "novel_title": "Starting Over",
    "first_scraped": "2025-11-20T20:30:21.600356",
    "last_updated": "2025-11-20T20:36:00.540277",
    "is_complete": true
  },
  "novel_info": {
    "id": "starting-over",
    "slug": "starting-over",
    "title": "Starting Over",
    "cover_url": "https://lightnovelpub.org/media/covers/batch_18/novel_13810.jpg",
    "rating": 5.0,
    "chapters_count": 70,
    "rank": 176,
    "url": "https://lightnovelpub.org/novel/starting-over/",
    "first_scraped": "2025-11-20T20:30:21.600356",
    "last_updated": "2025-11-20T20:34:10.079778",
    "scraped_at": "2025-11-20T20:34:10.079778",
    "author": "Sugaru Miaki (Fafoo)",
    "status": "Completed",
    "genres": [
      "DRAMA",
      "MATURE",
      "PSYCHOLOGICAL",
      "ROMANCE",
      "SLICE OF LIFE",
      "SUPERNATURAL",
      "TRAGEDY"
    ],
    "summary": "Starting Over originated as a story on 2ch by Fafoo, who later took the pen name Sugaru Miaki. He then rewrote it as a novel.“It’s been too long since we took the timeNo-one’s to blame, I know time flies so quicklyBut when I see you darlingIt’s like we both are falling in love againIt’ll be just like starting over, starting over”– (Just Like) Starting OverJohn LennonThis is the story of how upon reaching my twentieth birthday, I was sent back to the age of ten, and lived to be twenty once more.",
    "stats": {
      "chapters": "70",
      "views": "876",
      "bookmarked": "23"
    }
  },
  "chapters": [
    {
      "id": "1",
      "number": "1",
      "title": "Chapter 1: * 1 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/1/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "The story I'm going to tell may run contrary to your expectations.\nAfter all, you would probably believe that, if one had the opportunity to be sent back to the age of ten with their memories up to twenty, they would make good use of their knowledge and be able to change all sorts of things.\nEveryone has those regrets, those thoughts of \"If only I had done this instead.\"\nFor those who wish they'd studied more, there are others who wish they'd played more.\nFor those who wish they'd been more honest about who they were, there are others who wish they'd listened more to others.\nFor those who wish they'd gotten closer to someone sooner, there are others who wish they'd never had anything to do with someone.\nFor those who wish they'd made more careful decisions, there are others who wish they'd taken bigger risks.\nWhen I was a child, I once happened to talk with a vagrant under a bridge for about an hour.\nHe was a cheery man who laughed with his whole body. Regret was a thing that seemed unbefitting of the man, yet there was one thing he couldn't quite get over.\n\"In these fifty years,\" the man said, \"the only mistake I've ever made was being born into this world.\"\nSo even that could be a regret.\nWell, anyway. What I'm trying to say here is, life comes packed with regrets. I'm sure you can empathize with that yourself.\nAnd if you could start your life over, no doubt anyone would use their self-reflections, lessons, and memories to make for a smoother second go.\nBecause they'd know those regrets lie ahead of them.\nBut when it came to my experience, well, it was quite the opposite.\nThinking on it now, I did a truly foolish thing. I really did.\n[+]",
      "scraped_at": "2025-11-20T20:34:11.745531",
      "content_scraped_at": "2025-11-20T20:34:12.078702",
      "error": null
    },
    {
      "id": "2",
      "number": "2",
      "title": "Chapter 2: * 2 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/2/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "When I realized that my life had been rewinded a decade, I had one immediate thought:\n“Talk about unnecessary.”\nLet's suppose we have a guy who doesn't have a single regret about his life.\nNow the guy could be plenty happy, or else he could be a moron.\nHe could've lived a life so perfect that there was nothing to reflect upon, or he could just lack the brains to reflect on anything.\nGranted, I'm speaking for myself, but I was the former. I was a happy guy.\nI was pretty pleased with what I was calling life. It's the truth, I didn't have any problems at all.\nHad the best girlfriend I could ask for, great friends, a perfect family, and went to a decent university. Nothing lacking, in my mind.\nI mean, I guess there was the fact I was having so much fun as to only get six hours of sleep a day, resulting in the occasional headache.\nSince I knew I could always wake up to good things, I always wanted to stay up a little longer. Sleep was just missing out on life, as I saw it.\nAnd so for me, who was pretty pleased with how his life was going, the chance to relive my life just seemed like more of a bother than anything.\nA big waste, I thought - felt like it should have gone to someone a little more despairing about their life.\nSuppose there'd be lots of people who wouldn't mind living the years from ten to twenty over again.\nOpportunity always seems to fall upon those who don't seek it. God's just a big old prankster.\nTurn on the TV, and you'll know right away from the people you see that \"God doesn't give with both hands\" is one big lie.\nMaybe I'm just asking for punishment here, but God doesn't have the first notion of \"equality.\"\nAnyway, seeing one of God's cruel pranks with my own eyes just got me thinking about all that stuff.\nPoint is, I was satisfied with my first life, and I had no interest in doing it a second time...\nSo I thought, hey, maybe I should just do everything the same the second time around.\nThat was the idea.\nI guess in a way I was a bit of a prankster myself, taking God's prank and sorta making it backfire.\nFix those mistakes and missed chances in my first life? Nah, I would have it all play out the same.\nI'd set out to make the ten-year rewind meaningless.\nI knew in my mind all the accidents and calamities, the crises and changes to come, but I'd keep my mouth shut.\nAfter all, soon as I started talking about that stuff, I wouldn't know when to stop.\nBesides, there were already plenty of crazies out there claiming they're from the future and know what's gonna happen, so there was no way anybody'd find me any more credible.\nI'd live out the rest of my life in a hospital if I went off in that direction.\nSure, I suppose choosing not to save people who could be saved wasn't something you should rightly do.\nBut to be honest, there wasn't anybody out there I cared about enough to consider sacrificing my own happiness.\nYeah, some people are willing to do that kind of self-sacrifice. But they just do it because the satisfaction they get from the act exceeds what they lose, that's all. So no different from putting priority on your own happiness.\nThe important part is what brings in the most happiness for you. And for me, happiness was \"nothing ever changing.\"\nSo I'd thoroughly re-enact my first life. That's all I sought out of the second round.\nI bet upstream time-swimmers who don't even want it are real rare.\nFeels like I should be congratulated.\n[+]",
      "scraped_at": "2025-11-20T20:34:13.129513",
      "content_scraped_at": "2025-11-20T20:34:13.620723",
      "error": null
    },
    {
      "id": "3",
      "number": "3",
      "title": "Chapter 3: * 3 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/3/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My second shot at life began right at the Christmas when I was ten.\nWhat tipped me off was the paper bag with a Super Nintendo by my bedside.\nTen-year-old me'd desperately wanted one.\n\"Super Nintendo.\" Hearing it now, it's a pretty damn silly name. But at the time, it was the best toy out there.\nWhen I first saw one at a friend's house, I was shocked, all like, \"Is it right for something this fun to exist?\"\nI was so transfixed on the screen, I didn't even lay a finger on the candy they brought out.\nGames were pretty expensive at the time, but my birthday was December 24th, Christmas Eve.\nMy birthday and Christmas presents got put together, so I did get bought some fairly expensive stuff.\nI emptied the paper bag onto my bed. The dull gray system itself. The red, blue, yellow, and green buttons on the controller. Man, those were the days.\nForget thinking about this swimming up the river of time stuff, I wanted to play. Old games always had a certain charm to them.\nThey were limited to simplistic methods by limited storage, but that turned out to make the games more effective overall.\nThe paper bag had a game in it, too. Ah, of course. The system was worthless without one.\n...But, you know, I had to laugh. Because the game in question was all about time travel, going to and fro between the past and future.\nTo borrow a term from said game, my life had been given a New Game Plus: carrying on the memories and abilities from the previous playthrough to do it all again.\nAnd what better description for what was happening now.\n[+]",
      "scraped_at": "2025-11-20T20:34:14.623792",
      "content_scraped_at": "2025-11-20T20:34:15.069540",
      "error": null
    },
    {
      "id": "4",
      "number": "4",
      "title": "Chapter 4: * 4 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/4/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Now, around this point you might be begging to know. How was I suddenly sent back in time at the age of twenty? And what about time paradoxes? And all that sort of science fiction nonsense.\nWell, to be honest with you, I don't have a lick of interest in that stuff. See, you could make all these theories, but I'd have no means of proving or disproving them.\nAs far as logistics goes, what happened to me was, well, something that would never ever happen. It was like two plus two coming out to five. Like your ruler itself was out of whack, I guess.\nOne possibility was that I'd gone nuts - basically, that ten-year-old me suddenly started hallucinating he'd gotten the wisdom of his twenty-year-old counterpart, as a result of twenty-year-old me being sent back in time.\nBut honestly, I was very much sane. I mean, what's the point of wondering whether you've gone nuts, anyway? Really crazy people never notice that they're crazy.\nThe only thing that needed my attention was \"what to do next,\" and nothing else.\nCould I live a happy life out of this situation? That was all I needed to consider.\n[+]",
      "scraped_at": "2025-11-20T20:34:16.085202",
      "content_scraped_at": "2025-11-20T20:34:16.536532",
      "error": null
    },
    {
      "id": "5",
      "number": "5",
      "title": "Chapter 5: * 5 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/5/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I wiped the condensation off the foggy window with a pajama sleeve.\nIt was still dim outside, but I had an unbroken view of the snow-covered town.\nFrom how the sky looked, it should have been rather cold, but my young body was warm. Kid's bodies are great like that.\nIt was still early morning, so there wasn't anyone outside, nor was there a sound.\nAll that was even moving out there was the snow, drifting down at a fixed rhythm.\nIt made my own breathing and the rustling of my clothes seem unusually louder.\nAs I rummaged through the paper bag, it woke up my little sister sleeping on the bottom bunk, and I heard her crawl out from under the down quilt.\nI grabbed onto the bed frame and peered down at my seven-year-old sister.\nShe drowsily turned to a teddy bear beside the bed and shouted “Yaaay!” with a slight delay.\nLong hair like lacquered silk, round mouth, big eyes with just a light touch of color.\nOh yeah, my sister used to look like this, I thought nostalgically. Always walking a few meters behind me, going \"Big brother, big brother!\"\nI guess in a way, I'd say this was when she was cutest. 'Course, she was still a great little sister ten years later, that didn't change.\nBut thing is, as she grew older, she didn't need to rely on me anymore. Good for her, but makes you wonder if your little sister can ever be too capable.\nI dropped off the bed onto the carpet and sat down on my sister’s bunk.\nAs she sat entranced by her teddy bear, I said to her “Hey.”\n\"Your brother’s come back from ten years in the future.\"\nStill sleepy, she laughed “Welcome back!”\nI kinda liked that response and said “It’s good to be back,” rustling her head.\nMy sister being my sister, she looked down, smiling wordlessly, and did the same with her teddy bear.\nI didn't do this kind of thing much when I was ten, so it might've been new. So I wondered how I should respond.\nI wanted to open my heart to someone about the brilliant plan I’d devised.\nI just had an itch for somebody to hear my strange notion, my dare to re-enact my first life. And my sister seemed like a good pick for it.\nShe was little and wouldn't understand whatever I told her, and she'd soon forget all about it.\nI said this to my sister, sitting before me with a teddy bear on her lap.\n\"I know the mistakes I’m going to make, and I know what it is I should really do. Tell the truth, starting right now I could be a prodigy, or get super rich. Heck, I could even be a prophet or some kinda messiah.\n\"...But you know, I don’t want to change a thing. It’ll be fine by me if I can just live the same life as before.”\nShe stared absentmindedly at me, holding her teddy bear.\n\"I don’t get it,\" she replied honestly.\n\"Suppose you wouldn't,\" I said.\n[+]",
      "scraped_at": "2025-11-20T20:34:17.537861",
      "content_scraped_at": "2025-11-20T20:34:18.008530",
      "error": null
    },
    {
      "id": "6",
      "number": "6",
      "title": "Chapter 6: * 6 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/6/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "This is the story of how upon reaching my twentieth birthday, I was sent back to the age of ten, and lived to be twenty once more.\n[+]",
      "scraped_at": "2025-11-20T20:34:19.024400",
      "content_scraped_at": "2025-11-20T20:34:19.569286",
      "error": null
    },
    {
      "id": "7",
      "number": "7",
      "title": "Chapter 7: * 7 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/7/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "First thing I want to get out of the way: I made no compromises in my recreation of the first time ‘round.\nIt was a difficult road, to be frank. Taking lessons for a ten-year-old with the intelligence of twenty and having conversations that suited a kid my age was harder than you'd imagine.\nReal grueling. Felt like I was gonna go insane in a classroom one day.\nMaybe this isn't the best way to express it, but I bet that's how it feels to be a sane guy thrown into a mental hospital.\nAnyway, I was serious about everything I did, cut no corners.\nEverybody craves the limelight from time to time, so of course I had urges to answer questions that nobody in class knew, or object to ridiculously wrong nonsense the teacher said. I'm not gonna deny it.\nAll that self-control can't be good for the body; it was pretty stressful resisting those urges.\nBut it wasn't all bad, of course. There's nothing better the world can offer than the luxury of seeing the world through a child's eyes again.\nI was still friends with the world then, you could say. The trees, the birds, the wind, they all opened for me. And that's not half bad.\nOf course I'd seen all of this before, yet it all seemed new somehow, so it was a great experience.\nI wondered what exactly it was. Maybe my memories had been damaged in the trip back. Or maybe they were compressed for space into something less detailed, more abstract.\nFor example, let's take this memory: \"The starry sky on the day we camped at the lake during the summer when I was twelve.\"\nIf I tried to recall that, I'd think \"The stars were innumerable and pretty, and there were a number of shooting stars too.\"\nThat's what I'd naturally remember, but not a trace of the physical scenery came to mind.\nI couldn't remember what the lake or the campsite were named. I just remembered \"lake\" and \"campsite.\"\nEven if I tried to recall deeper, sometimes I just couldn't scrounge up any more detail.\nThis is how memories work to begin with, of course, but it seemed extra prevalent in my second loop of life.\nSo because of that, I chose to not waste any of those moving experiences.\nOr maybe I should say that, with some knowledge of what was going to happen, I could be prepared, and would take the opportunity to enjoy every moment.\nMaybe you could say it was like reading a book having only read the summary prior.\nBut with how vague my memories of the ten years ago were, I'm sure there were things I just flat-out forgot.\nStill, I planned to do what I could to recreate my first life.\nUsing my limited memories to shed light on the situation, I made the choices that felt most \"natural.\"\nIt wasn't an easy thing to do, but I'd sent off all lingering doubt about using my advantages to improve my life further.\nI loved everything about my first life, and I was bound to the idea of keeping it. Whatever happened, I didn't want it to be undone.\nBut as they say, something as small as the flapping of a butterfly’s wings can bring drastic changes.\nFive years into the second round, my life began to veer off from the path of the first significantly.\n[+]",
      "scraped_at": "2025-11-20T20:34:20.575472",
      "content_scraped_at": "2025-11-20T20:34:21.084033",
      "error": null
    },
    {
      "id": "8",
      "number": "8",
      "title": "Chapter 8: * 8 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/8/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I’m not really sure where to begin. Every little thing ended up different.\nI mean it, I really couldn't tell you. If you compared the two and asked me \"Where were they different?\", I wouldn't know how to answer.\nYou need to have some common points to compare and contrast. You can't just ask someone to explain the differences between a merry-go-round and a pencil, right?\nBut in a word, I was ruined. Far worse off than one would ever imagine given my first life.\nTo give a few examples, let's see. I was bullied by my best friend from my first life, I was severely rejected by my girlfriend from my first life, and I failed the exam for the high school I attended in my first life... and so on.\nI bet you're dying to know what change in my heart or whatever brought on such corruption. But I don't want to talk about that, at least not right now.\nBasically, I'm not the type to moan about his worries.\nAnybody who enjoys hearing that stuff's gotta be someone who love strangers' sorrows better than three square meals, some real rubbernecking gossiper types.\nAnd this story's not for them. So let's just summarize the interesting bits.\nI guess I'll put it like this. In my second go at life, a vicious cycle had created itself seemingly out of thin air.\nOne bit of misfortune led to another bit of misfortune, and that led to a third. As soon as there was a tiny misalignment in the cogs, all these other ones got mucked up, and those ones mucked up even more...\nAnd in the end, the cogs had all come apart. I think that's a good way to explain what happened.\nIt was a friend of mine who put it that way first, though.\nI was always a guy who could \"fall either way,\" so to speak. I had the potential for great success, but I also had the potential for massive failure.\nThe more I think about it, I realize that's hardly something exclusive to me.\n[+]",
      "scraped_at": "2025-11-20T20:34:22.097273",
      "content_scraped_at": "2025-11-20T20:34:22.583407",
      "error": null
    },
    {
      "id": "9",
      "number": "9",
      "title": "Chapter 9: * 9 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/9/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "There were a lot of causes all linked together which I could point to, but what I would call the most decisive one was how readily the girl who should have become my girlfriend rejected me.\nWhen my confession - which I was a hundred percent sure would succeed - bombed, well, it's not hard to imagine my dismay.\nAccording to my memories, \"that girl\" always had sleepy eyes, but it only looked that way because of her long eyelashes.\nWhen she appeared to be spacing out, the gears were in fact always turning in her head... That's what my \"future girlfriend\" was like.\nThose memories about her were some of the most clear. Maybe memories have a hierarchy, where the highest-priority ones make the most concrete memories. Yeah, I guess that's memory for you.\nAt any rate, she seemed like the kind of girl I'd fall for. I've never been particularly interested in a girl simply because she's smart, but I guess I'm soft for \"looks like she's spacing out, but always has her head on straight.\"\nThat sort of fondness for abnormality... Well, if you compare it how I choose my friends, it's a more pure, feeling-based thing, admittedly. Not something I wanna do all the time.\nI seemed to recall that in my first life, I confessed to her in spring, my third year of middle school.\nAnd her reply was something like \"Thank you, I've been waiting so long,\" half in tears. And in the five years after that, we were more or less inseparable.\nThat's how it should have gone the second time, too.\nYes... It should have.\n[+]",
      "scraped_at": "2025-11-20T20:34:23.587485",
      "content_scraped_at": "2025-11-20T20:34:24.082193",
      "error": null
    },
    {
      "id": "10",
      "number": "10",
      "title": "Chapter 10: * 10 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/10/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "In autumn, in my second year of middle school, the night before the culture festival, as the classes were finishing up all their presentation preparations, I remembered that this day held great significance in my life.\nWe were implicitly allowed to stay at school until 9 PM that night, so everyone finished up early so we could have a blast.\nIt might have been a little after 6 PM. As I took in the breeze on the veranda outside, I watched my classmates making props and rehearsing a play in the classroom.\nSuddenly, but not necessarily because anything had happened, I was filled with a feeling of happiness.\nAs I searched my mind for the cause, I realized it was that girl who would soon become irreplaceable.\nI remembered that this was the day. It seemed that this was when I began to fall in love.\nAs ever, I didn't know who that fateful girl was, but I gleamed that today would bring the impetus for falling in love with the one who would become my girlfriend.\nThus, I stuck around the classroom as late as I could that day to meet her.\nJust past nine, when I couldn't bear to wait any longer, a classmate spoke up.\n\"Hey, can somebody take this to the gym?\"\nI intuitively accepted on the spot, and received a number of props. Among them was a red Santa hat.\nI would've been willing to just take it by myself, but then from the corner of the room came a voice: \"Wait, I'll help you!\"\nI looked toward the owner of the voice. It was Tsugumi who came running up to me.\n\"As I thought,\" I thought.\nSleepy eyes, long eyelashes, always thinking. As I said, I'd been searching for a girl with those characteristics, and found a few, but Tsugumi matched them most closely.\nI had more or less nailed her as the one who would be my future girlfriend a while ago. And I found my guess to be spot on.\nWith my future girlfriend before me, I nearly danced down the hallway as I joked with Tsugumi, who had put on the Santa hat.\nShe smiled at the corner of her mouth, took some reindeer antlers from among the props we were carrying, and put them on me.\nThe lights were already off in the gym, so it was pitch black. After we put down the props behind the stage, Tsugumi looked at me and grinned mischievously.\n\"Hey, if we go back, we'll just have to do more work. Let's rest here a while.\"\nI agreed, of course.\nWe ended up going home together that night. We both seemed sad to leave each other, so we talked for about an hour more on a park bench.\nThis is where the best parts of my life begin, I thought. I was dizzy with delight.\nI would repeat everything the same as in my first life. So I thought.\nExcept, well... what happened in cherry blossom season, in my third year of middle school.\nAs in my first life, after school, when we were the only two in the classroom, I confessed to Tsugumi.\nI was ready to delight, and for her to be delighted, and all of that.\nBut she just looked worried and said \"Umm...\", faintly trying to smile.\nA few days later, she ultimately turned me down. But perhaps the problem was that I was too cocky.\nMy confession, in my first life, was said very hastily and with much tension.\nPerhaps my desperation managed to move her, and turned a confession that ordinarily would not have won her over into one that did.\nThe second time, I'd acted more like \"Hey, you've been waiting, right? Figured I'd confess already.\" It wouldn't be surprising if that left a bad taste with her.\nI could think of any number of other causes, of course. But I had failed to make her my girlfriend. That was what mattered.\n[+]",
      "scraped_at": "2025-11-20T20:34:25.088594",
      "content_scraped_at": "2025-11-20T20:34:25.562566",
      "error": null
    },
    {
      "id": "11",
      "number": "11",
      "title": "Chapter 11: * 11 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/11/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "After that, oh, it was awful. I never would have imagined what good influences my girlfriend had on my first life.\nHaving lost my \"goddess of happiness\" for my second life, I was as powerless as a vinyl bag in a storm.\nFor the first month or so, I wanted to believe it was some kind of mistake. Thought Tsugumi must've had some reason to lie to me.\nI earnestly believed that soon enough, she'd come tell me \"I'm sorry for lying. There were deep circumstances which made me unable to respond to your affections that day, but actually, I love you.\"\nBut fifty days passed since my confession, and even I couldn't believe that anymore. It was too late for her to take it back.\nIt seemed no matter how hard I tried, faithfully recreating the past was impossible from the start.\nWhy, if I'd known this would happen, I should have just become a prophet.\nBut it was too late now. Five years had passed since I swam upstream, and my mental and physical ages had mostly realigned.\nOn a related topic, a life without Tsugumi was so hard to bear that I stopped really trying to listen to lectures after that, putting me down a few notches in academics.\nDon't underestimate the effects others can have on you, I mean it.\nYou might think it's ridiculous that I'd struggle with high school exams with knowledge up to twenty years old.\nBut hey, you try emptying your head and being stuck back in elementary school for a few years. I think you'll get what I mean then.\nBrains are flexible, so any information we deem to be unnecessary is mercilessly tossed out.\n[+]",
      "scraped_at": "2025-11-20T20:34:26.567058",
      "content_scraped_at": "2025-11-20T20:34:26.999323",
      "error": null
    },
    {
      "id": "12",
      "number": "12",
      "title": "Chapter 12: * 12 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/12/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I guess it was my plight, after living a first life with no regrets, to live a second one full of them.\nI never asked for a lot. If you ask me, I was pretty humble. I thought my attitude was commendable.\nIn that sense, I don't really know what God was thinking. Heck, maybe God just wasn't thinking. I mean, assuming existence, of course.\nHell, I'm an atheist anyway. Why am I saying all this stuff about God, exactly? Weird.\nWell, maybe I'm just borrowing the word \"God\" to refer to the justice of the world and all that. I suppose that's it.\n[+]",
      "scraped_at": "2025-11-20T20:34:28.015682",
      "content_scraped_at": "2025-11-20T20:34:28.467161",
      "error": null
    },
    {
      "id": "13",
      "number": "13",
      "title": "Chapter 13: * 13 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/13/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "So with all that going on, by the time high school came around, I was a very gloomy individual.\nIf my first-life self saw me, he would never believe we were one and the same, I bet. Or at least it might take him a while.\nEver since Tsugumi rejected me in the spring of my third year of middle school, I gradually started to hate people as a whole. Not like I ever completely hated everybody, but...\nWell, I went to a way worse high school than the one I'd gotten into before. And thanks to all the people without a shred of intelligence there, my budding misanthropy bloomed.\nThe fact that I was one of them, objectively speaking, certainly didn't help matters.\nSo I kept putting more distance around me. As a result, I was the epitome of a loner.\nI might say my time at school was reduced to nothing but suffering.\nI feel like for the majority of three years, I was just watching the clock. I might even say that was my entire school life, waiting for time to pass.\nI thought that with time, things would get better. But the only thing time does is bring things to their end.\nGranted, my problems didn't get any worse, but they didn't get any better either.\nHigh school wasn't made for people without friends. I had no such people to enjoy passing the time with.\nAs such, I barely even remember my second-time high school years. I even tossed out the yearbook with hardly a glance inside.\nIt was a painful time. Even class trips, which should have been great fun, were just agonizing.\nI remembered others openly treating me cruelly, and waking up in the middle of the night at a hotel to go cry in the bathroom. Those were the kinds of memories I had.\nI was always thinking to myself, \"Why did it come to this?\" and \"This shouldn't have happened.\"\nBut those are feelings anybody can have. It's basically just self-discrepancy.\nAnd yet my first self never once had those thoughts. Which is pretty strange, now that I think about it.\n[+]",
      "scraped_at": "2025-11-20T20:34:29.481529",
      "content_scraped_at": "2025-11-20T20:34:29.923634",
      "error": null
    },
    {
      "id": "14",
      "number": "14",
      "title": "Chapter 14: * 14 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/14/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Was I now paying the price for having too happy of a first life? I wondered.\nBut then again, I felt like I'd already confirmed that the world didn't have any sense of fairness. The world I lived in didn't seem equal enough for that to be true.\nI thought that depending on how I went about things, I could've lived an even happier life than the first one. My mistake was trying to preserve it.\nSay there's a race with a hundred people, and there's one guy who places around third every single time, right?\nBut see, he's placing third when he's trying his best to place first. If he were only aiming for third to begin with, he'd probably end up seventh or ninth.\nThat's more or less the mistake I'd made.\n[+]",
      "scraped_at": "2025-11-20T20:34:30.927745",
      "content_scraped_at": "2025-11-20T20:34:31.412770",
      "error": null
    },
    {
      "id": "15",
      "number": "15",
      "title": "Chapter 15: * 15 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/15/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "However, there was one little thing that temporarily got me back on my feet. Though when I say temporarily, I mean it.\nIn the winter of my second year in high school, there was a terrible snowstorm one night.\nI was shivering and waiting for the bus that went to the train station.\nThe terminal had a roof, but the wind blowing the snow around made it near-useless.\nMy melton coat was completely white with snow, and my face and ears were painfully frozen.\nThere was a warm light coming from a residence near the terminal.\nThe wet road served like a mirror, reflecting a distorted and inverted world.\nI found it far more beautiful than all those light decorations which clumsily aimed for beauty.\nThe bus finally arrived, though it should've been there thirty minutes ago.\nBut before the door even opened, I knew I didn't have time to get on. I reluctantly watched the sluggish bus drive off.\nI looked up to the sky and sighed a white breath.\nI was sure I'd catch a cold in this weather, but I didn't really care so much. I'd have a valid excuse to take school off, right?\nI was half-ready to just stay there another five hours and get pneumonia.\nBut when I sat down on the bench, I suddenly noticed someone similarly waiting in vain at the bus stop across the street.\nI knew the girl well, her hair fluttering in the storm. Yes, it was Tsugumi, the one who had rejected me in the spring of my third year of middle school.\n\"Why?\", I thought first of all. The high schools we went to should've been miles apart.\nI wondered if, maybe sometimes, she had errands or other business which brought her around here.\nI could've just asked her, but I couldn't gather the willpower to speak to her.\nAt the time, I still had sort of a half-resentment for Tsugumi. She hadn't accepted my good will, so now I wasn't going to give it to her.\nA selfish excuse, yes. But if I didn't shift the blame onto someone else, I wouldn't be able to live with myself.\nBut now that Tsugumi was right there in front of me, I found there was a part of me that was glad. I had to recognize that, at least.\nI gave Tsugumi a rude glance, but she didn't seem to notice it. Maybe I was so insignificant to her that she'd long forgotten about me.\nShivering in the cold, she seemed so lonely.\nI felt like she could use someone warm beside her.\nOf course, this was just me making false assumptions and fantasizing. Because when I thought \"someone,\" of course I meant myself.\nBut I told myself that was what she was thinking. A happy misinterpretation.\nThe illusion that I might be needed by someone actually felt pretty good.\nI succeeded in convincing myself that \"Hey, that girl needs me after all.\"\nAfter all, people can use misunderstandings as food to keep living.\nReligion's a good example... nah, I kid. Don't wanna make anybody angry.\n[+]",
      "scraped_at": "2025-11-20T20:34:32.426859",
      "content_scraped_at": "2025-11-20T20:34:32.882154",
      "error": null
    },
    {
      "id": "16",
      "number": "16",
      "title": "Chapter 16: * 16 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/16/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I had lost a lot of enthusiasm for life, but encouraged by my auspicious misunderstanding, I was determined to get my happy days back.\nFirst on the agenda was studying like mad to get into the same university as Tsugumi.\nIt's not that I was frantically studying, actually. Rather than focusing on studying, it's more like I stopped focusing on anything else.\n\"Concentration by elimination,\" maybe? Has a nice ring to it. I did away with all choices that weren't studying.\nIt's a dangerous method to be sure. If you mess it up, it's an easy way to make yourself otherwise-talentless with nothing to live for. But I guess I hung on by playing music as I studied.\nI never considered myself much of a music fan before. I only really cared for John Lennon. Mostly because in my first life, whenever my girlfriend had a spare moment, that's what she'd play.\nStrangely, Lennon-related memories stood out a little bit more than others. Well, I suppose his music survives the ages, so maybe it's not that odd.\nI read in a magazine once that a good song, even if it doesn't suit your mood at all at first, grows on you as you listen to it again and again.\nI used to only listen to your typical karaoke songs. But in my second round of high school, I heard \"Yer Blues\" on the radio, and immediately realized how familiar John Lennon was to my ears.\nSince then, I would always play Lennon while I studied.\nFinally having a clear goal in mind, I got more serious with high school.\nUntil then, I'd been checking the clock fifty times a class, hoping it could go just a little faster.\nBut the moment lectures became something that mattered to me, it started passing in the blink of an eye.\nI'd practice rote memorization even on the bus and the train, and after I got in the habit of spending a fixed amount of time at my desk at night, I stopped having sleepless nights worrying about nonsense.\nI'd spent altogether too much time thinking about unimportant matters, that's for sure.\nBy cramming an extraordinary amount of info into my head in such a short time, old memories got pushed aside, diminished in importance.\nMy final year of high school was actually a rather peaceful one. The part I remember most was the finale, the exam cramming in early winter. Memories of being cooped up in my room studying.\nThe smell of coffee filled the room, and the speaker on the left of my desk softly played Strawberry Fields Forever. On the right was a small desk lamp, the only light.\nBehind and to the right of my chair was a heater, angled just right so it wasn't blowing hot air directly at me.\nOnce every two or three hours, I'd get my coat on, go outside, and take in the wintery air.\nIf the weather was good, I could see the stars. Once I'd had my fill, I would go back inside, warm my hands with the heater, and return to a world of only myself, textbooks, and music.\nIt wasn't so bad, actually. Maybe there was even a soothing, self-satisfying quality to it.\nIn the end, I stretched my academic skills as far as they could go.\nAnd miraculously, I was able to enter the university I went to in my first life.\nIt was a wonderful feeling. I had finally gotten my confidence back. I felt like I could do anything then.\nSo that was good. Things were going good so far.\nWhen the college entrance ceremony was over, I looked around for my former girlfriend... for Tsugumi.\nAnd yes, I did find her, but this is where the problems began.\nThree years was plenty of time for things to change. And I had thought I was ready.\n[+]",
      "scraped_at": "2025-11-20T20:34:33.889537",
      "content_scraped_at": "2025-11-20T20:34:34.444228",
      "error": null
    },
    {
      "id": "17",
      "number": "17",
      "title": "Chapter 17: * 17 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/17/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "After the ceremony ended, I hurried over to the entrance of the hall, and there I waited for Tsugumi to pass by.\nOf course, I hadn't done that thorough of a check to make sure she actually did go to the same college as in my first life.\nIf nothing was necessarily going to be the same, perhaps even because of the fact that Tsugumi and I didn't get together, it was a clear possibility that she went to a different one.\nIt was even possible that Tsugumi had long since found a job for whatever reason.\nFortunately, there was only the one exit. So if she was there, chances were slim that I wouldn't see her.\nPlus, I had honed my sensor for distinguishing between Tsugumi and other people. I'm not even kidding. If you've ever had an intense love for someone when you're young, you'll know what I mean.\nThe new students, of which I was one, would see people they knew and cry exaggerated shrieks of joy at recognizing each other.\nIt looked ridiculous to me, and probably everybody else. But I doubt they cared, they were having too much fun.\nI was envious, to be honest. Unfortunately, there was no one I knew, and if there were I don't think I'd want to talk to a single one. So I didn't get to do any of that.\nBut if when I found Tsugumi and called out to her, she yelled with excitement to see me again like the other girls, that sure would've made me happy.\nThat idea alone is probably what'd kept me going for about half a year.\nBy this time, I had become pretty economical. Since my life was lacking in joy, whenever I came upon the slightest happiness, I ruminated on it and got all I could out of it, like licking every bit of an ice cream cone.\nI had my hair neatly cut, wore a necktie, and loosened my face muscles for my reunion with Tsugumi.\nAnd then the time came.\nI only saw just a bit of the back of her head among the crowd, but I was certain. It was Tsugumi.\nI wasn't sure what to say to her, so I started by walking over.\nThere was a strange pain in my chest. My breathing grew irregular. The few meters felt like hundreds.\nWhen I was close enough that I felt confident she could hear me, I was about to just call out her name, \"Tsugumi!\" -\nBut no voice came out of my open mouth.\nI felt my temperature plummet.\n[+]",
      "scraped_at": "2025-11-20T20:34:35.446455",
      "content_scraped_at": "2025-11-20T20:34:35.952731",
      "error": null
    },
    {
      "id": "18",
      "number": "18",
      "title": "Chapter 18: * 18 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/18/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My former girlfriend was walking, arms linked, with a man I didn’t know.\nAnd if it were only that, perhaps I would have been able to handle it.\nI mean, we had been apart for three years. And other guys certainly wouldn't leave such a charming girl alone.\nI didn't really want to think about that reality, but I thought I was prepared for it.\nTsugumi would have gotten lonely. So even if she had found someone to replace me, I couldn't rightly blame her.\nBut when the man walking alongside Tsugumi looked for all intents and purposes the spitting image of myself from my first life - well, that was a different story.\nThat man who walked with Tsugumi, his height, his actions, his voice, his speech, his expressions, everything was identical to my first self.\nAs I've said before, my memories of my first life weren't concrete, but he perfectly matched characteristics like \"friendly smile\" and \"melodic voice.\"\n\"Doppelganger\" came to mind.\nBut there were some problems in considering the man to be my doppelganger. That is to say, my first and second selves had become quite distinct in every sense.\nSo oddly enough, if you compared me with the man walking with Tsugumi who appeared to imitate my first life... it felt more like I was the fake.\nIf there was a doppelganger here, it felt more reasonable to assume it was me, not him.\nI knew then that I had failed. Had been I able to exactly recreate my first life, I would have surely become the man before my eyes.\nIt was now no wonder why I hadn’t been able to date Tsugumi.\nBecause the second time, I had a replacement.\n[+]",
      "scraped_at": "2025-11-20T20:34:36.961410",
      "content_scraped_at": "2025-11-20T20:34:37.449548",
      "error": null
    },
    {
      "id": "19",
      "number": "19",
      "title": "Chapter 19: * 19 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/19/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I hadn’t felt such animosity for someone in a long time.\nUntil then, I couldn't really muster the energy to loathe anyone. Because to consider someone a villain, you need to see yourself on the side of justice, right?\nI couldn't do that. I knew better than anyone that on the second loop, I was a worthless human being.\nThe most resentment I'd held prior was the vague bitterness I felt toward Tsugumi.\nBut this time, I was filled with rage.\nI could only stand there dumbfounded, shouting in my head \"Hey, that’s not right! That’s MY role!\"\nWhat can I say? If Tsugumi had merely gotten a boyfriend, I could live with that. Heck, I might even think \"I'll take her back,\" tell myself \"I'm way better than him!\"\nNow that I could really get fired up over. A battle to take back my destined partner.\nBut that it was none other than myself who took Tsugumi from me... Alright, well, maybe that's not the right way to say that.\nBasically, someone who assumed the position I had in my first life, and grew up to be exactly like I had then, appeared to be Tsugumi's boyfriend.\nSo she had chosen him as \"a more perfect me.\"\nSo here I had to ask something.\n\"Can I beat myself?\"\nHad I been competing with a different type of man, I could have found my own virtues to emphasize.\nAnd I could be sure Tsugumi would fall for those. What you're looking for in a partner doesn't change that easily.\nBut competing with a man who was the exact same as me? I didn't know how I could win then.\nBecause I had to admit, he was superior to me.\n[+]",
      "scraped_at": "2025-11-20T20:34:38.466157",
      "content_scraped_at": "2025-11-20T20:34:38.905336",
      "error": null
    },
    {
      "id": "20",
      "number": "20",
      "title": "Chapter 20: * 20 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/20/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "And so I was lost again.\nThe months to follow were full of surprises. Since my other self was perfectly recreating my college experience, one event after another.\nNormally I'd go into more detail about all that, but this time I'll keep it short. If only because I'd depress myself to explain it all from beginning to end.\nIn no time at all, he was a central figure in his department, he was respected by lots of people, he got friendly with lots of girls - still, though, he stuck with Tsugumi.\nOh, as an observer, I couldn't help but remark just how happy I had been in my first life. Again. And yet he wasn't disagreeable, he was kind to everyone.\nI hate to admit it, but him and Tsugumi walking together sure made a good picture. They were a walking fairy tale, you might say.\nThey were so dazzling, I felt like I wasn't even in their league. Of course, they were a friendly pair, and if I showed any will to be friends with them they'd readily accept it.\nBut that wasn't what I wanted.\nYet it felt strange to think that even this seemingly perfect person could end up like me with the slightest misstep.\nIf he were given the same chance to relive his life, there was a non-zero chance he'd be ruined too.\nWhen you look at it that way, maybe there aren't so much good and bad people as there are good and bad environments which people grow up in.\nHeredity didn't seem to have a whole lot of bearing on me, at least.\n[+]",
      "scraped_at": "2025-11-20T20:34:39.922153",
      "content_scraped_at": "2025-11-20T20:34:40.383753",
      "error": null
    },
    {
      "id": "21",
      "number": "21",
      "title": "Chapter 21: * 21 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/21/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Around the end of October the following year, something snapped in my head.\nAfter graduating high school, I lived in an apartment near my college. And by then, I had become very much a shut-in.\nI rarely went to school, didn't have a part-time job or anything, didn't meet with anyone, didn't eat well, drank all day, and slept the rest of the time.\nI didn't even turn on the TV or radio, nor did I read the news. I isolated myself from the outside world.\nOther than going to the convenience store to buy beer, cigarettes, and junk food, I hardly went out there.\nAll my cellphone inbox had in it was stuff from agencies about finding a part-time job and newsletters. Not a single human name.\nEver since I found out my \"replacement\" existed, I had to compare myself to him whenever I did anything.\nI became very self-conscious about how much better he'd do every little thing.\nThanks to this, even things that were perfectly ordinary before become all of a sudden unbearable.\nFor example, I'd never had any problem with not attending class in high school, but when I saw Tsugumi and my replacement - it seemed his name was Tokiwa - attending seemingly every day, it made me feel hopelessly alone.\nSince then, every day I came and went to school alone, I was overcome with emptiness thinking how Tsugumi wasn't there next to me.\nAnd this gradually started to happen every waking moment.\nWhen I ate alone. When I watched TV alone. When I lay in bed alone. When I went shopping alone.\nI was aware of Tsugumi not being there all the time, and I was stricken with a sense of loss.\nWhen I walked through town and saw couples in high school and whatnot, I was wordless.\nTsugumi and Tokiwa must've always been having dates in uniform like that, I thought. I couldn't get over it.\nOn days they stayed late for clubs they'd bike home together, on rainy days they're share an umbrella, on snowy days they'd hold hands through their pockets.\nIt was too easy for me to imagine.\nAnd perhaps when I saw Tsugumi waiting at the bus stop that day, she was waiting for Tokiwa.\nI knew how happy Tsugumi would be able to make me, and I probably knew how happy I would be able to make her.\nAnd so I felt empty.\nI was devastatingly wounded. Unfortunately, all I did to try and soothe myself - look at pretty scenery, eat delicious things, watch emotional movies - had the opposite effect.\nIt just further reminded me that I didn't have anyone to share those wondrous things with.\nI'd given up. There was really nothing I could do. I was only a step away from going mad.\nThat's why I distanced myself from the outside world, and numbed my brain with alcohol and cigarettes. Some of humanity's finest inventions, those.\n[+]",
      "scraped_at": "2025-11-20T20:34:41.396439",
      "content_scraped_at": "2025-11-20T20:34:41.868565",
      "error": null
    },
    {
      "id": "22",
      "number": "22",
      "title": "Chapter 22: * 22 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/22/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "It was festival day at college, but I didn't even have the will to leave home. It's not like I was in any clubs, nor did I have anyone to tour around with.\nI knew it would only make me feel more miserable, no doubt about it.\nOf course, though, I was made miserable that day even despite my decision not to go.\nBecause unfortunately, I remembered what this day had been like in my first life.\nWhat an asshole of a memory, coming back to me in perfect condition...\nWell, suppose I shouldn't have expected any less, as it was an important one.\nFirst-life me and Tsugumi were rarely ever apart after fifteen, and would hug and kiss all the time, even when people's eyes were on us.\nBut somewhat strangely, there was one important line we were hesitant to cross.\nWhy? Well, we were very intimate. We trusted that our feelings for each other would remain the same, so there was no rush.\nSo we held out as best we could. We managed to put our anticipation aside... for a while.\nUntil that festival day, when the final remaining line was crossed.\nSo, yes... that night, Tsugumi and Tokiwa crossed that line.\nI felt like I was pissing my own self off. Like never before, I was enraged beyond reason; I wanted to smash things, and on that fervor thought I might just go out and find Tsugumi.\nBut the action I actually chose to do was the polar opposite. And why I did it, I don't know myself.\nI hid underneath the table. Yeah, like a fire drill. And I started sobbing. For hours and hours, like a kid.\nEven though I was still pissed as hell. Even though I still saw the guy as my mortal enemy.\nBut once you despair, it's all over. Because that's at least half-accepting that it's all worthless.\n[+]",
      "scraped_at": "2025-11-20T20:34:42.870707",
      "content_scraped_at": "2025-11-20T20:34:43.360118",
      "error": null
    },
    {
      "id": "23",
      "number": "23",
      "title": "Chapter 23: * 23 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/23/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My room had gotten awfully dim. I heard the chirping of crickets outside the window.\nI had settled down considerably. And I felt that a small flame had lit deep in my heart.\nStrangely enough, I was calm.\nI consented to the fact that I wasn’t the right man for Tsugumi, and that I could never beat Tokiwa.\nSo then what am I to do?, I asked myself. That's easy, I replied.\n\"My double just needs to be taken out.\"\nI readily accepted this answer I'd derived.\nWouldn't say I was at my most sane, no.\nBecause in short, I considered murdering Tokiwa, this man taking my place.\nThen, of course, Tsugumi would be lonely again and move toward me, the next best thing.\nNo matter how you looked at it, it wasn't rational, and even if I succeeded in murdering Tokiwa, it was difficult to say it would fundamentally solve everything.\nIn fact, if Tokiwa were to die at this time in their relationship, it was very possible that Tsugumi would deify him and not even try to look for any other men.\nBut regardless, in that moment, I was very serious. I even selfishly thought \"This is for Tsugumi's sake, too.\" Despite how she would clearly be happier the way things were now.\nThose driven into a corner really don’t tend to have good thoughts. Their outlook is too narrow.\nAltogether, I have to admit my second self was a complete and utter dumbass.\nDepending on how you looked at it, my mental age could've been considered twenty-nine: twenty years of one life plus nine of a second.\nBut as far as I could tell, it seemed like my mind hadn't matured any further than twenty.\nI think I was experiencing that \"tortoise and the hare\" phenomenon that tends to happen with precocious kids.\nWell, now... It got a little long, but all this has more or less been the introduction.\nTell the truth, what mattered most in my journey back to twenty were those last few months.\nSo from here on out, I'm gonna start explaining things more thoroughly.\n[+]",
      "scraped_at": "2025-11-20T20:34:44.370107",
      "content_scraped_at": "2025-11-20T20:34:44.808624",
      "error": null
    },
    {
      "id": "24",
      "number": "24",
      "title": "Chapter 24: * 24 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/24/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "So - that's how Operation Take Back My Girlfriend began.\nOr to put it more bluntly, my plan to murder my doppelganger.\nNow, if I were caught after murdering Tokiwa, it would all be for naught.\nTo ensure this murder would be the perfect crime, I first began to stalk him.\nI tailed him for days on end, believing the perfect moment for me to actually kill him would someday appear.\nThe method I desired was to push him from somewhere high up, to make it look like an accident.\nYes, I sought a death so believably natural that in a few years' time, even I who'd carried it out would be thinking \"That was an accident, wasn't it?\"\nOf course, you always hear about people who do bad things getting arrested because of one little slip-up.\nBut what I think is, that doesn't happen because they dropped their guard. It happens because the person actually thinks \"I should've been arrested.\"\nThat guilty thought consumes them until they feel like \"it'd be easier if I were arrested,\" and that leads to a slip-up.\nSo just like I said, it was ideal that I went with a method that weakened the feeling that \"I killed him\" to keep that from happening.\nAnd at least speaking for my first-life self, I loved spacing out and watching the scenery on bridges, viewing platforms, rooftops, all kinds of high-up places.\nSo, you know, if he was on a bridge with nobody around and no railing, gazing off ahead of him, I could sneak up and grab his legs, then push him right off.\nI didn't know what kind of equipment the police had those days, but even if by some chance they noticed anything unnatural about his corpse, as long not a single hair, fiber from my clothes, or fingerprint could be found on the body, I thought I'd be okay.\nAll I had to do was keep waiting patiently for a fortunate moment. I couldn't just make an opportunity here, I had to wait for it.\nNo buts about it, I'm not the kind of person who can flex their wits to deceive the police. No matter how tight-lipped I tried to be, it was inevitable I'd make some mistake.\nSo I just had to count on luck.\nAnd fortunately, I did have plenty of time. Had this been before the festival day, I might have been a little more impatient.\nI may have even killed Tokiwa before he crossed that final line. Man, I'm really glad it didn't come to that.\nTailing him wasn't particularly hard to do. Since Tokiwa was so remarkably identical to my first self, I could easily predict his actions.\nI bet he'll go here next, he's probably going to leave soon - I recognized those kinds of things plain as day.\nAnd really, you're not going to notice you're being tailed if you're not someone who looks behind themselves a lot.\nNow when you hear me talk about \"tailing\" my target, you're probably imagining this to play out like some hard-boiled private detective story. Well, I'm gonna have to let you down there.\nIn actuality, it was all boredom and inconvenience. Even if my target did have some big secret he was hiding, he was still just a student.\nPlus, the times I could follow him in assured safety were limited. So my primary job was just... waiting.\nPrimarily, waiting for Tokiwa to come by and settle himself somewhere. He'd get suspicious if he saw me, obviously.\nI'd once had a part-time job counting people who boarded and got off the train, and that felt more worthwhile than this.\nThe funny thing is, though, I was going out more frequently for the sake of stalking Tokiwa, which soon ended up curing me as a shut-in.\nOf course, maybe it wasn't that severe a case to begin with.\nIronically, my personality brightened for a while after getting the idea of murder.\nI went to old clothes stores for changes of clothes to help with stalking, I studied up on tailing techniques from books and the web, I memorized city maps...\nIt was all just little stuff coming together, but maybe it had a good effect on my brain.\nIt hadn't had much in the way of stimuli before, but now it was starting to get a good workout with all that info.\nI suppose it was good to have a clear idea of what I wanted to do. Even if my objective was murder, at least I was working toward something - it had a positive effect.\nThe look of my face even started to gradually improve as a result. I rarely looked in the mirror after getting to college, so I never noticed the change at first.\nBut when my sister pointed it out, and I took a good look in the mirror, I did notice how I looked a little more cheery...\nAh, that's right. I've completely forgotten to talk about my sister. Maybe I should've brought it up earlier.\nMy sister, she'd undergone changes about as drastic as my own.\nFrom a certain perspective, I made her suffer more than anyone else.\n[+]",
      "scraped_at": "2025-11-20T20:34:45.820890",
      "content_scraped_at": "2025-11-20T20:34:46.282385",
      "error": null
    },
    {
      "id": "25",
      "number": "25",
      "title": "Chapter 25: * 25 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/25/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My memories of my sister were even clearer to me than those of my girlfriend. She played a rather important role for my first self.\nThe first time around, she was a frighteningly lively girl. She loved sunlight and exercise more than anything else, and would sunbathe all year.\nJust a big ball of energy. And merely having her around made me feel more upbeat myself.\nI wouldn't say her figure was all that \"feminine\"; it might've been that she didn't pay much heed to proper calorie intake.\nStill, she always had a smile on her face and not a care in the world, so guys liked her. My friends would always ask me to \"introduce them.\"\nHowever, when it came to the second time around... She became a gloomy, pale sister who preferred reading and shade, and had no courtesy whatsoever.\nIt would have seemed like a joke to anyone who knew about the first time. The sheer difference between them seemed even more significant than my own case.\nAnd I think it was my fault that my sister changed to be this way.\nWith her older sibling skipping school and generally demonstrating poor behavior, it's not surprising that would influence her, the younger.\nPerhaps my sister, as she saw her brother leaving the house with a face like death and coming home only to curl up in his room, lost all hope for the future.\nWith both brother and sister gloomy, our whole house would be up late every night.\nIt was awful, really. Nobody ever smiled. There was only the sound of cold, hollow laughter from the TV.\nOur parents lost confidence in their upbringing skills, even their own genes when they saw us.\nThey were wonderful people, though I know it sounds weird to say it like that as their son.\nBut with son looking like it was the end of the world, and daughter always reading and stuck in her shell, there was no chance they alone would remain bright and cheery.\nThat kind of thing warps people. My mother came to see me as a mistake and had great expectations for my sister, getting her a family tutor and all these other things which put pressure on her.\n\"Now don't you fail me,\" it felt like she was saying. It was a heavy burden for my sister, of course, and every time I saw it I felt like my whole existence was being denied.\nAs for my father? It seemed like he decided to give up on the family entirely. He ran off to his own world, started riding motorcycles.\nI didn't much care, and in fact I thought it was a good hobby. But he was hardly ever home on days off, and he neglected to so much as go shopping with my mother.\nIt was scary to see. Fights broke out every Saturday morning. Nobody could stop them.\nWhen I was seventeen, my father got in a pretty serious accident. He was hospitalized for a month, for which the house was inordinately peaceful.\nBut the day he was released from the hospital, my parents had a huge, huge fight, and more or less stopped talking to each other afterward.\nAnd I had to say it was all my fault.\nWhen I changed, it changed my sister, and us changing changed our parents. There was no need for those two to fight.\nBut telling them that wouldn't get them back together. They'd just think their idiot son had gone nuts to boot.\nThat got kinda sidetracked onto my parents, but I said this was about my sister, right?\nRight, well. Me and my sister used to be amazingly friendly. But in the second round, we didn't even look at each other, much less talk.\nI wondered if my sister hated me. On the rare occasion she did open her mouth, it was usually an insult.\nLike “Your face looks like crap,” or \"Your hair's too long.\" Rude things to say to a brother, I thought.\nAfter all, she looked more out of it than me, and she let her hair grow pretty unkempt.\nIt really was a saddening thing. I imagine a father hated by his daughter might feel the same way.\nBut it's also not surprising, I figure. I was just the kind of person it was perfectly natural to despise.\n[+]",
      "scraped_at": "2025-11-20T20:34:47.287629",
      "content_scraped_at": "2025-11-20T20:34:47.799609",
      "error": null
    },
    {
      "id": "26",
      "number": "26",
      "title": "Chapter 26: * 26 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/26/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "But one night, about a month after I started gleefully plotting my doppelganger murder project and tailing Tokiwa, my sister came alone to my apartment.\nYes, the same little sister who should have hated me.\nThe first snow of the season had just started to fall that day. Not long after I got out of the bath, I was feeling quite cold, so I turned on the heater for the first time that winter.\nHaving been ignored for months, it blew out bits of dust for a few minutes after switching it on.\nThen gradually the warm air started to flow, and the sweet smell of lamp oil filled the room.\nAs I huddled in front of the heater to warm up, the doorbell rang. I looked at the clock: 9 PM.\nWho could it be at this hour? I didn't have any friends who would visit me - maybe someone got the wrong room?\nThe doorbell rang again. Normally, I would ignore it, but I was feeling a little odd that day.\nI fixed myself up in the mirror, hurried to the entryway, and opened the door.\nPerhaps I was just longing to see someone. It didn't matter if it was a mistake or not; just having someone at my door made me happy.\nSo I thought we'd just exchange a few words before they left.\nBut no, it was my sister at the door.\nI was confused. The first thing that came to mind was that something terrible had happened with someone at home.\nLike our father died in a bike accident, or our mother came back home. And that she had come to tell me.\nWhen you live a life that has no good things for such a long time, you start to think you're always going to get bad news.\nMy sister, in only a uniform with a cardigan over it, let out a chilly breath and spoke, not looking at me.\n\"Let me stay here for a little while.\"\nI asked if her something had happened at home, and she just said \"Nothing happened\" over her shoulder as she barged into the apartment.\nShe scrunched her face at the foul combined odor from all the empty bottles and cans, the unwashed clothes, and the cigarettes, and began opening all the windows which I'd closed to keep the apartment warm.\nThe fact she was already cleaning things up around here made it clear she intended to stay for a while.\nI knew that unlike my first-life sister, she wasn't the kind who needed her brother's help for taking care of herself.\nI was sure the largish Boston bag she carried over her shoulder was packed with changes of clothes and all that.\nFirst of all, I got my sister something warm to drink, knowing she'd come through the cold.\nWhile she arranged the clothes I left strewn around the room, I filled a mug with hot water and stirred it with plenty of cocoa powder. She loved sweet drinks like that.\nShe took the hot cocoa from me with both hands and slowly sipped it. As I watched, I thought about what to say next. She peered into the cup.\nTo be frank, I didn't necessarily want to know why my sister had come by. It was sure to be a weary conversation.\nSome people might consider it a big brother's duty to listen to it anyway, but I was in no mood to fulfill that duty.\nI was so busy thinking about my own burdens that I had absolutely no desire to stick my nose into those of others.\nMy sister must have expected I would ask her why she'd come first thing. She seemed dissatisfied by how I hadn't asked a single question on it.\nWe met eyes. Hers said \"Come on, ask me something.\"\nUnable to bear the pressure, I reluctantly asked.\n\"Honoka, you aren't on winter break yet, right?\"\n\"Yeah. But I don't want to be in that house,\" she answered.\nAha. In other words, you're running away from home, I thought - but I didn't say it. I had this feeling that calling it that would just make her angry.\nMy second-life sister really hated having idiotic phrases like that used to describe her.\nBut it was surprising. It wasn't something I would have expected her to do.\nEven if things weren’t happy at home, she didn’t seem the kind to do something as pointless as run away.\nJust putting distance between her and the bad things, waiting for the worst to pass - that wasn't my sister.\nSomething really terrible must have happened, I thought anxiously, then quickly put away in the back of my mind.\nNothing to do with me, I told myself.\nOf course, that wasn't true, but I was absorbed with my own troubles.\n\"How did you get here, anyway?\", I asked. She replied typically, “Does that matter?”\nShe was right, though. It really didn't matter. I just asked it to dance around the heart of the matter.\n\"Dirty room,\" she said, looking around. She was an expert in judging her brother. \"And your taste sucks.\"\n\"Leave if you don’t like it.\" I replied just as typically.\n\"I didn't say that.\"\n\"So it's dirty and my taste sucks, but you don't hate it?\"\n\"Right. Smelly, dirty, ugly, but I didn't say I hate it.\"\nMy first sister would have cleaned it up without a word and cooked up some tasty food for us both.\nBut this sister of mine didn’t really want to come to my place. Like me, she probably didn’t have many friends, so this was her only option for running away to.\nWinter vacation hadn’t started yet, so I figured she wouldn’t stay long. Even so, she was a nuisance and I wondered if I could get her to leave any sooner.\nBut I didn’t have the guts to be harsh with her. The second time around, I was an utter coward.\nAnd my second-time sister was pretty scary to boot. She always had a sharp, quiet anger in her.\nIt was like a balloon I had to be very careful not to pop, and it made my stomach churn.\nI was powerless to stop my sister from tampering with things in my apartment, so I got a futon out of the closet for her.\nJust then, she came out of the bath, put on her pajamas, and dried her hair. When she saw the futon and the bed, she unhesitatingly chose the bed after two seconds.\nShe was already convinced it was her room.\nI reluctantly got in the futon and asked, \"How long you planning to stay here?\"\n\"I dunno,\" she said, pulling up the covers.\nAnd so we began living together, in a very strained kind of way.\n[+]",
      "scraped_at": "2025-11-20T20:34:48.804937",
      "content_scraped_at": "2025-11-20T20:34:49.267793",
      "error": null
    },
    {
      "id": "27",
      "number": "27",
      "title": "Chapter 27: * 27 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/27/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "At about eight the next morning, my sister shook me awake.\nSince we're talking about me, I had completely forgotten about my sister while I slept. One would thus expect I'd be startled to see a girl in my room, but surprisingly I wasn't very.\nWith a level head, I recalled the circumstances of my sister being there.\nBefore my waking eyes were even a third of the way open, my sister said \"Take me to the library.\"\nAfter a brief pause, she added “Right now.”\nShe seemed quite prepared for an outing. I hadn't seen her dressed casually in a long time.\nShe sat on the bed, her hands thrust in the pockets of a gray cardigan, her legs wavering out of her navy-blue short pants, and her soft shoulder-length hair swaying along with that movement.\nThey were particularly skinny legs, almost seeming artificial with the black tights pulled over them.\nI reluctantly got out of bed, took some unfolded dry clothes off a hanger and stuck them under my arm, headed for the bathroom.\nThe sink water was cold enough to kill a guy from shock, but it'd take a few minutes to get warm water. So I washed my face with that frigid water and quickly changed clothes.\nGeez, it was my own apartment. Why did I have to change in secret like this?\nI let out a few big sighs. I'd gotten into the futon last night not long after my sister, but ended up not getting much sleep.\nLike many shut-ins, I was a night owl, so a constructive \"sleep at 1, wake up at 8\" schedule was exhausting for me.\nBesides, for the past few years, I'd slept much more than I did in my first life. If I didn't get about ten hours of sleep, I was a mess.\nWell, maybe it's more probable that I unconsciously slept more not so much for health reasons, but because my time awake was so harsh.\nI wonder. Maybe humans can only wake up early when they have TV shows they want to watch, dates to go out on.\nIt's said that waking up early makes for a better life, but if you ask me, it's having a good life that allows you to wake up early.\nYet of course, even though I could tune out three alarm clocks at once, having a girl shake me awake will wake me up just fine.\nEven if she was my sister who I wasn't on good terms with, who was skipping school, who was running away from home, that didn't make a difference.\nI felt like it was the first time in a while I'd woken up in a human-ish way. It was common that I'd fall back asleep once or twice before actually getting up.\nAnd even after that, I often stayed on my bed reading or messing with my phone, so if you wanna be accurate, it usually took about ten steps to get from me waking up to getting out of bed.\nSo yeah, my sister waking me up and me getting straight out of bed was a pretty big deal.\nIt wasn't even December, but the air had a chill to it like it was already the middle of winter.\nAs we were about to leave, I realized how lightly-dressed my sister was and went to get a Mods coat for her.\n...When I put it like that, it sounds like I'm one caring big brother, huh? But to be blunt, I was just doing the bare minimum to look less terrible.\nMy biggest motivator was that I was scared of being blamed later, basically.\nMy sister looked at me holding the coat out as if to say \"Wear it yourself,\" then snatched it from me.\nThe sleeves were a little long for her, but it was a pretty slender coat, so it didn't look too odd.\nI put on a pea coat I'd worn since high school, lazily tied the shoelaces on my boots, and opened the door.\nThe cold wind hit my skin, and in seconds I was shivering. We got in the car, I turned the heat all the way up, and we sat together until we were warm.\n[+]",
      "scraped_at": "2025-11-20T20:34:50.280493",
      "content_scraped_at": "2025-11-20T20:34:50.829296",
      "error": null
    },
    {
      "id": "28",
      "number": "28",
      "title": "Chapter 28: * 28 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/28/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My sister’s first words once in the passenger seat of the Mini Cooper were “Stinks like tobacco.”\nThat wasn't my fault, though. My dad used to drive it, and ever since it was passed to me it'd smelled like that.\nLooking in the back seat, though, her fourth was “Dirty.” And that was one hundred percent on me.\nThe back seat was a mess: textbooks and materials for my classes, convenience store bags of water bottles and empty bento boxes, even tossed-off jackets and shoes.\nThere were times I did sit in the car for long periods as part of tailing my double, but the real problem was that no one but me ever rode in the car.\nIf I had someone who I was consistently driving around in it, even I'd make an effort to keep it clean, probably.\nIt's the same kind of thing as how if you want to be fashionable, you take a job that puts you in front of people.\n\"It stinks and it's dirty,\" my sister repeated.\n\"Tells you a lot about the owner\" was the implication. She was something, alright.\nBut I'd say she's right, that the disarray of an apartment or a car reflected the mentality of the owner.\nIf you had a \"+50 life,\" you'd likely fuss over little things to get it up to +51. But if you're at -50, it doesn't seem all that worth it to shoot for -49.\nThe 9 AM sky was cloudy, and everything was shrouded in a light fog.\nMy sister continued to complain on the way to the library.\nSaying that my coat smelled like cigarettes too, and that wasn’t I going to play some music or something?\nBut if I popped in some of my CDs, I knew it'd just open up a new wave of complaints.\nIf I wanted my sister's approval, I'd need to play music in the vein of Sigur Rós or Múm. But unfortunately, I didn't have any of that.\nI continued to ignore her, and she hit me with a tissue box. \"Listen to what people say,\" she said.\nI swear, the only time she was ever this arrogant was when she was alone with me. A braggart only to her bro. A broggert?\nWe arrived at the municipal library. She muttered \"So small\" when she saw it, but at least it wasn't a complaint directed at me.\nI'd gone there to research things for my college homework once before, so I already had a library card.\nI told her \"Pick out whatever books you like,\" and for once, she obediently nodded \"okay\" before vanishing into the bookshelves.\nMyself, I went looking for some books too. I went up narrow stairs to the second floor, where with each step the floor creaked.\nThere was a young girl sitting on a chair between the bookshelves along the wall, reading a bulky book.\nAt first, I mistook her for a sculpture and stared for an unfortunately long time. When she glanced my way, I finally realized she was a person and hurried away,\nWhen I went to check out my books and saw the return-by-date calendar, I realized for the first time that it was Wednesday.\nIndeed, when you don't make any plans in your life, your sense of days leaves you, even blurring the line between normal days and holidays.\nSo when it gets bad enough, you forget what day of the week it is.\nIf it's Wednesday, I thought, then that class must be starting about now... It was my fifth time skipping it. Oh well.\nRegardless, it was a strange thing, a college student and his high school sister visiting the library early in the morning on a school day.\nMost of the people in the library were elderly, so I wonder how they must have seen us?\nAfter about thirty minutes, I went to look for my sister, and found her deliberating in front of a bookcase.\nI asked “Done yet?”, and she hit me with a book. “No talking in the library!”\nThat was my second-time sister in a nutshell, I suppose. First time it would've been \"Oh, please, hold on a little longer!\"\nAbout twenty minutes later, we were finally able to leave the library.\nAll she seemed to want to do was spend the whole day reading in my apartment.\nAs soon as we returned, she plopped on the bed, sat against the wall, and engrossed herself in a book as thick as some dictionaries.\nShe had really changed, I thought. But it wasn't so surprising anymore.\nI figured it'd be fine to leave her be, so I quietly went to leave.\nShe looked up and asked “Where you going, big brother? School?”\nI couldn’t very well say “I’m going to stalk this guy I want to murder so I can learn his habits,” so I said “Yeah, that. I’ll be back at seven.”\n\"Hmph,\" she mumbled suspiciously. \"Still... sounds sorta fun. Gonna see anyone you know there?\"\nHonestly, that was exactly what I didn't want her to ask about.\n\"A college friend. I got to know them on the festival day last month,\" I said while thinking it up.\nAt times like these, it was best to lie with hints of the truth.\n\"Never hit it off with somebody so well before. It's just like, we know what the other's thinking, just like that. It's great to have at least somebody like that. Yeah, they're a close friend.\"\n\"Huh. Or at least... that's what you think about them, huh, big brother?\"\nMan, there was something just so disagreeable about how she said that.\n\"Yeah, I guess. At least I think of him as a close friend.\"\nStill, it was odd. I hadn't thought she would care in the least where I was going, what I was doing.\nWas she starved for conversation, maybe? Or maybe while I was gone, she was planning on doing things she wouldn't tell anyone.\nI didn't know, at any rate, and I didn't care.\nShe could do what she liked. I had my own things to attend to.\n[+]",
      "scraped_at": "2025-11-20T20:34:51.844409",
      "content_scraped_at": "2025-11-20T20:34:52.517674",
      "error": null
    },
    {
      "id": "29",
      "number": "29",
      "title": "Chapter 29: * 29 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/29/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I wanted to settle this doppelganger problem within the year.\nThe longer I let it go on, the harder it would be to execute.\nIn addition, if I could kill Tokiwa before December, they wouldn't get to spend Christmas and New Year's together.\nNo doubt, if those joyful days came along and I was reminded of how my first-life self and Tsugumi spent them, I would be hit with the worst depression of all.\nI wanted to avoid that if at all possible.\nAnd it was hardly an impossible proposition. By now, with my daily tailing, I had a very good grasp on Tokiwa's daily rituals.\nTo be honest, I had long been in stellar condition to execute the plan. But a minimum of three times, I passed up a chance to kill him that had very little risk.\nJust as I predicted, Tokiwa's habits were extremely similar to mine. He liked to look down from high places, so there were many times he stood on the bridge gazing at the river, or on steep roads down at the residential district at night.\nIn my opinion, it was almost like he was just asking to be killed. Maybe God was on my side at this point, I thought.\nAnd yet I was simply unable to carry out the plan. Probably I couldn't make up my mind to take the plunge.\nThe thing is, there was one other thing I was after in tailing him. I wanted to see Tokiwa's faults.\nI was waiting for him to show me some kind of defect.\nTo justify my actions, I wanted him to give me some reason, any reason to believe that he was someone who deserved to die.\nIf only I could find just the slightest reason why killing him was worth it.\nBut the trouble was, I went a whole month looking and looking, but he didn't show me a thing. Didn't even get haughty about his lack of faults.\nI dunno if he was even conscious of it, but Tokiwa appeared to be very careful about how he presented himself.\nTokiwa's greatest weapons were a polished smile that immediately took down anyone's defenses and a harmonic voice that everyone wanted to listen to, yet he dared to keep them in check most of the time.\nAnd at critical moments, he would bring them out in a very targeted way, leaving a deep impression on those around him.\nNaturally, people took notice. But he never gave them time to get accustomed to that charm; he pulled it back before they did.\nBy doing this, he let people's imaginations swell, and they began to think that he had even more charm than he really had.\nIt was magnificent, honestly. It taught me that when you have visible charms, it's better to show them off from time to time like a reminder, rather than keep them on at full blast.\nA useless technique for someone who doesn't have any charms, hidden or otherwise, though.\nI hate to admit it, but he was one hell of a guy. Even with all my hate, I still held some esteem for him.\nNo doubt everyone else saw Tokiwa as a very charming individual.\n[+]",
      "scraped_at": "2025-11-20T20:34:53.537731",
      "content_scraped_at": "2025-11-20T20:34:54.143394",
      "error": null
    },
    {
      "id": "30",
      "number": "30",
      "title": "Chapter 30: * 30 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/30/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "So that was another day of doing nothing still.\nWhen I returned to the apartment and opened the door, the smell of a tasty dinner like only my sister could make... is what I hoped for, but instead I was just told \"I'm hungry, make something.\" She again added \"Right now.\"\nI'm really not much of a cooking person, so I just warmed up some apple pie from the fridge and scooped some vanilla ice cream.\nShe looked at the apple pie and asked \"What about veggies?\" \"Got none,\" I told her, and after some thought, she said \"That's no good.\"\nShe probably meant to say \"Are you stupid or what?\", but being a freeloader in my care, she must have decided to hold back for once.\nAfter drinking some coffee after the meal, she stared right at me. Her eyes told me \"I want to talk, but I don't want to start.\"\nSo I started. \"What's up?\"\n\"Don't you have a girlfriend, big brother?\"\nWhat a thing to ask out of the blue, I thought.\n\"Nope. Unfortunately.\"\n\"...Sorry to push it, but have you never had a girlfriend?\"\nI had an ideal one in my first life, I wanted to tell her.\n\"Yeah. Never.\"\n\"Why?\"\nWhy, she asks... That's got to be the worst way to talk to someone loveless.\nIn my second life, I couldn't help finding it odd how everyone else was able to find love one after another.\nThe first time I thought nothing of it, just having my ideal girl right there next to me, but now I was like, how dare everyone find someone perfect for them?\nYes, in my eyes, people with lovers are much more of an oddity than those without them.\nHonestly, sometimes I kinda want to say \"Is that really gonna be alright?\" Not that anyone wants to hear this, but it seems to me that two people hitting it off for their whole lives would be a really rare occurrence.\nSuppose there are lots of such a people who that happens to frequently. Aren't they hollow, in a sense?\nThe way your values get shaped over the course of your life, it's like painting a picture. That picture gets filled with what makes you you, so everyone's is different.\nSo if you and someone else's pictures match up perfectly, that's gotta mean you're just both blank canvases.\nOr else you're so unimaginative, you just painted the most boring pictures ever.\nI'm not convincing anybody of anything from where I stand, of course. Just an idle complaint, I suppose.\nI'm just a fussy, bored, lonely self-analyticist who never thinks of anybody but himself.\nRight, where were we... My sister asked me \"Why?\"\nWell, the number one reason was that I couldn't possibly consider anyone but Tsugumi as my girlfriend now. But it wouldn't do any good to tell her that, of course.\n\"Not sure there's a good reason why,\" I said.\n\"So you haven't even had a crush on any girls or anything?\"\nI shook my head.\n\"You can't think of a single one?\"\n\"I guess not.\"\n\"Then... I dunno, an agreeable girl, at least?\"\nAn agreeable girl, huh.\nThat did bring something to mind.\nThough I'm sure it wouldn't be what my sister was expecting to hear.\n[+]",
      "scraped_at": "2025-11-20T20:34:55.160058",
      "content_scraped_at": "2025-11-20T20:34:55.687369",
      "error": null
    },
    {
      "id": "31",
      "number": "31",
      "title": "Chapter 31: * 31 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/31/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "This part of the story goes back to when I was at my most miserable: high school.\nWithout exaggeration, I had not a single friend in high school the second time around.\nBut it's not that all my classmates hated me. The problem was my idiotic pride.\nYou're probably gonna laugh, but I thought friends were something that would just flock to me. Had nothing to do with arrogance or kindness, and I didn't imagine I'd have to talk to them first.\nMy first life was a bad influence there. I used to be waaay too popular.\nOf course, even as the not-sharpest tool in the shed, I eventually did notice that yeah, I wouldn't make any friends without starting the conversation.\nAnd by the time I realized, I did have half a chance left. I could tell the sorts who hung out in the corner, if I just went and talked to them, would readily accept me as a friend.\nBut ultimately, I didn't do that. Why? Good old pride, of course.\nIt's the dumbest thing, I'll agree with you there. But I would've rather died than talk to those clowns.\nI always thought of myself as a handsome guy. ...Well, honest, I'm not really any less convinced of it now.\nNever mind for now how true it is, it's what I think, and it's helped me a fair bit.\nBesides, if nobody's gonna love me, I gotta love myself, right?\nAnyway, point is, I thought a handsome guy like myself starting a conversation with those fools just wasn't fair.\nNaturally, from their point of view, I must've seemed like an even bigger fool.\n[+]",
      "scraped_at": "2025-11-20T20:34:56.694610",
      "content_scraped_at": "2025-11-20T20:34:56.990037",
      "error": null
    },
    {
      "id": "32",
      "number": "32",
      "title": "Chapter 32: * 32 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/32/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "You'd know it if you went through it, but high school without friends is frankly hell.\nCollege, in comparison, it's not so much of a problem being all alone.\nIt's often said that loneliness is something you get used to, and isolation is something you can't.\nStuff like spending holidays alone you can endure for days no problem, but when there's people all around you and you're the only loner... you can't just numb yourself to that.\nSo then how did I bear with this miserable situation? In yet another thoroughly lame way.\nThere was one girl in class who was similarly isolated, named Hiiragi. She didn't have a friend to her name either.\nShe looked like she was always thinking \"I don't hope for anything from this world anymore,\" reluctantly pushing through high school. That was Hiiragi.\nI'd say she was on the short side, with eyes that hurt easily. She was always looking down, and when she had to look people in the eye, she practically glared.\nAnd with her frail, no-confidence voice, she often talked in a halting manner. \"I, uh, think that's, fine. ...N-No, that won't be... a problem.\"\nIt seemed she made a careful effort to pick the most average, unprovocative words as she spoke, but it made people see her as a bother.\nMyself, I spoke bluntly so I wouldn't have to talk as much. At a glance, we were polar opposites in that sense, but it came from the same roots.\nHiiragi went to the same middle school as me, and just like me, she wasn't totally alone then. She followed the same pattern of being separated from her friends in the transition to high school.\nWhen I was ignored in the classroom, I felt it severely. And those were the times when I looked over to Hiiragi.\nHiiragi, my only company. Seeing her alone in the corner of the class was a huge comfort for me. At least I'm not the only one, I could think - that was such a relief.\nNo, that's not quite right. If you want to know the truth, it's also thanks to Hiiragi being there that I convinced myself that I wasn't at rock bottom in the class.\n\"I've got it real bad, but hey, better than her,\" I thought to keep myself stable. What a deplorable thing to do.\nHowever... This could just be my own deluded impression, but I think she was doing the very same thing with me.\nIn situations that made us more strongly aware of our isolation, like class activities and event preparations, Hiiragi and I would happen to make eye contact.\nNo doubt Hiiragi was looking upon me as the one person even lower than her.\nOr at least I felt certain that when she looked at me, she was reassured with the thought of \"Ah, he's isolated too.\"\nSo in that sense, I might dare to say we \"hit it off.\" In a very twisted definition of it. We were scapegoats for each other.\nI looked down on her thinking \"She's in a similar place, but as a woman she must have it worse\"; she looked down on me thinking \"He's in a similar place, but I'm still better in academics\"... that was the situation.\nIt may be my persecution complex talking, but you'd know with just one look at those eyes. They were judging eyes. I'd know, because mine are the same.\nIn my first year, before I was accustomed to being alone, I'd scurry off at lunch to the library to waste time studying.\nAnd actually, Hiiragi often did too. We came to see each other there frequently. Not like we talked or even greeted each other, but we acknowledged each other's existence.\nOnce every few months I would be struck with terrible depression, upon which I'd go to the infirmary (though not physically sick) and take my afternoon classes off.\nWell, about a third of the times I did that, Hiiragi was there at the same time. It was awkward - seemed like we'd decided to skip class together.\nBut there was a lot of overlap between the classes we each wanted to take a break from, so it wasn't unreasonable.\nFurthermore, my relationship with Hiiragi got closer in second year.\nOur homeroom teacher arranged for a change in seating; students could choose to either draw lots, or pick for themselves.\nHowever, those who freely chose their seats were restricted from sitting in the very back row.\nNaturally, then, the people who ended up in the back row were people who didn't really care where they sat. And for friendless people, any seat in the corner will do.\nSo Hiiragi and I always ended up sitting together. It might have been almost ten times, adding up second and third year.\nPeople started to see us as a pair, and I heartlessly thought \"Whoa, don't put me with her.\"\nThough what I would say was that sitting next to her put me at ease.\nFor example, in classical literature or English classes, you often have to read with a partner, right?\nThat was usually agonizing for me, but when Hiiragi was my partner, I wasn't so nervous.\nWhen partnered with others, I'd worry about my voice squeaking, or my attitude being too blunt, or if they were upset about being paired with me, and all that nonsense.\nBut with Hiiragi, I could just think \"Geez, she's so unsociable\" - talk about the pot calling the kettle black.\nAt the root of all things which soothe us is a sense of reassurance, the feeling that it \"won't hurt me.\"\nIn that sense, Hiiragi was soothing for me like no other.\n[+]",
      "scraped_at": "2025-11-20T20:34:57.992712",
      "content_scraped_at": "2025-11-20T20:34:58.492183",
      "error": null
    },
    {
      "id": "33",
      "number": "33",
      "title": "Chapter 33: * 33 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/33/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "When it comes to this stuff, you might be thinking I'm some jerk who's way too self-conscious about his assumptions.\nAnd I say this with full recognition of that: I believe Hiiragi and I lived by leaning on each other's shoulders.\nBy our third year, while we didn't make much of a show of it, we started picking the same committees and duties.\nEven when our seats changed, we tried to sit as close as possible. There was an implicit agreement that when times were tough, we would \"use\" each other.\n\"You don't really have to be friends with me, but please be there when I need someone,\" that sort of thing. Ah, but I'm romanticizing it far too much...\nIt's probably closer to \"Hey, you're a loner too, right? As fellow miserables, I guess we should keep company.\"\n\"Welp, at least this person won't ditch me and run\" - our relationship had that warped sort of trust.\nWe eventually developed - not affection, certainly, but a deep kind of sympathy for each other, I think.\nIf we hadn't, then surely we wouldn't have stayed together to keep ourselves from being all alone.\nAnd isolation wasn't the only common point between Hiiragi and I. Even the quality of our isolation bore a resemblance.\n...What I think is, the reason we couldn't get accustomed to the classroom was because we had both thoughts of \"somewhere that wasn't here.\"\nIt came to mind that there was \"a place much better than here\" somewhere, and it became a huge hindrance since we were stuck \"here.\"\nI was constantly thinking about the happy days of my first life. As such, my view of the world was duller than usual, and I had little attachment to the \"here and now.\"\nAnd I wondered if Hiiragi might be thinking something similar - why else would she be so isolated?\nI'm sure people who got to see her smile were pretty rare, but I was one of the few. After three and a half years, we were able to be just a little frank with each other.\nAnd so just once, by chance, I was able to bear witness to her smile.\nWhat a shame, I thought. If she wore that smile all the time, I bet it wouldn't be hard for her to become the center of attention in class.\nThat's the kind of charm her smile had. When I first saw it, no joke, I was shocked. All like \"Wait, you're THAT cute?!\", you know.\n[+]",
      "scraped_at": "2025-11-20T20:34:59.497231",
      "content_scraped_at": "2025-11-20T20:35:00.050735",
      "error": null
    },
    {
      "id": "34",
      "number": "34",
      "title": "Chapter 34: * 34 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/34/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "The day I got to see Hiiragi's smile was in the winter of my third year of high school, the day we had our graduation rehearsal.\nWhich means, yes, that for the three whole years leading up to her, I never once saw a smile out of her.\nGraduation... Well, I'd be hesitant to say it was an emotional event for me.\nThere could be nothing sad about leaving that school behind, and yet I wasn't outrageously happy either. I just kinda thought \"Man, what an awful three years.\"\nI had so little attachment to the school I went to that I almost wondered if I was really a student there.\nI kept thinking about it, and I didn't even feel like going to the rehearsal anymore.\nWhile everyone headed for the gym, I slipped out of the line and went to the music preparation room.\nIts door was always wide open. In my third year, I spent a lot of lunch breaks there.\nI waited there for the rehearsal to be over. If someone who hardly seemed to exist didn't show up to it, absolutely no one would notice, surely.\nOf course, by now I didn't care what anyone thought of me. It was almost graduation, after all.\nThe music preparation room was dark even in the afternoon. If you closed the door, it took a while for your eyes to adjust.\nThat's part of the reason I liked the place. I also loved how the instruments, once in the forefront, were now rotting in decay here.\nLots of \"instruments we won't use anymore, but it'd be a waste to throw them away.\"\nSitting in an upright chair, resting on my elbows on the cover of a keyboard, I stared into space.\nIt took nearly five minutes to notice Hiiragi in the corner of my vision.\nWhen Hiiragi and I met eyes, I can't really remember who smiled first. We always had sour looks, but for some reason we couldn't keep from smiling there.\nI guess we were relieved to learn there was someone else who didn't feel a thing as graduation was coming up, and found it humorous that we both sought escape from it.\nThe ruins of something lost - that's the image Hiiragi's smile planted in my head.\nLike there had once been this madly wonderful thing, and while it was now totally destroyed, she treasured a part of its ruins - kinda like that.\nOf course, once we exchanged smiles, we quickly looked away and went to doing our own things.\nI struggled to play a dust-coated classic guitar with no first string, and she played a sunbaked electronic organ with the volume set low.\nI wasn't surprised to see Hiiragi playing like a natural.\nThere was a second-hand CD shop nearby which I'd often visit after school, not being in any clubs. And as I stood there with a CD in hand staring at a cover, Hiiragi would be standing behind me doing the same - silly, but that kept happening.\nSince there was so little space between the shelves in that place, it made sense our paths would tangle. But we never said a word to each other about it.\nI watched Hiiragi play the organ. I couldn't see her face, but even just from her back, I'd say she was slightly more at peace than in the classroom.\nI had to admit, things were getting a little warm between us. You would probably think it natural that after all this, we'd be friends.\nBut as I've said before, to the very end, Hiiragi and I never had a single personal conversation.\nWhy did we always stay at such a distance?, I thought. At least for my part, I could probably just explain it as a lack of trust.\nHowever, I wasn't distrusting of Hiiragi. What I couldn't put my trust in was, as ever, people's affections.\nBecause I'd been separated from Tsugumi, who I loved and vice versa so much in my first life. That ruined everything.\nNo matter how much we got along, they could someday leave me. So I was scared to even try getting deeply involved with anyone.\nThe friendlier the person, the more I feared their betrayal. Thus, I stayed just far enough away from Hiiragi.\nIt's as stupid as saying you'll never get married because you don't want to get divorced.\nBut I wouldn't change my mind. A relationship where we weren't too attached, just mutually looked down on each other from a distance, seemed best for me.\nI remember that afterward, we were both scolded by a teacher for skipping the rehearsal.\n\"Think you can do whatever you like with graduation coming?\" and so on, \"How are you going to make it in college?\" and so forth.\nI listened in silence with my head low, embarrassing myself with the thought that the teacher might mistakenly believe there was a romantic thing between Hiiragi and I. Hiiragi looked the same way.\nIt was a stupid, stupid time, high school.\nAt graduation the next day, Hiiragi and I left the classroom right after the greetings. We were the only ones to leave that early, and as the only two in the hall, we naturally made eye contact.\nI felt I saw her mouth the words \"See you.\"\nThat's about it for my memories of Hiiragi.\nAnd how it wasn't necessarily that I'd never found any girl \"agreeable.\"\n[+]",
      "scraped_at": "2025-11-20T20:35:01.055267",
      "content_scraped_at": "2025-11-20T20:35:02.514396",
      "error": null
    },
    {
      "id": "35",
      "number": "35",
      "title": "Chapter 35: * 35 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/35/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "\"Then... I dunno, an agreeable girl, at least?\"\nUltimately, I didn't answer my sister's question.\nThis explanation may not suffice, but... when it comes to certain subjective thoughts, they lose their perceived magic when you tell them to someone else. I didn't want that.\nIf I wanted to keep that magic alive, I'd have to choose my words very carefully, tell the story very prudently so as not to get anything wrong.\nBut at the time, I didn't have the will or energy for that, so I just kept my mouth shut.\nAnd besides that, talking about Hiiragi would mean touching upon my awful high school days, so I wasn't exactly enthused anyway.\nMy sister and I finished dinner and sat on the bed together, reading our books from the library.\nIt was awkward to be so close together, but admittedly it was the best place to read in the apartment.\nShe'd pulled the plug on the TV, so all I heard was occasional page flips and the heater running.\nLuckily, the other tenants here made as little noise as I did. It was a blessing for someone as oversensitive as me.\nI was reading a book on doppelgangers.\nIt said that they have the following characteristics.\n- They don’t talk to anyone around them.\n- They appear in similar places as to the original.\n- If the original meets the doppelganger, they will die, and the doppelganger will become the original.\nAs you can tell from a little bit of thinking, these all applied not to Tokiwa, but to me.\nI had no friends and rarely talked to anyone.\nWe went to the same university, so we appeared in similar places.\nIf one of us had to die, it’d be him (because I’d kill him).\nAnd he appeared in every way like me from my first life.\nGiven this, was he the original and I the doppelganger?\nI looked up from the book and noticed my sister peeking at me. She was curious about what I was reading. It wasn't really in my character to read, after all.\nI asked her, \"What are you reading?\"\n\"...You wouldn't know if I told you,\" she said.\nIt sounded bitter, but it was the truth. I looked at the cover, and it was by some author I'd never heard of.\nStill, I wondered, what was the deal with those questions earlier? About having girlfriends and crushes...\nThinking about it, it was kind of miraculous she would ask me of all people that kind of thing.\nSecond-time sister was absolutely not a girl who cared about her brother's love life. In fact, she would purposefully avoid that stuff.\n\"What was with those questions, anyway?\", I asked, my eyes still on my book.\nInstead of answering, she asked me, \"Big brother, do you have any friends?\", turning toward me and pulling her legs down.\n\"Besides the \"friend you made last month on festival day\" or whatever. Any other friends, like the kind you could invite over?\"\nIt was a painful question to hear. Please just don't go there, I thought.\nAnd the way she phrased it, she seemed to know that what I told her about my \"close friend\" was a story riddled with lies. Man, I felt so defeated.\n\"No friends I could invite over,\" I replied, but dared to say in such a way as to imply I had any other friends.\nAnd of course, my sister pushed further on the point I wanted to be asked about least. \"Then do you have friends which you just can't invite over?\"\nNow I had to reply honestly. \"No, no friends. I'm ashamed to say not a single one. ...And the guy I got to know at the festival was a lie too. God, I should have just said that from the start.\"\nI expected my sister to make fun of me. To shower me with scathing comments like \"You think you're going to make it in society?\" and \"And you know why you don't have any friends?\"\nBut the words out of her mouth showed no such scorn or abuse.\n\"Huh. So the same as me, then.\"\nAnd with that, she returned to her book.\nTo an extent, I could have anticipated that my sister had no friends, but it was very surprising that she would reveal it to me so openly.\nI was bewildered. I tried to think of some kind of reply to that. Because it was definitely odd that my second-time sister would tell me such a thing.\nThere had to be some important meaning to it.\nShe had said it very casually, yet I'm sure it took guts. I mean, she was usually so loath to show her weaknesses.\nIf I'd just asked her out of the blue \"Honoka, do you have any friends?\", she'd normally give some reply like \"And what are you planning to do with that information?\"\nBut before I could say anything tactful, she placed her bookmark and crawled under the covers.\nShe got me off the bed - \"I'm sleeping now\" - and pulled the sheets over her head.\nShe looked like she was angry, but she also looked like she was depressed.\nAbout thirty minutes later, when I was sure she was asleep, I went outside and smoked, shivering under a streetlight.\nI couldn't tell the difference between my usual chilly breaths and the smoke.\nI thought over my sister's words.\nPerhaps she visited my apartment out of loneliness, I thought. Of course, I didn't think she was \"darling\" enough for that to be the case.\nBut for my first-life sister, it would be a reasonable motive. And they were fundamentally the same person.\nFriends, huh.\nI took one last puff and put out the cigarette. The smoke hovered indefinitely about two meters in the air.\n[+]",
      "scraped_at": "2025-11-20T20:35:03.537674",
      "content_scraped_at": "2025-11-20T20:35:04.391521",
      "error": null
    },
    {
      "id": "36",
      "number": "36",
      "title": "Chapter 36: * 36 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/36/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My memory's not entirely clear on this, but I had so many friends I was sociable with in my first life that it was unbelievable to me now.\nAt the very least, I think I was friendly with nearly everyone in my department and clubs. And at the time, I saw each and every one as having their own good qualities.\nBut now, looking at them from a bit of a distance, they all seemed like good-for-nothings. Most of them seemed entirely unlikable.\nOf course you'd see those whom you have relationships with as good people, and those you don’t as bad people.\nStrangely enough, that idea comforted me. Hah. So the first me wasn’t so blessed in everything after all, I thought.\nMiserable as it was, I found joy in that.\nMy first self was convinced all his college friends were great guys. He earnestly thought \"I'm so lucky to be surrounded by all these good people in college.\"\nBut from my point of view, they were all lowlifes in one respect or another.\nPeople I used to think of as kind were a big ball of ego. People I used to think of as humble were attention-seekers.\nHowever, I’m just speculating, but I don’t think it was necessarily wrong of me to feel that they were good people in my first life.\nWhen your life isn't going well, you have a negative outlook on everything, so badness will stand out - of course, it was certainly still there. But that's not the only thing.\nI wonder, if you put someone in front of a truly superb person, can they temporarily become better people by unconscious influence?\nPerhaps when they stood before me in my first life, they were truly good people.\nBut in front of people like the present me, they’d feel less pressure and revert to trash.\nI’m not too sure what point I’m trying to make, but there you go.\nPerhaps that if you feel someone isn’t a good person, you carry some degree of responsibility for that.\nYet there are those who seem to acquire more and more charm regardless of their relationships... Naturally, I’m thinking of Tsugumi.\nThe more unattainable something is, the more you want it. I believe that in my second life, I came to love her more than I had the first time.\nYes, it wouldn’t be much of an exaggeration to call it worshipping.\nI'm not sure I could say what was most charming about her. I'd consider every little thing that made her up charming, but I was looking with rose-colored glasses.\nI could talk about \"a smile like flowers blooming,\" but it was my head that bloomed when I saw it.\nSince my mind was always a flower patch in front of her, I couldn't possibly compare to say what stood out more.\nEven objectively speaking, Tsugumi was beautiful. But if you asked me to explain why \"no one else would do\" even though there are lots of other such girls, I'd be lost.\nTruth is, it's hard to talk about what charms you in a person. Much easier to talk about somebody you don't like.\nIt's repulsive, but I won't lie: I copied only the pictures of Tsugumi from my middle school yearbook and carried them around with me all the time.\nAnd I'd look at them and imagine what it'd be like if she were there with me now.\nYou'd think it'd make me lonelier, but to me the girl in the pictures was someone different from the one that actually existed.\nKind of like a symbol of the happiness from my first life.\nThis time - THIS time, I wanted a chance to start my life over.\nThat’s what I thought. This time I would do it right.\nI returned to the apartment, sank into my bed, closed my eyes, and prayed another night.\nPrayed that when I woke up, I’d get my third chance.\n[+]",
      "scraped_at": "2025-11-20T20:35:05.413260",
      "content_scraped_at": "2025-11-20T20:35:06.101465",
      "error": null
    },
    {
      "id": "37",
      "number": "37",
      "title": "Chapter 37: * 37 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/37/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Of course, there would be no third loop. It was a once-in-a-lifetime... uh, I mean, a miracle that would only happen once.\nSo I woke up the next day, and the day after, to repeated dejection.\nIt had been five days since my sister fled home. By then, she was starting to become a bother.\nWhile she was around, it was a near-daily back and forth between the library and the apartment, and I had to prepare food for us both.\nNot to mention I had the desire for alone time about ten times as frequently as the average person.\nNo offense to her, but I wanted to be alone already.\nThat night I worked up the courage to ask “When are you going to get out of here?”, but received a kick and a “You get out, big bro.”\nGeez, my bad.\nBut not long after, I got a call. It was from our mother, and of course, it was about my sister.\nShe irritatedly asked \"Did Honoka come by there?\"\nI hesitated for a second, but before my sister heard, I told her \"She's been here the past five days.\"\nAnd so I was instructed to take my sister home. She said to lend her some money to get home if she needed it, and I said okay and hung up.\nWhen I put down the receiver, my sister looked away and pretended she hadn't been listening.\nBut about twenty minutes later, she sluggishly stood up. And she started getting her things together, with a look like \"I should be going, shouldn't I?\"\nI was relieved. She was actually pretty understanding in that respect.\n\"Do you have enough to get home?\", I asked.\nShe didn't reply. Must have been mad, about me telling our mother where she was.\nWhile she didn't seem to want me around, I went with her as far as the bus terminal.\nThe snow was really bad, and the road wasn’t well-lit, so I was worried about my sister going alone.\nWe walked at a very strange distance from each other that I’d be hesitant to call “together.”\nAs ever, we said nothing to each other as we walked the roads filled with fallen leaves.\nMy sister seemed very bitter. Well, she'd hated me for so long, it was fine.\nBesides, as someone who was planning to kill a man, I couldn’t be worrying about what every single person thought of me.\nThe bus terminal was wholly decrepit.\nThe walls and floors were blackening in spots, the lights were yellowed, the cushions were torn open, and drab shutters were pulled down on all the shops.\nThe few people waiting for the bus were dead silent.\nWith all the gloom about, it almost felt like everyone here was trudging back home after having run away.\n\"Dirty place,\" my sister quietly said. \"Like your apartment.\"\n\"Hey, it's got feeling,\" I argued for my apartment.\nMy sister and I sat on a sofa, about 40 centimeters apart, and drank coffee from a vending machine as we waited.\nIt was a terrible place. I wondered if a ride on the buses here would take you back decades or what.\nI mean, if they really did, I would have gladly gotten on. Any time but now sounded great.\nWhen I was done with my coffee, my sister reached over to grab it, stacked my cup with hers, and went to throw them away.\nI watched her briskly walk from behind. She seemed a lot less dependable than my first sister. Like I could just give her a shove and she'd topple over.\nShe came back and sat beside me again. This time, it was more like 20 centimeters apart.\nSuddenly, I felt like I’d done something absolutely terrible to my sister.\nHad I even considered that she was a sixteen-year-old girl who ran away from home?\nShould I, in fact, have lied to our mother?\nShe didn’t seem like the kind to run away from home in the first place.\nAnd it might be a huge assumption - but she had come to me, hadn't she?\nPerhaps I should have at least sheltered her until she was satisfied?\nI stole a glance at her, and we made eye contact, upon which she grumpily looked away.\nI hesitated to take her back to the apartment now, after promising our mother.\nSo I at least wanted to say something before she went.\nBut I had no idea what to say. \"Be happy\" would be a laugh coming from me. And I rather die than have it said to me.\nAnd \"Don't think too hard\" wouldn't mean anything from a fool like me.\nI spent the whole time thinking it over.\nThe time passed in a blink, and my sister stood up to board the bus. I stood up too and followed with her.\nThere were still bits of snow outside. I was briefly blinded by the headlights of the bus in the dark.\nJust as my sister was boarding the bus, I said, loud enough to hear over the engine, “Hey.”\n\"If you want to run away again, feel free to come over.\"\nEven this took a lot of courage for me to say.\nI was a coward even in front of my family the second time around.\nMy sister turned around, and for once, opened her eyes wide.\nShe stood still and looked at me for a second. \"I’ll do that,\" she smiled, and got on the bus.\nThe bus left, and I set on my way home, again warming myself with cocoa.\nI was all too relieved just to see my sister smile.\n[+]",
      "scraped_at": "2025-11-20T20:35:07.111967",
      "content_scraped_at": "2025-11-20T20:35:07.663541",
      "error": null
    },
    {
      "id": "38",
      "number": "38",
      "title": "Chapter 38: * 38 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/38/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My sister seemed to count on my word, as three days later, she visited me again.\nAs for what she did at my place, she studied, read, and, when she felt like it, went through a laundry list of insults concluded with “You’re hopeless, big brother.”\nThen she enjoyed my dinner, occupied my bed, and snoozed away.\nThe next day, our father came and took my sister home.\nI didn't know how he treated her, but he didn't show any intent to scold or be nice to her; he just drove her home in silence. Yeah, it looked awkward, alright.\nThis only made me certain that she’d come right back. As predicted, she was knocking on my door again five days later.\nBut I didn't really mind. Having my sister around brought more regularity to my life, and seemed to alleviate the loneliness of living alone.\nShe seemed to be doing independent studies, so rather than force her to go to high school when she didn't want to, why not let her read what she likes for a while?\nMisanthropy isn't something easily fixed.\n\"Big brother, you don't go to college, do you?\", she asked one night. And not in a harsh or ridiculing way.\n\"...Nah,\" I replied.\n\"I see,\" she said with a slight satisfied smile. \"Daddy's going to kill you if he finds out.\"\n\"That's likely.\"\n\"He'll kill you!\"\nI scratched my head. After taking a sip of cocoa, she put her cup down and said \"I'll keep it a secret. But in return, I expect you to be more polite to me.\"\n\"...You have my gratitude.\"\nI lowered my head. \"He'll kill you\" was an exaggeration of my sister's design, but \"he'll beat you\" was a certainty.\nAs far as my sister skipping school went, even my thickheaded parents felt they were responsible, so they didn't speak much of it.\nBut me not going to college, that would put them in a fiery rage. They had lots of pent-up energy from not scolding my sister.\nWhile I pulled the sheets over my sister, who'd fallen asleep on the bed sideways with a half-finished book in hand, I had a thought.\nIf I were arrested for Tokiwa's murder, how would this girl react?\nOr else, what if I failed in murdering him, gave up on it all, and commit suicide?\nI didn't have any intention of that at the moment, but I couldn't keep myself from imagining the possibilities.\nAnd objectively speaking, if I were to commit suicide, it could be very persuasive.\nAt the very least, it seemed easier to think about death than imagine what living would be like from here on.\n[+]",
      "scraped_at": "2025-11-20T20:35:08.701215",
      "content_scraped_at": "2025-11-20T20:35:09.386403",
      "error": null
    },
    {
      "id": "39",
      "number": "39",
      "title": "Chapter 39: * 39 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/39/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "My first self's popularity - though granted, it was mine - really was astounding.\nAround the end of November, I remembered that there was a girl who persistently followed me around, although we weren't talking stalking here.\nNo, not just one - depending on the time, there could be several. I can't remember what they were like, naturally.\nBut as usual, it was unbelievable stuff considering my second life. I wish I could have half of that, sheesh.\nWhy was I only reminded of that then? Well, that's kind of a funny story.\nI was sitting by the window on the second floor of a hamburger place in the city, reading a book, and periodically looking out below.\nNot that I was really a fan of the hamburgers there, but it was a habit of mine to sit in that window seat.\nThe reason being because nine times out of ten on the weekend, I'd see Tokiwa walking by in the afternoon.\nSo it was a good spot to watch for him coming through.\nI sipped some hot coffee and gazed at the people below.\nIt was Saturday, and I saw an alarming amount of couples passing by. There was hardly anyone walking alone who didn't also appear to be in the middle of work.\nMaybe it was because Christmas was approaching, or maybe it was always that way.\nChristmas songs were frequently playing in all the shops now. At that particular moment, it was \"Santa Claus Is Coming To Town.\"\nIt was the same no matter where you went this time of year. Maybe you could even consider it threatening.\nWith lights decorating the roadside trees, Christmas was invading the town.\nHonestly, it made me unhappy. It felt like a provocation directed at me, lonely and unfestive as I was.\nIt wasn't, of course. It was just innocently making happy people happier.\nBut let's say you have somebody who's lost their mother, and every time they turn on the TV or go outside or do anything, they're told \"Mother's Day is coming up!\"\nYou know that's gonna hurt. Not saying you should go and cancel Mother's Day because of it, just saying that hey, those people exist.\nThe book I was reading was one I checked out from the library at my sister's suggestion.\nSeeing my sister enjoy reading so much got me interested myself, I guess. And since I had so much spare time, I asked \"Got any recommendations?\"\nIt's weird, but even though I went to the library all the time in high school, I never had much interest in books then.\nAnd a reader, no matter what they're like, will always have a serious answer to that question. Maybe because they get to demonstrate their experience to others.\nShe recommended me a number of books prefaced with \"for beginners.\" And one of them - well, you might've guessed it already - was \"The Catcher in the Rye.\"\nI struggled with the style of the Japanese translation, and since I was looking around as I read, I found that I wasn't making it through the pages as quickly as I liked.\nI'm no good at remembering foreign names, incidentally. Well, now that I think of it, \"Holden Caulfield\" isn't too bad of one.\nBut when we're talking \"Avdotya Romanovna Raskolnikova,\" I'm gonna start foaming at the mouth.\nWhen I was about thirty pages in, I looked outside and saw a familiar face. I sat up and leaned for a closer look.\nBut no, it wasn't the man I was looking for, nor a man at all.\nI thought I was mistaken at first, as she was acting strangely, had dyed her hair chestnut-brown, and wore clothes that didn't match my idea of her at all.\nHad it not been for my well-trained eyes, I would have overlooked her. Indeed, my eyes and ears became very attentive through stalking.\nThough I had no real reason to pursue her, I put away my tray and hurried out of the restaurant.\nI made it outside just as Hiiragi turned the corner. Missed her by a hair.\n[+]",
      "scraped_at": "2025-11-20T20:35:10.469251",
      "content_scraped_at": "2025-11-20T20:35:10.983631",
      "error": null
    },
    {
      "id": "40",
      "number": "40",
      "title": "Chapter 40: * 40 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/40/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I followed behind Hiiragi the same way I usually did Tokiwa.\nNot that I intended to talk to her, because what would I say? \"Hey there, see we're both still lonely. How's that working out for you?\"\nWhat I wanted to learn from tailing her was how she, who was similarly lonely, would be spending the day.\nI felt like there could be a hint toward improving my own life in there, somehow. I wanted to know how loners like us were to pass the cold winter.\nI guess by making the Tokiwa thing a daily routine, I had no opposition to stalking people anymore.\nIt seemed normal for me to see a girl I knew and calmly decide that I'd stealthily follow her.\nMy thought processes were exactly like those of a criminal. Man, that makes me shiver, and not from cold.\nBy the way, I ought to reveal something that I kept quiet about before. You remember when I talked about Hiiragi, right?\nWell, for the sake of suspense or what have you, I talked as if Hiiragi and I never met again after that.\nBut actually, we went to the same university. And maybe it's because we both knew that that we didn't talk on that last day of high school.\nHad that really been the very last time we'd see each other, I might've wanted a handshake at least.\nAs one would expect, Hiiragi's isolation worsened too when she got to college.\nYep, that was Hiiragi. It relieves me to see how people don't change. I'm one to talk, of course.\nThere were very few who immediately knew who you were talking about when you said \"Hiiragi,\" even in her department. She was just that forgettable.\nUsually lonely people stand out in a bad way. But she was really good at just blending in, from the timing with which she entered classrooms, to how she picked her seat, to how she slipped into the crowd during group activities.\nI tried to do the same things, but I knew how much better she was at those techniques.\nI didn't know the details, but it appeared Hiiragi lived somewhere not far from my apartment.\nA couple times I'd seen her shopping when I went to buy beer from the local convenience store. In fact, it seemed she was buying beer too.\nThough she recognized me, she wouldn't come talk to me. But she didn't ignore me, giving me a glance that said \"Oh, you too.\"\nI might have been giving Hiiragi a lot of the same glances unconsciously. Those judging yet sympathizing glances.\nIn high school, I thought gloomy people like me were bound by fate to beer, but I don't think that's quite true.\nRather, people like us are the most likely to indulge in alcohol. When there's a lot you want to forget and a lot of monotony to go through, alcohol makes a good partner.\n[+]",
      "scraped_at": "2025-11-20T20:35:12.021513",
      "content_scraped_at": "2025-11-20T20:35:12.665569",
      "error": null
    },
    {
      "id": "41",
      "number": "41",
      "title": "Chapter 41: * 41 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/41/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "The sun had mostly set, so it became easier to tail Hiiragi. Normally it would be harder with less people, but the town was still just the right level of crowded; a good day for stalking.\nHiiragi swiftly moved through the dim town. She was a fast walker.\nPeople accustomed to being alone forget how to walk with others, and they're always displeased with where they are, want to be anywhere but, so they walk really fast - that's my theory, anyway.\nAnd the opposite's true too; happy people who are pleased with the moment and where they are walk slow. Tokiwa and Tsugumi walked verrry slow.\nThey walked so dreadfully slowly, lightly pushing each other, cuddling with each other, looking at each other, that tailing them was a huge pain.\nThey were already so happy being together that they were in no hurry to get anywhere.\nHow fast you walk when there's nothing particularly urgent to attend to is a great indicator of happiness. I mean it.\nSo I thought about all that as I followed Hiiragi. In addition to walking fast, she had a terrible sense of direction.\nShe'd be walking straight ahead, then suddenly duck into an alley, then come back out ten seconds later like nothing happened.\nShe'd come to a stop, suddenly cross the street, then cross back to the side she was on before.\nWhat was she even trying to do? I knew she wasn't good with directions, but I'd never seen it so bad before.\nMaybe she was drunk? Maybe she went crazy?\nBut the real reason was actually quite clear. If you followed Hiiragi's gaze, it was obvious what her target was.\nHowever, it took me about thirty minutes to catch on. I'll admit it, I'm an idiot.\nHiiragi came to a halt and hid in the shadow of a nearby pole. After a while, she timidly peeked out from behind it, then resumed walking quickly.\nEven I could figure it out at that point.\nShe was following someone.\nI looked toward where Hiiragi was looking. I spotted him just a few seconds, a few meters ahead.\nYes, you probably guessed it already - it was Tokiwa who Hiiragi was following.\nI knew Hiiragi and I were similar, but we didn't have to be that similar, I thought.\n[+]",
      "scraped_at": "2025-11-20T20:35:13.728463",
      "content_scraped_at": "2025-11-20T20:35:14.534440",
      "error": null
    },
    {
      "id": "42",
      "number": "42",
      "title": "Chapter 42: * 42 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/42/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "There was a lot I could presume from this. Like I said before, Hiiragi wasn't acting much like herself that day.\nI wondered about it the whole time I followed her. She wore a denim coat, a short skirt, and some kind of weird hat, none of which suited her at all. Not even a little.\nBut it clicked when I realized she wore it to make herself unidentifiable. And indeed, it succeeded in making you think it wasn't Hiiragi.\nI was with her all through high school, so I was able to recognize her. But Tokiwa, I doubt he would be able to tell right away.\nI didn't ask myself why she was following Tokiwa. Because wasn't it obvious?\nHiiragi was Tokiwa's stalker. Unlike me, she was a real stalker who did it because of her affection for him.\nKind of odd to talk about what makes a \"real\" stalker, huh...\nWithout even planning for it, I was succeeding at a double-stalking.\nI kept watching for ten or twenty more minutes to confirm that Hiiragi was indeed stalking Tokiwa, then stopped.\nI went to the parking lot of the nearby shopping mall, sat on a bench, and started smoking.\nNow that I wasn't walking, I suddenly felt chilly, the hand I held my cigarette in trembling.\nI stuck my free hand into my jacket pocket and endured the cold.\nThe people heading for their cars had such unbridled happiness on their faces, it made me feel horribly out of place.\nEvery time the automatic doors opened, I heard \"Sleigh Ride\" from inside. Like on the other side of that door was a land of pure happiness.\nThinking about how Hiiragi (who I thought my one ally) was obsessed with Tokiwa (I suppose my greatest enemy) depressed me.\nBecause it meant that Tsugumi who I longed for, as well as my ally Hiiragi, both loved Tokiwa.\nYes, in the end, even (well, maybe not \"even\") a girl like Hiiragi, whose face was hardened into an expression of \"I just hate humans as a whole,\" was head over heels for a dashing young guy like Tokiwa - all because he showed her a little kindness.\nI'd bet money on it. Because I had that inclination myself in my second life.\nWhen you have such an immense inferiority complex, and someone superior to you is kind, you feel \"Oh, how wonderful this person must be to show kindness to someone as worthless as me!\" It's pure, it's naiveté.\nWhile we had opposite motives, the fact Hiiragi and I were stalking the same person was pretty interesting, from a certain viewpoint.\nHiiragi's goal was Tokiwa, my goal was Tsugumi. And Tokiwa liked Tsugumi, and Tsugumi liked Tokiwa.\nIf everyone could just settle for less, the world would be such a peaceful place, I thought.\nIf I hadn't taken to unattainable Tsugumi, and Hiiragi didn't try to go for Tokiwa when they were worlds apart, then we could settle this with a lot less sorrow.\nIf I killed Tokiwa, it would make Hiiragi sad, I thought.\nBut I considered that, shortly afterward, she might be surprisingly happy that he was dead.\nConsidering what Hiiragi was like, it seemed a likely possibility.\nNo matter what it came to, Tokiwa was Tsugumi's to the end.\nSo if Hiiragi couldn't have him, she'd prefer if no one could - it wouldn't be surprising, I thought, if Hiiragi had that kind of twisted affection.\n[+]",
      "scraped_at": "2025-11-20T20:35:15.689740",
      "content_scraped_at": "2025-11-20T20:35:16.245816",
      "error": null
    },
    {
      "id": "43",
      "number": "43",
      "title": "Chapter 43: * 43 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/43/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I realized I'd forgotten my book and returned to the restaurant.\nLuckily, the red [translator's note: blue] book was still where I left it. I put it in my bag and left once more.\nI met eyes with a man.\nAt first, I looked away. There was something about his face that drew my gaze, but whoever it was, I knew there was no one I felt like talking to right now.\nBut something stopped me. I looked at him again. Once we made eye contact once more, my brain had finally told me who this was.\nIn contrast, he called my name with a smile. Nostalgically, like he was glad to meet me again.\n\"Hey, hey! It's been too long! You been doing well?\", he greeted me, sitting in the seat in front.\nI wasn't sure how to respond. I didn't have the acting skill to send back a smile, and I didn't have the courage to flat-out ignore him.\nI stopped in my tracks with a vague smirk and clumsily sat down across from him. Looked like I didn't even know how to sit in a chair.\nI couldn't understand why he was talking to me with such familiarity.\nAfter all, this man - Usumizu was his name - and I didn't have the most congenial relationship.\n\"How many years? Not since middle school, so about four?\"\nI guess I should just say it. In my third year of middle school, I was bullied by Usumizu.\nIn ways easily understood as such, nowhere near the fine line where it could be considered teasing.\nI absolutely didn't want to remember anything about when I was bullied. And I'm sure you don't want to hear that gloominess either, so I won't go into detail.\nPoint is, Usumizu bullied me, and that's all you need to know.\nI struggled to keep myself from being reminded of those times. But those kinds of memories are like a mouth ulcer.\nIt hurts to touch, and you know it'll make it take longer to heal, but you can't help touching it.\nAs much as I tried to forget, I always had dreams about it. But oddly, I wasn't dreaming about being bullied.\nI dreamt I was reconciling with the one who bullied me. I dreamt we were looking back on it and laughing.\nWell, clearly that was a product of my latent desires. If possible, I didn't want to antagonize anyone, no. I wanted to be get along even with those who bullied me.\nBut thinking of it that way made me sad, so on the surface I just despised him.\nIt's easier to bear being hated by someone you hate than someone you like.\nSo now that Usumizu was here in front of me after years, and talked to me so cordially, my reaction was one of concern.\nActually, I wanted to do the same, and say \"Hey, it's been a while. I'm fine, how about you?\" That was among my hopes.\nBut on the other hand, I felt like that would be disrespectful to myself when I was bullied all those years ago. Was it right to so easily forgive someone?\n\"What're you up to now? College student?\"\nI told him the university I went to, and he said \"Whoa, dang! You're smart!\"\nHe seemed to earnestly believe what he said. Something was off, I thought.\nFrom his attitude, I wondered if he'd totally forgotten about bullying me in middle school.\nBut that's always how it is. The bullies forget, but the bullied remember for life.\nAnd when they forget about their bullying, in some cases they replace it with false memories; they explain their guilt as having been unacting observers of bullying.\n\"What are you up to, then?\", I asked him, and he started talking enthusiastically, as if to say \"I'm glad you asked!\"\nTypical stuff about his spectacular college life. Shouldn't have asked, I regretted as I nodded my way through it.\nWhile unwillingly listening to his story, I began to get used to this Usumizu person, and finally got a good look at his face.\nI noticed that Usumizu just couldn't seem to calm down. He unconsciously tapped his foot, his gaze went all around, he repositioned his arms frequently.\nDespite looking me right in the face, his eyes kept wandering off.\nIt was as if he was nervous to be sitting in front of me. But at the same time, he was clearly overjoyed he had a chance to see me.\nWhichever it was, it was strange. Second-time me was a person who made you relax in a bad way, not a person who was fun to be around.\nAbout ten minutes passed with me unable to identify what was so off. Suddenly, Usumizu stopped talking.\nIt was seriously abrupt, so I thought he'd remembered something really important.\n\"What's up?\"\nAfter staring at his lap for five seconds, he said \"I gave up.\"\n\"Gave up what?\", I asked back. I was fearful that I'd done something to make him angry.\nHe said \"Forget it. That was all lies,\" leaned back in the chair, and sighed with his hands put together between his legs.\n\"Yes, it was all a lie. I don't go to college. And I don't work, either. It's been months since I had a real conversation with someone. I haven't heard myself speak in so long. I'm so nervous I can't stop sweating.\"\nHe spoke rapidly and without breaks, as if to fill the prior five-second gap.\n\"I'll be honest. I can't get my mind off death lately. There's too many reasons to list. So I won't. But I wanted to do it as soon as I thought of it. But I wanted to do something before I died. So I saved up money. Once I had enough, I left home. I haven't been back since. I'm constantly on the move. I'm having fun with it. I'm planning to keep doing it until I run out of money. Once I do... Yeah, I'll probably do it as a hobo for a while. So I'm planning to die once enough time has passed. Simple, right?\"\nIt all came so fast, I was hopelessly lost.\nWhat was this guy trying to tell me all of a sudden?\n[+]",
      "scraped_at": "2025-11-20T20:35:17.264059",
      "content_scraped_at": "2025-11-20T20:35:17.800067",
      "error": null
    },
    {
      "id": "44",
      "number": "44",
      "title": "Chapter 44: * 44 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/44/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Taking a closer look, Usumizu's coat was pretty drab, with pilling all over. His hair was unkempt, his cheeks were thin, and his eyes were sullen.\nNow that I could look at him more calmly, he was one step from becoming a vagrant.\n\"I'm telling this to you because you see it like a confession. ...No, I don't mean that in a bad way. I just mean you're not likely to ignore it and pretend you're not unfeeling. I don't want someone to stop me. If someone told me \"Don't say that, things will always get better if you keep living, let's do this together,\" I'd have to bite my tongue and wouldn't want to die anymore. I just wanted someone to hear it. You're great for that. Because you'll listen in earnest, but that's all you'll do. I can tell just looking at you. You'd rather die than say \"If something's paining you, we can talk about it.\" It's talking through a reinforced glass screen. That's why I felt like being serious with you.\"\n\"I don't know if I get it,\" I said, \"but I suppose you're not looking for any tactful comments, then?\"\n\"Yeah,\" he smiled with slight worry. \"I really just wanted someone to listen, I think. ...Hey, do you know the feeling? Like, that sense you haven't done a single thing right your whole life.\"\n\"I suppose I do,\" I replied. In fact, I felt I suffered it more than anyone in the world. Because I knew everything I \"did right\" in my first life.\n\"I don't want you to understand,\" he shook his head. \"Then my despair'll just seem like some stale, commonplace thing.\"\nUsumizu looked out the window. The lights in the arcade shone blue, white, green, and red.\n\"It's almost Christmas. Hard time for guys like us to get through, huh.\"\nI looked at him in silence.\n\"Hey, this just kinda came to mind... Are you carrying a bunch of burdens too? I dunno what exactly it is, but I can see it in your eyes. Face looks like you've totally lost human contact. You drift away from 'em. We'll never escape this vicious cycle of being hated, and that resulting in even more hate. ...Why'd it come to this?\"\nUsumizu spoke while he watched snow start to fall outside.\n\"Me and you, we had promising futures as kids. Wouldn't be strange in the slightest to see us both leading pretty girls around. Wouldn't be odd to lead a picturesque youth, neither. ...I don't think it's that we were careless. Somewhere, there was a single cog that got misaligned. And that one cog got all these other ones mucked up, and in the end, all the cogs went awry. And now they're just strewn all over the floor, beyond repair.\"\n\"...Ever thought that you were one of the ones who messed up my cogs?\", I asked. Reviving that topic didn't seem very productive, but I felt it couldn't go unasked.\n\"I did,\" he said. \"I did that stuff to you in the first place because you felt like a threat. As a boy, I was brimming with confidence. I believed I'd be twenty times better than the lame adults around me. And I thought everyone else was insignificant. ...But you were something else. I unconsciously thought \"This guy has the potential to do even better than me.\" So of course I wanted to take you out before that.\"\n\"I'm flattered,\" I sarcastically smiled.\n\"It ain't flattery. In a way, I was scared of you. 'Course now, neither of us's a threat to anybody. ...Anyway, I know I did something awful to you there. As much of an apology as I can offer, I'll give it to you. Say the word and I'll do it.\"\n\"No, no point. For all we know there's somebody who mucked up your cogs after you mucked up mine, so that could just go on forever. Same as you just wanted to talk, I just wanted to listen. Plus... I don't want you to apologize. Just let me keep the right to keep loathing you. For whenever I wanna put blame on someone, you know.\"\n\"Kinder than I thought,\" Usumizu grinned.\n\"...Well, I'm gonna be going now. Not sure if I'm glad we could talk or not, but thanks anyway. Still, talking to you's bringing back stuff I don't want back. Thought I remembered them already, but... when I see you, it comes flooding back more vividly.\"\n\"Well, at least by being reminded of the worst time of my life, I can feel a little better about now. Thanks.\"\nWith a weak smile, he walked away. Throughout our conversation, I felt absolutely no will to forgive him.\nBut somehow, I found myself subtly stuffing two 10,000 yen bills in the pocket of his heavy backpack.\nThat won't make him happy, I told myself, and I didn't really care much for him living a little longer.\nI just wanted to do it, so I did.\nAfter he left, I felt something trying to piece itself together in my head. I had no idea what it was at first, but over time, I realized I was trying to recall something.\nPerhaps Usumizu had been my best friend in my first life. My memories were fuzzy at ever, but from the way he spoke, his laugh... I felt like I was once close to a guy like that.\nI had been convinced that Usumizu was one of the people who messed up my second life, but... If he was indeed a best friend the first time, then it could be I messed him up first.\nYes, it wasn't just that he ruined me - I ruined him, and then he ruined me.\nBack at the apartment, I took a shower and had two drinks of whiskey on the rocks.\nMy sister had long since fallen asleep, so I wouldn't be turning the TV on. So by the light of a desk lamp, I strained my eyes to read.\nIn less than an hour, my eyes were worn out. I put the book on the desk and drank whiskey in silence, staring into the middle distance.\nAt times like these, I always daydreamed about Hiiragi. I imagined she was at her own apartment, drinking and reading alone like me.\nNow, I don't want any misunderstandings - I didn't daydream about that stuff because I wanted Hiiragi beside me.\nI just liked to think that someone else, somewhere else, was doing the same thing. Feeling like I wasn't the only one made the good and bad not matter as much.\nAnd there was no one who I could count on to prove that better than Hiiragi. Because she really was living a very similar life.\nOnce I was too sleepy to bear, I brushed my teeth and got in the futon.\nI think I heard my sister muttering things in her sleep.\nOnce more, I prayed that I'd wake up to a third round.\nI turned off the light and fell sound asleep in seconds.\n[+]",
      "scraped_at": "2025-11-20T20:35:18.804425",
      "content_scraped_at": "2025-11-20T20:35:19.519579",
      "error": null
    },
    {
      "id": "45",
      "number": "45",
      "title": "Chapter 45: * 45 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/45/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I woke up being stepped on by my sister. Maybe less \"stepped on\" and more hit with her foot. At any rate, it wasn't a great way to be woken up.\n\"Gotta return library books,\" she said. \"Wake up.\"\nWell, I suppose I was at fault for sleeping in to four in the afternoon.\nIt was already dim outside, so the streetlights began to turn on.\nBut it was one of those rare cloudless days, with rather clear skies. Sometimes a strong wind would blow leaves across the asphalt, making rustling sounds.\nOnce at the library, my sister carried a bundle of books inside.\nI locked the car and followed her in, returned a few books I'd checked out, and quietly told her \"Alright, let's meet up at the entrance in an hour.\"\nI went back outside to the corner of the parking lot and lit up a cigarette.\nIt looked to be some sort of storage area, with lots of junk scattered about.\nRusty bicycles, poles, traffic cones, cracked flowerpots, tools, buckets, that kind of stuff.\nA lone outdoor unit breathed laboriously amid the garbage.\nI sat on a fence and smoked.\nFor some reason, there was an ashtray right there. Maybe the staff used this place to duck out for a quick smoke.\nI looked over the garbage once more. The second me had become much more at ease from coming to these lonely places.\nI wonder why. Maybe because I felt like these places couldn't get any worse.\nThinking no one was around to hear, I started to whistle. I wasn't consciously whistling a particular song, just going with whatever melody came out.\nBut as it turned out, I was whistling Jingle Bell Rock. I quickly stuffed the melody in my mouth once I realized, as I was not enjoying Christmas as that would have indicated.\nAfter that, I left the library area for some ruins across the road. This was another favorite place of mine.\nOnce a youth hostel, it was ignored for a long time, and the building became dilapidated, vines crawling up it like cracks.\nWith a closer look, of course, one could see many real cracks as well.\nThe interior was too dark to see, but when I once peeked inside, I saw a dusty floor filled with holes and toppled stools.\nBy the window was an old piano, which just seemed like such a waste.\nI looped around to the back of the building. The former parking lot had rusty Kei cars and motorcycles with missing tires.\nThe bars of the bike rack were broken, and the roof had caved in. Right next to that was a pile of concrete blocks, though I'm unsure what they were for.\nI could spend forever looking at places like this. Once I started thinking about what went in on this place when it was still a functional youth hostel, I couldn't stop.\nI hated to look at ongoing happiness, but I liked to get a whiff of its scent once it was gone. A weak smell of \"Perhaps there was happiness here once.\"\nAfter going around for about ten minutes, I returned to the library's bicycle area.\nI stood by the ashtray and took out a second cigarette out of my pocket, then an oil lighter to light it.\nSuddenly, I noticed someone coming around the corner.\nIt was not my sister. And much like me, she was lighting a cigarette.\nHer lighter briefly illuminated her face orange in the dim light.\nOnce I realized it was Tsugumi, I forgot to breathe for a few moments.\n[+]",
      "scraped_at": "2025-11-20T20:35:20.529392",
      "content_scraped_at": "2025-11-20T20:35:21.027684",
      "error": null
    },
    {
      "id": "46",
      "number": "46",
      "title": "Chapter 46: * 46 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/46/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I couldn't take my eyes off her.\nShe recognized me, looked at me for about two seconds, then looked hesitant for a moment.\nIt wasn't unreasonable; I was that guy who hadn't showed up to college in months.\nIncluding all the events of middle school, Tsugumi was the one most deserving to look concerned when she saw me.\nStill, she was always a very polite girl, so she awkwardly greeted me.\nShe’d always greet anyone and everyone with a smile.\nI greeted her back, but I was bewildered inside.\nI had no idea Tsugumi was a smoker.\nI didn’t even know she came to this library.\nI hadn't seen her up close in a long time, either. Since middle school, I suppose.\nFor as much as I wanted to be with and talk to Tsugumi, when the time came, I couldn't get anything out.\nI was just panicking to myself, “Gotta say something,” but saying nothing.\nTo be honest, I didn't even let her look me in the eye. Not because I was just that dazzling, of course.\nIf we did make eye contact, I felt like she'd look right through my miserable head.\n\"Come to check out some books? Or are you studying?\", Tsugumi asked.\nIt was a trivial question, but her asking anything remotely personal about me already made my chest nearly burst.\n\"Yeah, to check out books. Well, but really, I'm just escorting my little sister...\"\n\"Huh, your sister...\" Tsugumi seemed to question my reply, but didn't press further. \"Do you read?\"\n\"A little, yeah... Maybe just because I've been coming to the library lately.\"\n\"Ahh, I see. What have you been reading lately?\"\nI tried to judge Tsugumi's expression. It seemed like she wasn't just making polite conversation; she was genuinely interested.\nPerhaps she didn't know many readers. My first self rarely read books at all, after all.\nSo maybe Tsugumi wanted someone to talk about books with.\n\"I feel like I'm really late on the bandwagon, but I read Salinger's Catcher in the Rye. That and Nine Stories,\" I replied.\n\"Catcher?\", she nodded. \"That one goes on my top shelf. Er, which is to say it's a big favorite of mine. ...What did you think of it?\"\nI had to think. Because if I could come up with a good reply, there was a chance I could get Tsugumi to take a liking to me.\nI couldn't mess this up, or she'd just think I'm boring.\n\"Generally,\" I began, \"it's a story about the unique animosity young people have toward the world. ...Er, or that's how it's often interpreted.\"\nShe nodded at me to go on. I could see the slightest loss of hope in her eyes. She wasn't looking for the common opinion. So I hurried to my next point.\n\"But - and this is just my own personal opinion as someone who's not an avid reader, with experience and teaching - I feel like people stress it too much as a \"novel about youth.\" Sure, it applies. When you take it as a story about a youth who gives up on high school and goes around badmouthing society, but gradually matures through his relationships with others, then it's easy to read it that way. ...But this is, you know, the same Salinger who wrote Bananafish. I think people need to read it more carefully.\"\n\"I really get what you're saying,\" Tsugumi nodded. \"That's pretty much the same way I feel about Catcher. So, what did you come up with after a careful read?\"\n\"That is, um...\" I scratched my head. \"Well, once I started to feel that the existing interpretations weren't quite right, I kind of wondered how I should be reading it...\"\n\"And? Go on, tell me.\"\nI searched for the words once more. Yeesh, if I'd known this was going to happen, I'd have taken my notebook.\n\"...When I see Holden, what I think is, it's only natural he'd be so pissed off, because he has proper sensibilities. It's not because he's young and inexperienced that he's mad about nonsense and phonies. In a way, it's like The Emperor's New Clothes. But like the Japanese translator says, Holden isn't necessarily written to be a symbol of innocence. When a child speaks out and says \"But he isn't wearing anything at all!\"... in Catcher, that just gets him dismissed as a heretic.\"\nI spoke eloquently. Unfortunately, my tongue was sluggish due to not having said anything that long in ages, but I at least established a sort of rhythm in the conversation. Finally, I'd managed to say what I wanted.\nTsugumi seemed pleased. \"He isn't wearing anything at all,\" she repeated. \"That's another story I like, actually. It's an amazing text for getting multiple interpretations out of. Hey, do you mind if I change the subject a little?\"\n\"No problem,\" I said. I was incredibly glad our conversation could go on a little longer.\nTsugumi took time to carefully pick her words.\n\"...When I look at our society, I feel like there are a great number of people who are made out to be naked emperors. Basically, there's an emperor who actually wears clothes that idiots can't see. But the masses are filled with idiots, so none of them can see the clothes. One extremely foolish child among them speaks up. \"But he's not wearing anything!\", he says. Suddenly all the idiots around him are relieved, and they start to say \"he's not wearing anything\" too. The emperor hastily insists, \"No, no, that's not true at all. There are people who have seen them!\", but even when he tries to show them the clothes as proof, the idiots confidently say \"Well, I don't see anything.\" ...Do you see what I'm trying to say?\"\n\"I think I do,\" I replied.\n[+]",
      "scraped_at": "2025-11-20T20:35:22.037696",
      "content_scraped_at": "2025-11-20T20:35:22.611724",
      "error": null
    },
    {
      "id": "47",
      "number": "47",
      "title": "Chapter 47: * 47 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/47/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "We continued to talk in that way for a while.\nThe conversation itself was rather trifling. No real significance to it at all.\nMy first self would have forgotten it even happened in two seconds.\nBut for me, it made my fingertips shake with joy from beginning to end.\nI prayed that it could last just a little longer.\n\"Oh yeah, Tsugumi... You smoke? I’m surprised,\" I said, lighting a Pall Mall.\nShe smiled with a little bit of worry. \"I’m keeping it secret, even from my boyfriend. Right now, only you know.\"\nThose words stuck out in my mind.\n\"Only you know.\" It had a nice ring to it.\nI want to say we talked for about thirty minutes total. We were so engrossed in conversation, we didn't want to move from that spot.\nBy the time Tsugumi checked her watch and said \"I've got to be going,\" both of us were shivering.\n\"Sorry for all the weird tangents. I guess I got carried away since I don't have anyone to talk to about that stuff. But... I don't know about you, but I had a great time. Thanks. See you.\"\nAfter Tsugumi left, I looked to the moon and reflected on our conversation for a little while.\nI wasn’t sure if it was the cold or excitement that made me unable to stop shaking.\nHow economical of me to get such joy from that little conversation.\nNot to mention, I still had not noticed the fatal mistake I was making.\nMy sister was already at the car, and when I arrived, she said “Five minutes late!” and whacked me in the head five times.\nWouldn’t want to see an hour late, I suppose.\nA while after we left the library, she said \"Big brother, are you friends with that girl?\"\n\"...Nah,\" I denied. \"She was just kind enough to talk to me.\"\n\"Hmph. Well then, I must be kind too for talking to you,\" my self-entitled sister stated.\n\"It’s different. You and I are merely on good terms.\"\n\"Huh? Really?\", she asked, perplexed.\n[+]",
      "scraped_at": "2025-11-20T20:35:23.624401",
      "content_scraped_at": "2025-11-20T20:35:24.373215",
      "error": null
    },
    {
      "id": "48",
      "number": "48",
      "title": "Chapter 48: * 48 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/48/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Even a week later, the conversation I had with Tsugumi was still repeating in my head like a favorite record.\nI could recreate the thirty minute talk down to the slightest detail. Rather than grow muddled as memories do, it felt like it became clearer every time.\nI have to remove Tokiwa, I thought. Much like the day I saw Tsugumi at the bus stop, I was reinvigorated with energy.\nEven if Tokiwa was like a saint, made everyone around him happy, had more than ten times the value I did, and killing him would make Tsugumi sad, I didn't care.\nI had no need to find justice in my actions. All that mattered was if Tokiwa's existence made me happy or unhappy.\nAnd of course, it made me unhappy. And his non-existence would make me happy.\nThus, I would kill him. That seemed fine to me.\nI slapped my cheeks with both hands to liven myself up.\nI would kill Tokiwa today if I could.\nSeeing me confidently preparing to leave, my sister, fleeing from home for... who knows how many times it was now, drowsily spoke up.\n\"You look like you're having fun. It's weird.\"\n\"In a bad way?\"\n\"Bad way.\"\nShe threw aside the book she was holding.\n\"Hey, those are borrowed books. Treat them carefully,\" I reprimanded.\n\"You can treat sucky books rough. Didn't you know?\", she replied.\n\"Never heard that before. What's so sucky about that book, anyway?\"\nShe thought for a moment, then answered.\n\"The kid in this book thinks answering a question is the same thing as thinking.\"\nI was surprised, having not expected a serious answer.\n\"I don't get it, but... What, do you mean it's best to leave questions unanswered?\"\n\"That's not what I meant at all. I think it's weird to detach questions from answers in the first place. When a question comes up, it's expected an answer will follow. So answering in itself isn't a big deal. Rather, it's how you go about pulling things from your head to...\"\nAfter going that far, she appeared to feel she'd said too much and quickly shut her mouth.\n\"Well, I'm not trying to look like I'm having fun. So what exactly makes you say that?\"\n\"...You've been dressing better lately, haven't you, big brother?\"\n\"Have I?\", I said, playing dumb.\nIndeed, since tailing Tokiwa with the same clothes could raise suspicion, I was mixing it up lately.\nI tried my best to wear fashionable clothes that let me blend into the crowd as best I could. But she had misinterpreted it as suddenly caring more about my appearance.\nAfter all, before I had no problem wearing the same clothes to college two days in a row. I didn't expect anyone to care how I looked.\n\"Could you have gotten a girlfriend, maybe? In which case it's awkward for me to be here?\"\nThough bluntly said, it was a rare occasion for my sister, as she actually demonstrated tact. Granted, she assumed wrong.\nHowever, it was true I was in love. My sister was surprisingly good at seeing through me, it seemed.\n\"Unfortunately, that's not the case,\" I answered.\nAfter a little thought, I explained it like this - as usual, I felt it best to lie with a little bit of the truth, to throw off the scent a little.\n\"I want to become a faceless person. Just blending into the crowd. It's my hope that after people pass me by, they'll have already forgotten my face - that's how little impression I leave. And rather than wear plain clothes in empty places, I've found it's more effective to dress like everyone else and wander where the people are.\"\n\"So like an invisible man?\"\n\"Right. In a sense, I want to be an invisible man.\"\n\"Weird,\" she dubiously said. \"Alright, so you didn't get a girlfriend. ...Where are you going today?\"\n\"I'm planning to go to a café to study.\"\n\"Even though you don't go to school?\", my sister said somewhat ironically - likely also scorning herself for her lack of attendance.\nI replied, \"I'm studying because I don't go. It sounds contradictory, but I don't want to be a dropout. I don't go to school because I don't want to go, but it doesn't mean I don't want to do something with myself. Things like job qualifications and English, I can study by myself.\"\nI could tell lies like this all day. I hadn't done any studying to get a job at all.\n\"See you,\" she said to cut off the conversation. It was a \"see you\" with the nuance of \"get out already.\"\n[+]",
      "scraped_at": "2025-11-20T20:35:25.888389",
      "content_scraped_at": "2025-11-20T20:35:26.719232",
      "error": null
    },
    {
      "id": "49",
      "number": "49",
      "title": "Chapter 49: * 49 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/49/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I would never be able to know now, but I wonder. If I had been given a fourth perfect chance to kill Tokiwa, would I have done it? Could I have?\nI tried to avoid facing the idea of \"killing someone\" head-on when possible. Rationally speaking, I could never approve of murder.\nIt was too high-risk, after all. If only I were more charming, I would be better off not murdering anyone.\nThe biggest problem for me was that even if my crime managed to go undetected, my own guilt would soon give myself away.\nSo I wanted a method that felt detached from reality; rather than stabbing him with a knife or strangling him, I'd patiently wait for a moment to softly push him from behind to his death.\n...Of course, like I said before, three of those chances had shown themselves and I let them all pass.\nThe fourth time would be different, though.\nAfter meeting Tsugumi at the library, I had my confidence back. I believed then that things could go well with Tsugumi.\nBefore, I'd felt that perhaps Tsugumi was too unattainable for my second-life self. So even if I had killed Tokiwa, she would never take solace in me.\nThus, I let those three chances go to waste.\nBut once I talked to her again after years apart, I was sure. I was even convinced I was a better partner for Tsugumi than my first self.\nIn my first life, I'd been an extrovert and her an introvert, but the second time, we would both be introverts and get along better than ever. I was sure that would be the case.\nYet even with those feelings, the question of whether I'd really kill Tokiwa when given a fourth chance to... I couldn't give an unconditional answer.\nI didn't have the guts to even punch someone; killing a guy like that may have been impossible from the start.\nOn the other hand, sometimes I had made decisions confidently enough to surprise myself, so it was possible I might kill Tokiwa without skipping a beat.\nAt any rate, I can't know now. A fourth chance never came.\n[+]",
      "scraped_at": "2025-11-20T20:35:27.779534",
      "content_scraped_at": "2025-11-20T20:35:28.335482",
      "error": null
    },
    {
      "id": "50",
      "number": "50",
      "title": "Chapter 50: * 50 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/50/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "At a glance, everything seemed to be coming together. Almost too well, even.\nTokiwa went to a bar with Tsugumi and stayed there for an hour. After taking her to at the bus stop, he started walking for the train station. That part was his usual routine.\nBut that day, he took a strange route to the station. He purposefully walked places with few people, went down pitch black residential areas, shopping districts, and alleys.\nIt was like he was following a self-imposed rule that he had to turn at every corner he felt like turning. Unable to guess his destination, tailing him took a lot of effort.\nMaybe he feels like walking alone, I thought. We all have those nights, don't we?\nThe air was cold as metal, and the stars shone piercingly.\nThe lights leaking out of houses seemed unusually lovely that winter night. It was even better with a bit of alcohol.\nFinally, the time arrived. Tokiwa was headed for a bridge.\nI had done a scrupulous investigation of the town, and I knew there were no places more suited for pushing someone to their death than that bridge.\nThe railing barely went higher than knee-level. It was easily high enough off the ground for the fall to kill him, but even if it miraculously didn't, being dropped into the river in frigid December would give him hypothermia and kill him with a heart attack.\nBy coming to such a place drunk, he was practically telling me to kill him.\nI suddenly thought that if I let this chance pass, there would be none to follow. I don't know why, but I felt like this fourth one would absolutely be the last.\nYes, there would be times when not everything was in order, but if I couldn't do anything even in this ideal situation, there was no chance I'd be able to in a less ideal one.\nI have to finish this here, I told myself.\nTokiwa slowly walked to around the middle of the bridge. I closed the distance between us, keeping my footsteps quiet.\nWith all this thin snow piled up, it could even be that people would think he slipped, I considered.\nYes, I was oddly calm. Even now, I was able to think about these things as if it wasn't even real.\nMy body still didn't particularly recognize that I was about to kill a man.\nIt was when I was only a couple meters away, and thought I could just run up and push him.\nTokiwa suddenly stopped - I had no time to guess why - and sat on the railing, as if to peer down at the river.\nThen he turned around and offered me his hand.\nLike he had known I was there all along.\n\"Hey, you sit down too,\" he said, directing next to him.\nMany thoughts ran through my head.\nHow long ago had he noticed me? How far?\nDid he know my intent? If he did, why was he making himself so defenseless?\nDid he want to talk to me? If he did, why did it need to be here?\nIf he knew I was tailing him from the start, then did he take those empty paths to reliably guide me along? But what was the point of that?\nMaybe he had only noticed me in the past few minutes - if that were so, did it disrupt my plans?\nDid he mean to confuse me and take the chance to run away? No, that hardly seemed effective - he should have just run in that case.\nI thought all this in a matter of seconds, and unsure of what to do now, I sat next to him like he told me to.\nEven then I could have easily pushed Tokiwa to his death. Perhaps I didn't because I was just too surprised by, or rather curious about, his actions.\nIn that sense, I played right into his strategy.\n[+]",
      "scraped_at": "2025-11-20T20:35:29.352590",
      "content_scraped_at": "2025-11-20T20:35:30.082815",
      "error": null
    },
    {
      "id": "51",
      "number": "51",
      "title": "Chapter 51: * 51 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/51/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "\"I want you to listen to what I'm about to say in silence, for the time being. But tell me if anything seems to be wrong.\"\nHomes lined both sides of the bridge, the warm light from their windows reflecting off the river.\nThe iron railings were so cold it felt like my hands would get stuck. But I had to hold onto them, of course; I could easily fall.\n\"I know you've been following me, more or less. And I've gathered enough proof that it wouldn't be easy for you to get away. Forgive me, but I asked a friend to tail you. Yes, it was a double-stalking, so to speak. ...Boy, I never thought I'd get to say that one day.\"\nTokiwa laughed to himself.\n\"I don't understand why you've been following me around. After all, while I honestly hate to brag, I'm kind of a saint. I've never done anything guilty. I've done many things to be thanked for, but never to be loathed for. And it appears the only real link between us is that we're in the same department at school. Still, I can't discard the possibility that you may want to inflict harm on me for some unjustified resentment... So I wanted to give this a try.\"\nI looked straight down. At night, the river was completely black, like there'd been an ink spill.\nAnd I realized that I could use it not only for pushing Tokiwa for his death, but for jumping to mine. That would be one way to resolve things. Never mind if I had the guts to do it.\n\"I gave you three chances before this. I intentionally fabricated three occasions while you were following me where you could easily inflict harm upon me. ...But of course, as you've now seen, I allowed just enough time for me to save myself if you did threaten any violence.\"\nI took my hands off the railing, reached into my pocket, and timidly lit a cigarette.\nThe wind on the bridge was so strong, it took some effort to get it lit.\n\"Yet you didn't act. Maybe you had no intention of hurting me from the start, maybe you got cold feet, I don't know. At any rate, I knew that you were harmless. Even if you had the intent to kill me, it seemed impossible for you to carry out.\n\"Naturally, it was always possible you would later get serious about killing me. But getting to look at you in person now, I think I know the truth. You can't hurt me. Just call it a hunch. Or maybe a subconscious feeling.\"\nI spoke for the first time. \"When did you first notice?\"\n\"The week after the college festival day,\" he replied. \"That was fairly early on, I'd expect? I would think it wasn't long after you began.\"\nExactly right, I confirmed in my head.\n\"It's not that I'm lucky, or that I have eyes in the back of my head. I'm not particularly sharp, nor do I have experience being followed. So why did I notice so early? ...Simple. Despite how I might look, I'm a highly self-conscious person - unusually so, you could say. I notice when people's eyes are on me frequently. I read everyone's actions, any messages directed at me. I'm the kind of person who, if I see the same person three times in a day, will think they're trying to ambush me.\"\n\"Huh... I didn't really see you looking around restlessly or anything...\", I said.\nHe replied unconcerned. \"Really self-conscious people don't let themselves be seen looking around nervously. Rather, they make it look natural. You'd know if you tailed someone else that normal people do baffling things like stop and look behind them more frequently. I actually provided an easier environment for you to stalk me.\"\nIn essence, he'd seen through everything. I let out a deep sigh with the smoke.\nYet I didn't feel much in the way of regret or embarrassment. I didn't know how I'd felt so calm just a moment ago. Perhaps I'd already gotten accustomed to Tokiwa knocking me down.\n\"So what are you going to do with me?\", I asked. \"Turn me in to the police?\"\n\"Certainly not,\" he shook his head. \"You might think that surprising, but... I can't see what you've done to me in the past month as ill-natured. In fact, I think I'd like to thank you. Not that I liked being watched from the shadows, no. What I mean to say is, by you watching me all this time, I've come to acquire your point of view. And such a wondrous thing it is; it can't be found in abundance in this world.\"\nI didn't particularly grasp his meaning, but he went on innocently explaining.\n\"I've been rather blessed, but if I had to say I was unhappy about anything in my life, it's that I've been too happy since I was very young. And it's by speaking as the person I am that what I'm about to say has meaning - happiness gets wearisome when you get too used to it. It's like eating sugar for all three meals every day. It numbs your tongue, and you can't taste the flavor anymore. I'm not lying. Almost every day, all kinds of people praise me, innumerable women show their affection for me, and I have the best girlfriend I could ask for... But one day, I realized that I didn't feel a thing.\n\"After that, I was putting on a smile, but deep down it was like I was chewing sand. Worryingly, while happy things couldn't really make me happy, I was easily able to get gloomy and angry over sad and annoying things. I was disturbingly dulled to the positive, but well-attuned to the negative. ...Can I have a cigarette?\"\nI silently passed Tokiwa a Pall Mall and a lighter. He lit it with experienced hands, looked briefly at the Morrissey pictured on the lighter, and handed it back.\nI suddenly wondered if Tokiwa knew Tsugumi was a smoker. If he didn't, I came out just barely ahead in terms of knowing her.\nSo I clung to that memory, and replayed it in my head. Remembered her pretty fingers holding the slender cigarette.\n\"But,\" he continued after a smoky breath, \"when you showed up, it brought about a bit of a change in me. Essentially, by having you following me, I got your viewpoint. The whole time, I was wondering... Not \"Why would he want to follow me?\", but \"How does he view someone like me?\" That was what intrigued me. Before I went to bed, I always thought back on what had happened that day, and imagined how it would look through your eyes. I couldn't help myself. I guess people like me get very reflective when they're alone. Wondering how my words and actions were seen by others, and what meaning the things said to me had - there are people out there who stay up all night thinking about it, you see.\"\nYou didn't have to tell me that, I said without speaking. I knew it was true of none other than myself.\nTokiwa skillfully spun the cigarette between his fingers, and said \"Well.\"\n\"I suppose it was about two weeks after you started following me. I suddenly realized there was a big change going on inside me. It was an unbelievable thing. My numbed senses were coming back to me.\"\nHe said that without irony, as if he was speaking of a truly beautiful memory.\n\"When I woke up in the morning, I was filled with hope for the coming days. When I looked in the mirror, I was glad to be born this way. Walking through town, I adored each and every person I saw. When I saw my girlfriend's face, I was filled with gratitude for being able to meet her. Flowers were flower-like, rocks were rock-like - their individual qualities jumped out at me. Everything was perfectly normal and as it should be. Too normal, even. And perhaps I'd never before been able to look at the world in such a normal way since I was born. I was going to faint with joy. I was finally able to accept that all-too-common happiness as appreciable happiness.\n\"At first, I thought it was only temporary. And indeed, as time passed, that joyful feeling lessened. By the time lunch with my friends at school came around, it seemed gone without a trace, like it had never been. But just as I was despairing and looked up... though quite far away, there you were. Suddenly, my joy was as clear as before. I wanted to stand up and celebrate, no kidding.\n\"Finally, then, I realized. That happiness was something you gave me. By borrowing your viewpoint to look at myself, I could see the happiness that had become commonplace to me in a new light.\"\nThere, he temporarily stopped.\nI had listened in silence, and I understood what he was saying. After all, it was similar to the way I always grieved about my situation more than I needed to, thanks to my memories.\n\"There's one thing which you should be aware of. My stalker had to be you. If someone else were to have followed me around like this, I don't think I would be able to so passionately consider their feelings. So in that sense, I'm very grateful to you. It may sound sarcastic, but... You really resemble me in a way. I don't mean to displease you, but what I honestly think when I see you is, \"With just a single misstep, I could have ended up like him.\"\n\"...I'm convinced we're the same at our foundation. Alarmingly similar in our initial conditions. I believe it's possible that coming from the same place, the slightest difference in environment or twist of fate could result in such a difference. So I know how you feel. I can even imagine what you must think of me.\"\nOnce finished, he took a deep-blue notebook from his bag. \"Give me a moment, I'll be quick,\" he said, beginning to write something.\nThree minutes later, he ripped out the page and handed it to me.\nWhen I saw the paper, I was moved rather than offended.\nHe explained what he'd written. \"I still don't know why you're following me. However, if you would continue to harmlessly do so, then please refer to this. I've written everything I currently know about my schedule for the near future. It must be difficult work to follow me.\n\"...Christmas is coming up soon. When it does, my life will be more fulfilling than ever. And if you could see that it is... nothing would make me happier.\"\n[+]",
      "scraped_at": "2025-11-20T20:35:31.151888",
      "content_scraped_at": "2025-11-20T20:35:31.765167",
      "error": null
    },
    {
      "id": "52",
      "number": "52",
      "title": "Chapter 52: * 52 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/52/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "With all the trees and store fronts lit up, Christmas songs playing everywhere you went, and the huge fir tree at the train station, the town was turning the colors of Christmas.\nIt had been four days since my talk with Tokiwa on the bridge. I continued to stalk him as usual; I was having coffee at a café at the station, waiting for him to show up.\nI could get a good view of the plaza from there, you see. Which Tokiwa and Tsugumi often used as a meeting place.\nMany of the people sitting around me were either couples or pairs of women.\nEvery single one of them was deeply entrenched in conversation. I seemed to be the only loner.\nI pulled my mug up to my lips and took a sip. The coffee had gone cold and tasted like detergent.\nJust what was I doing?\nTo be blunt, nearly all my reason for tailing Tokiwa had been annihilated. I'd been completely found out.\nIt would be fair to say it was impossible for me to act out against him now.\nSo then why did I let my stalking drag on? \"To remember.\"\nMy memories of my first life, already so fuzzy, seemed to get even hazier around this time.\nIt was bad enough that if I wasn't paying attention, I could even forget that this was my second time living these years.\nTo be honest, tailing Tokiwa and seeing him with Tsugumi was useful for strengthening my memories.\nIf I hadn't done that, by now I'd have become convinced I was always like this from the start.\nOr perhaps I would have been happier that way. When I had a point of reference, it made me keep seeing my second life as so much worse.\nIf I could look on the bright side, even my life now wasn't bad enough to throw it all away. The college I went to wasn't so bad, and there were lots of books to read and songs to listen to.\nAnd while she could be hard to understand, my sister seemed to care for me as well.\nSo what if I was a shut-in for a year? I could just think of it as a gap between high school and college.\nAlas, it was impossible for me to think that way. If I could just forget my first life, it would be easy.\nBut on the other hand, even knowing the pain those memories brought me, for whatever reason I couldn't bring myself to forget.\nNo matter what, I wanted to remember that the world, my life, had had such wonderful things in it.\nI honestly felt it would be better to die cradling the memories of my first life than to try and live my second life happily, if the latter meant forgetting.\nTsugumi arrived at the plaza before Tokiwa. She sat on a bench with a green paper bag under her arm, and looked up at the station clock.\nDouble stalking... I wondered if the \"friend\" Tokiwa had asked to follow me could have been Tsugumi.\nThat would have meant the worst - that the day we met at the library, Tsugumi knew that I was stalking Tokiwa.\nEven the way she cordially talked to me could have all been to hide her intentions, I considered.\nIn a few minutes, Tokiwa appeared on the plaza. When Tsugumi saw him, she held up the bag and proudly showed it to him. Tokiwa reacted with exaggerated surprise.\nThe contents of the present could have been an early Christmas gift, or a birthday present.\nIf Tokiwa's birthday was the same as mine, December 24th, then it wouldn't be odd if Tsugumi gave him a birthday present a week early to prevent overlap.\nAfter taking the present, Tokiwa looked in some direction as if noticing something. Indeed, it was in my direction - it seemed he'd noticed I was here standing guard.\nAnd then he waved at me, of all things. Such innocence.\nI hurriedly lowered my head, hiding in their blind spot. My face was hot all of a sudden, and I clutched my head.\nTruly, what on earth was I doing?\n[+]",
      "scraped_at": "2025-11-20T20:35:32.768140",
      "content_scraped_at": "2025-11-20T20:35:33.465473",
      "error": null
    },
    {
      "id": "53",
      "number": "53",
      "title": "Chapter 53: * 53 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/53/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I didn't lift my head up for a while. After about ten minutes, thinking they would have left the plaza by now, I was about to raise it.\nJust then, I noticed for the first time that there was a girl sitting to my left.\nAnd this was funny - as she sat four seats away, she was holding her head in much the same way as me.\nA man and a woman sitting in a café, quite a distance apart, and yet acting in just the same way. How odd.\nIt seemed even odder when I realized it was Hiiragi.\nThen I remembered, that's right, she was stalking Tokiwa too.\nI wondered, then, if Tokiwa knew about Hiiragi as well, and instructed her to keep doing it, even going so far as to politely write out his schedule.\nHe had told me \"My stalker had to be you,\" but it seemed to me that it could have been Hiiragi, too.\nBecause in terms of his reasons for \"why it had to be me,\" Hiiragi and I were like twins.\nHiiragi got out of her seat and went to the counter to order a refill of coffee. She didn't seem to have noticed me.\nShe was wearing an unfashionable white sweater, her outfit yet again completely different from what I last saw her in. Yet it strangely suited her.\nSome people just aren't suited for a refined look. Yeah, I'm probably one of them too.\nOnce Hiiragi got her refill, she went to the condiment bar, took the lid off her paper cup, and began dumping in ridiculous amounts of sugar.\nI wish you could've seen it. It was like her objective was to make a thick soup.\nShe took her sugar-with-some-added-coffee drink back to her seat and savored it, drinking with both hands.\nAll of a sudden, I felt there was something stunningly nostalgic about it.\nIt's like the feeling when you listen to a hit song all the time, then don't listen to it for years, and then you hear it on the radio again a decade later.\nMy eyes were fixed on Hiiragi drinking her coffee for a while. But I really didn't have a clue what my brain was so nostalgic about.\nYet it could certainly not be directed toward anything else, that much was certain. It was definitively coming from Hiiragi.\nOf course, Hiiragi had long been a friend of sorts. We were classmates ever since middle school.\nBut that just made it stranger. Why such a sudden longing over someone who's stayed around me for so long?\nShe shouldn't have been giving me such a sensation.\nFinally, I succeeded at finding a good, proper word for the sensation.\nDeja vu.\nI had seen this very sight once before.\nNo, more than once - countless times, I'd seen Hiiragi just like this, at this angle, in this café.\nIt wasn't a memory from my second life, so by necessity it was a first-life one.\nSomething overlapped with Hiiragi. Immediately, I was struck with great unease.\nHad I? Had I been making such an unbelievable mistake?\nHiiragi looked up, and we finally met eyes.\nNo, we never spoke up to each other. We'd gotten good at communicating intentions with our eyes alone in our third year of high school.\nHiiragi's eyes spoke volumes. Just two or three seconds of contact told me a great many things.\nSo... by the time she looked away, I was already convinced.\nShe had memories of \"the first time.\"\n[+]",
      "scraped_at": "2025-11-20T20:35:34.473724",
      "content_scraped_at": "2025-11-20T20:35:35.003302",
      "error": null
    },
    {
      "id": "54",
      "number": "54",
      "title": "Chapter 54: * 54 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/54/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Why had I been so convinced Tsugumi was my former girlfriend in the first place?\nIndeed, it was true she satisfied the characteristics I remembered: \"Sleepy eyes, long eyelashes, always thinking.\"\nBut was there not a single other girl like that? Had I really been weighing every possibility?\nI looked over at Hiiragi again.\nIt went without saying. Her eyes were always sleepy. Her eyelashes were long. I didn't know if she was thinking behind those sleepy eyes or not, but she got along with me rather well.\nI finally understood everything.\nThat my mistakes had begun much earlier.\nThat my choices were even more foolish than I thought.\nIn short - I was not the only one who had my role taken away.\nThe one I had confessed to in middle school was a mistaken identity; the girl for whom I'd commit murder to get back, the wrong person.\nThe couple I had been forever watching from the shadows were our doubles.\nNot just Tokiwa. Tsugumi, too, was the same kind of doppelganger.\nAnd my real girlfriend had always been right there beside me.\nHiiragi. The only one who hoped to match me in misery. It was her.\n[+]",
      "scraped_at": "2025-11-20T20:35:36.014357",
      "content_scraped_at": "2025-11-20T20:35:36.508486",
      "error": null
    },
    {
      "id": "55",
      "number": "55",
      "title": "Chapter 55: * 55 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/55/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "When I realized my former girlfriend was right there, was in a similar situation, and experienced the same kind of anguish... on the contrary, I wasn't happy.\nIn fact, it only seemed to deepen my despair.\nWhy? Well, even if Hiiragi here was my real girlfriend, the one I loved more now was Tsugumi, the “fake\" who better resembled her from my first life.\nI wasn't concerned as much with “original or copy\" as with “who will make me feel the same way as the first time?\"\nThe genuine article had changed, so I had little interest in her anymore. The right answer isn't always right, you could say.\nA mistake just doesn't seem worth fixing once the mistaken party goes on with it for ten years.\nWhat's more, I was dejected knowing that Tsugumi who I sought was not my former girlfriend at all; effectively a complete stranger.\nThere was no longer any foundation for her and I to get together now, was there?\nThe eternal bond I believed in wasn't with the girl on the plaza, but with the girl with head in hands beside me.\nLooking Hiiragi over with the consideration that she was my girlfriend the first time around, I felt like I was looking objectively at my own second-self.\nI knew to a dreadful degree how people who knew me in my first life would react to seeing me now.\nNo, it wasn't a very good feeling.\nFor these reasons, it was not a fateful reunion.\nAs my \"true first girlfriend\" looked lonesomely over the plaza, I felt that she needed someone warm beside her.\nAnd just this one time, I feel like I wasn't mistaken.\nBut I didn't speak to her, and left the café.\nBecause just like I didn't need Hiiragi, but rather Tsugumi, she didn't need me. She needed Tokiwa.\nIt just wasn't going to work out. But that all started with me.\nIf I had not made my mistake in love at first sight, perhaps Hiiragi and I, though not living a perfect recreation of our first lives, would be happy together.\nNo, I couldn't deny that we could have been even happier than before.\nAnd if I hadn't messed things up with not just Hiiragi, but with my sister, my parents, Usumizu, all those people, there was no doubt they would have lived ever so slightly happier lives.\nThat's around where I cut myself off from thinking about it any more.\nI give up now, I thought.\nIt seemed like it was about time to just forget about my first life entirely.\n[+]",
      "scraped_at": "2025-11-20T20:35:37.513106",
      "content_scraped_at": "2025-11-20T20:35:38.051790",
      "error": null
    },
    {
      "id": "56",
      "number": "56",
      "title": "Chapter 56: * 56 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/56/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I lit up a cigarette and prayed the world would end.\nA vehement prayer for everyone who knew me and everyone I knew to just vanish.\nThen I'd be able to do it all over from the start.\nAt the time, I was living with absolutely no connections to anyone. I was fed up with the uncertainties of other people.\nI knew how difficult it was to live completely and utterly alone. But to live something incredibly close wasn't so difficult in this world.\nThere are lots of people who die unknown and not knowing anyone themselves.\nAfter I got home, I smoked like a chimney in winter.\nMy sister fumed amid the fumes. She told me to stop again and again. I just ignored her.\nI wanted my apartment and my head to be filled up with smoke. I didn't want to see a thing, I thought.\nMe flat-out ignoring my sister's complaints was unprecedented, so she was thrown off. Though a typical braggart, she was a coward at her core.\nWhen she saw how I was acting different than usual, she simply withdrew and said nothing more.\nBy the time I finished with my twelfth cigarette, my sister asked with hesitation, \"Big brother, you always said you hated smoking. Why'd you start?\"\nAfter taking a puff from my thirteenth, I answered \"Maybe because I lost everyone who cares.\"\nAccording to my unreliable memories, in my first life I had smoked incessantly up to a certain point.\nBut then I quit. Because my girlfriend was worried for me.\nShe didn't mean to blame me, but said something along the lines of \"I don't want you to make your life shorter,\" and that did it for me.\nIt felt ridiculous to willingly shave away at the time I could spend with her, after all.\nAnd yet now, in my second life, I had no one left who worried about me. Not a single person who cared about my life getting shorter.\nIn fact, maybe I smoked even more than necessary for that very reason.\nMy sister didn't seem to understand my statement. Because I made it sound like until recently, I did have someone who noticed and cared about me.\nBut, well, she didn't press it any further. She seemed to understand that I probably wouldn't answer anyway.\nInstead, she slowly approached and gently reached her hand for my mouth.\n\"...Well, I care. Please stop.\"\nThen she took the cigarette in her fingers and pulled it out.\nI took a look at her. She looked at me with her usual sober eyes, but she seemed to be blinking more.\nI lit a new cigarette and released a mouthful of smoke.\nMy sister started hacking and coughing.\nI took a piece of paper out of my pocket and gazed at it. It was Tokiwa's schedule.\nI put it on the ashtray and held my lighter up to it, but I couldn't bring myself to burn it.\nBecause though it wasn't much, it did mention things about Tsugumi. Regrettably, even if it was just a scrap of paper, I figured anything to do with her was to be treasured.\nI put my cigarette out in the ashtray and took a book from the desk to read. But it wouldn't stay in my head.\nHad I really ever thought that I would be able to kill Tokiwa?\nAnd if I had miraculously succeeded, did I honestly believe Tsugumi would come to love me instead?\nI really must have been crazy to think that.\nMaybe as a defense mechanism to cope with the shock, I soon found myself sound asleep.\nAs if hoping to induce necrosis in my brain cells, I slept for fourteen hours.\nWhen I woke up the next morning, my sister was gone.\nThe next day, and the day after, she showed no sign of returning.\n[+]",
      "scraped_at": "2025-11-20T20:35:39.054607",
      "content_scraped_at": "2025-11-20T20:35:39.567817",
      "error": null
    },
    {
      "id": "57",
      "number": "57",
      "title": "Chapter 57: * 57 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/57/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "In the end, I gave up on my plans to kill Tokiwa.\nBut, irritatingly enough, I came to learn that wishes are always granted just when you stop wishing.\nA week passed in the blink of an eye, and the tail end of December arrived.\nAfter my sister disappeared, I applied for every part-time day job I saw. I had enough emails about them to fill my entire schedule for December if I felt like it.\nNot that I was interested in earning money from them. I just wanted to empty my head.\nI wanted to forget a lot of the things that happened. And since I had no reason to tail Tokiwa anymore, I had a lot of time on my hands.\nI was asked to do a lot of one-day jobs, like working as a waiter at a packed hotel, helping with stupid holiday events, and doing traffic control - I let these consume my days.\nI always hated working with strangers, and as was common with this kind of work, I was irrationally scolded by energetic full-time employees.\nThere was nothing fun about it, and it didn't even help lift my spirits, yet it was better than doing nothing.\nWhen I got home late at night, I'd drink cheap whiskey on the rocks, skim through books my sister left behind, and when I got sleepy, crawled into bed while listening to music.\nThe cessation of thought is easy once you get used to it.\nIn no time at all, the memories of my first life grew hazy.\nOne day, while walking home through piles of snow after work, I looked at my phone to confirm my plans for tomorrow and noticed an answering machine message.\nThinking it came from my college, I deleted the notification without even checking. No doubt it was something along the lines of \"make up your mind, are you dropping out or not?\"\nThe thing was, though, it was an answering machine message. That meant it came from a public phone.\nIt's another testament to my idiocy, but at first I thought it was from Tokiwa, then immediately afterward got my hopes up thinking \"Wait, hold on, could Tsugumi have called?\"\nEven now, I had that unfounded hope that Tsugumi would come save me when I was in trouble. I doubt anybody could save me from my stupidity.\nOf course, Tsugumi had no way of knowing my number or anything in the first place.\nThe message was from my sister. Her voice was just barely audible.\n\"Big brother, I want you to come home. ...Um, it's really bad between dad and mom right now. It would be fine if they divorced, but... I don't know if that's how it's going to end. ...I mean, I don't really know if you coming home is going to do anything. But I don't know what else to do.\"\nAfter a few seconds of silence, she ended with a whisper.\n\"Hey, big brother... I really don't like to do this.\"\nNeither did I.\n[+]",
      "scraped_at": "2025-11-20T20:35:40.573718",
      "content_scraped_at": "2025-11-20T20:35:41.050314",
      "error": null
    },
    {
      "id": "58",
      "number": "58",
      "title": "Chapter 58: * 58 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/58/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I didn't feel like going straight home, so I didn't turn at the corners I should have, and did turn at those I shouldn't.\nI was sweating from work, and my body felt chilly in an unstable way. It was a truly awful kind of cold.\nWithout even being aware of it, I was humming Radiohead's \"Creep.\"\nMiserably, I knew the feelings of that song all too well in my second life. Because I wasn't someone wonderful who could match with Tsugumi.\nWhile walking down the shopping district to the train station, I saw around ten kids in elementary school uniforms putting on a performance with handbells.\nI found myself stopping to listen. Looking closer, there were kids playing other instruments like accordions and sleigh bells too.\nIt was some fine music. The apparent teacher conducting them looked like he was having a blast.\nPast the shopping district, I reached the residential district.\nThere I found families outside their houses, smearing them with absurd amounts of decorations and lights.\nThe children were frolicking, and the parents diligently put up the decorations on the walls, trees, and fences. I watched from a distance.\nSeeing this from not too far away, I was startled. Why are they so different from me?, I thought. It felt like we weren't even the same species.\nAfter some time, the children said \"One, two, three!\" Then the colorful lights lit up all together, at once turning the house into what looked like an amusement park.\nIt was a splendid thing, and it certainly echoed images of Santa Claus and reindeer.\nI left the residential district, as if running from it. There were lots of happy houses around, and I wouldn't be able to stand watching the same thing repeatedly happen.\nWhile walking aimlessly, I arrived at a small convenience store I often went to. I considered passing it by, but thought it over and went in.\nFighting the urge to warm my hands with some hot coffee, I grabbed a bottle of whiskey and took it to the register.\nAt the counter was Hashibami, the usual clerk. She was a tall woman, but definitely not the modeling type, and she didn't seem to know what to do with that height herself.\nI judged she was about three or four years older than me. Her hair was light brown, her voice low like a heavy drinker, and she gave me a general impression of frankness.\nI tended to visit the store around 11 PM, upon which I always bought a long can of low-malt beer and a box of Pall Mall Reds.\nI wasn't fussy. In fact, since I wasn't fussy, I just bought the cheapest things I could to satisfy me.\nSince I bought the same thing so many times, she came to know my face, and after that, took to immediately preparing a box of Pall Malls as soon as she saw me walk in.\nNo doubt when Hashibami saw me, she thought \"Ah, it's the cheap beer and smokes guy.\" Kind of embarrassing.\nSince she always prepared, I couldn't bring myself to suddenly say \"Five boxes of Peace, please.\" So I'd been smoking the same brand for months.\nBut that day, when I brought up whiskey and a chocolate bar, no cigarettes, Hashibami seemed a bit confused. She bagged the items a little more awkwardly than usual.\n\"No Pall Malls today, huh. Did you quit?\", Hashibami modestly asked as she handed me the bag.\nI liked the way she put it, as well as her genuinely surprised expression. It calmed me down a little.\nOf course, I was just happy to have anyone show some interest in anything I did. Even if it was just some shopping.\n\"No, I just wanted to surprise you,\" I said. I hadn't joked around with anyone in a while.\n\"Well, you succeeded,\" Hashibami laughed. \"So it's not that you've quit, then?\"\nShe thought for a little bit, then said \"Oh well,\" and lifted up a little vinyl bag at her feet to give it to me.\n\"Those are some past-expiration-date cigarettes. Personally, I never knew cigarettes had an expiration date. I mean, it's typically not a concern for those who smoke them. My manager actually told me to throw them all away, but that seemed like a waste, so I'll give them to you.\"\nI looked in the bag. It was an assortment of unpopular brands, about twenty packs in all.\n\"Is this okay?\"\n\"Well, no, it's not. But I think it's a good thing.\"\nWhile I puzzled over whether it was right to accept them, Hashibami leaned on the counter and tapped me on the shoulder.\n\"I'm the anti-Santa Claus. Rather than give good children toys, I give bad adults beer and smokes. Because they're the ones who really need presents, not the good kids. ...So go on, take them and leave.\"\nI smiled bitterly and asked, \"You hate Christmas?\"\n\"No, I love Christmas. Always have, since I was a kid. ...The problem is, I'm in no position to take part in what I consider Christmas. When it comes to Christmas in this country, there are some high hurdles for me.\"\nThere were other customers lining up, so I thanked Hashibami and left.\nI quickly got to smoking one of the cigarettes I'd been given, and wandered the wintery town at night.\nI stuck my free left hand into my pocket. Because it was cold, yes, but it was also a habit of mine. I couldn't help putting my free hand in my pocket; if I didn't, I just couldn't keep it calm.\nI've thought about why, and I wondered if it was because I was used to having someone's hand to hold when I walked in my first life, but never did in my second.\nLike my hand was lonely. There's the theory about people smoking because their mouths miss sucking their mother's breast, so you never know.\nI walked around looking for a good spot, then found a great one in the park.\nIt was a small park under a bridge, surrounded by withered trees, empty cans and paper bags scattered about, holes all over the fence. Just the kind of place I liked.\nI sat on a bench and put out my cigarette on a handrail. The red embers scattered, a few of them falling to the ground and quickly vanishing.\nI opened up the whiskey and drank it straight. The bottle had chilled considerably by now, but just one sip made my belly warm.\nI had only meant it to be a joke. I just wanted to walk around drunk all night and numb myself a little.\nBut... if I fell asleep drunk like this, I really might freeze to death, I began to think.\nMy body quickly absorbed the alcohol and I felt my senses get numb. Plus I was feeling pretty sleepy.\nThanks to Hashibami, I was feeling just a little better about myself, like I could maybe actually do it.\nAnd if I had been feeling just a little worse, I don't think I would have been thinking about suicide like this.\nThe most dangerous times are when you're feeling down in the dumps, and only recover halfway.\nI was excited to have been given this sudden chance.\nIt's strange, but when you get to this stage, regrets are comforting. If it's a strong enough emotion, anything is comforting.\nIt all starts to seem like someone else's business. When it gets really bad, you can even delight in despair.\nThat's why I did all I could to think about sad things. I tried to be one of those guys who recalls all his regrets on the brink of death.\nI tried to seriously face up to the thoughts I'd been avoiding before.\nMy head was murky with weariness and alcohol, so I couldn't remember very well. But a few blurry images came to mind when I thought \"regrets.\"\nOne of them was, naturally, a vision of \"what if things had gone better with Tsugumi.\"\nI saw in my mind us talking aimlessly about trivial things, like we had done that day at the library.\nBut that wasn't all the vision was. I saw one wonderful thing after another that \"could have happened.\"\nI won't bore you with every single one.\nBut I was a little surprised to see such a vision.\nI came to understand, as I thought about these happy possibilities, that there had been these fragments of happiness scattered all around.\nYet I was ignorant to them all, or at times even stomped them into bits myself.\nAnd why? Because I was only ever thinking about my first life.\n[+]",
      "scraped_at": "2025-11-20T20:35:42.052757",
      "content_scraped_at": "2025-11-20T20:35:42.551903",
      "error": null
    },
    {
      "id": "59",
      "number": "59",
      "title": "Chapter 59: * 59 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/59/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I think I might have sat on that bench until four in the morning.\nI couldn't stop shivering, and I started to cough like I was sick, but I showed no signs of dying; I was just very cold.\nSo I eventually went home, pulled the blankets over me with shivering hands, and slept.\nI remembered how when I was in elementary school, when I really didn't want to do something, I bathed in icy water to try and give myself a cold. It never worked out.\nI woke up in the dim afternoon, turned on the heater, and forced some cereal and milk into my empty stomach despite having no appetite.\nI went outside and smoked the cigarettes Hashibami gave me. I was feeling pretty sluggish, but it wasn't a cold or pneumonia. I was healthy, just without energy.\nBy the time I went back inside, my plan was settled.\nI thought what I'd do was, I'd continue soaking in part-time jobs like this, and once I'd saved up enough money, I'd leave on a journey.\nI'd go as far south as I could. And then once I ran out of savings, I'd be a vagrant or something.\nEssentially, I thought I'd imitate my former best friend Usumizu.\nI know it's crazy, but that's really what I wanted to do. Yeah, I'd just have the occasional meal to look forward to, and for entertainment I could look at the stars and flowers, and listen to the birds and bugs, and the weather would be my biggest worry in life. That's what it'd be like.\nAnd I thought while living the vagrant life, I might just meet Usumizu who was doing the same. And then we might be best friends again, like we had been the first time.\nWe'd share pieces of bread, have turf wars with other vagrants, work together to gather cans, and compete over silly things like who could get more. Just like that.\nEvery day, we'd sleep under the stars and wake up with the sun. Then I just wouldn't care about my first life anymore, just bare necessities.\nBoy, wouldn't that be real living.\nBut there was a part of me that looked at that fantasy soberly.\nIn the end, I'd probably never meet Usumizu, wouldn't be suited for a vagrant's life, and would just die alone kicking and screaming.\nSaying \"It shouldn't have been this way\" to the end.\nIf I died, though, nobody would care. Well - maybe my sister would shed some tears for me.\nDespite appearances, she was a sweet girl who looked out for her brother. Lately I'd come to realize that part of her hadn't changed.\nShe came to my place because she couldn't stand home, yeah, but I feel the other half of it was to console me.\nMaybe I'm wrong, but I like to think I'm free to think what I like.\nI wondered what would happen to my family if I were gone.\nMaybe it'd just break up, increasingly unable to keep itself together.\nOr maybe without me, the three of them would come together for each other to fill the gap.\nEither way, it seemed like a much better situation than what it was now.\nIt wasn't a spirit of self-sacrifice that made me feel ready for death; I just thought, if my passing brought about some good, that would be nice. It was a personal concern.\nMy thoughts of self-abandonment deepened. Ironically, the moment I discarded all attachment to the world, I could see the world's charms.\nWhile I thought of \"the world I lived my life in\" as a good-for-nothing place, when I took away my involvement, it was stunningly beautiful.\nA while later, I headed for my part-time job of the day. Even the cheap Christmas decorations I saw on the way were enough to move my heart.\nThe faint snow dyed orange by streetlights was a sight I couldn't tire of, and I even enjoyed taking a close look at the shape of every little icicle hanging from a roof.\nI was like a visitor to the town who had never before seen snow.\nIt became very clear to me. Even things you don't hold much value for - as soon as you lose them, or as soon as you realize you did, you start to see them as irreplaceable.\nThe moment you think you want to die, life starts to sparkle, and the moment you think you want to live, death starts smelling sweet.\nBut as much as I understood that, until I had truly lost everything, I couldn't really feel that way.\nIt's not something people are all that capable of adapting to. Talk about inconvenient.\n[+]",
      "scraped_at": "2025-11-20T20:35:43.566460",
      "content_scraped_at": "2025-11-20T20:35:44.062906",
      "error": null
    },
    {
      "id": "60",
      "number": "60",
      "title": "Chapter 60: * 60 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/60/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "It should go without saying that in my second life, I hated Christmas.\nBut that's not to say I hate the spirit of Christmas, or Christianity as a whole. What I loathed was how every time someone said the word \"Christmas,\" it felt like an excuse.\nIt's a lot like how you can get disgusted by someone constantly saying \"volunteer.\" Not that there's anything wrong with volunteering.\nOf course, my first self had no doubt rather enjoyed going around saying \"Christmas\" like an excuse.\nSo I was quite aware my hatred of Christmas might just be a bias there. Plus, of course I'd come to hate a birthday that nobody celebrates.\nBut whether it was bias or envy, I hated it, I hated it. So when I realized what part-time job I'd signed up for on December 24th, I knew I'd screwed up.\nMy plan was to just apply for any part-time job I saw, only looking at the hours, never at the actual job description.\nSo I didn't realize until the day of that I'd be working in a crowded department store, dressed up as Santa all day, to help with a raffle.\nI could've very well skipped on it and taken the day off, but thinking about it, spending the whole day holed up at home seemed even more depressing.\nI could see that either way I'd be feeling awful. So I concluded that it was better to go with the one that got me money, and left the house.\nWhen I entered the employee entrance of the department store, not feeling in any way festive, there was already a crowd of about twenty idly curious people who similarly applied for a part-time the day before Christmas.\nFrom their faces, most of them certainly did not look like they had Christmas plans, but there were a few who brought their significant others along, which just made things awkward. I had to laugh a little.\nMost of the volunteers were college students, and most brought friends. Including me, there were only four who came alone.\nOne was a man who looked quite accustomed to work, and another was a man with piercings who didn't seem to care about anyone else.\nThe last was the only girl - see where this is going?\nStanding uncomfortably in the corner was that girl I knew so well, Hiiragi.\nWhen she saw me, she bowed her head slightly. I did the same, but as ever, she didn't appear to know who I really was.\nStill, to think we'd meet here. We must have had very similar thought processes. I mean, we had been lovers in our first lives.\nI wondered if she had decided she'd rather pick this over holing up at home, too.\nA few minutes after everyone had assembled, they began explaining the work. Then, for the first time in a while, I heard the magic spell: \"get into pairs.\"\nSure enough, neither Hiiragi nor I had anyone to pair up with, so as the remaining two, we ended up together.\nIt hadn't happened since high school, so I felt bad in a nostalgic, comforting way.\nDressed in sweltering Santa suits all the way up to the hat, we had to see festive families and couples and tell them things like \"Merry Christmas!\" and \"Happy new year!\" with little to no heart in it.\nThere wasn't a single person on the other side of the table who didn't look happy.\nI thought, looking at Hiiragi next to me, that we would have formerly been on the other side.\nHiiragi struggled to be courteous to the guests, and that was heartbreaking to watch.\n[+]",
      "scraped_at": "2025-11-20T20:35:45.073774",
      "content_scraped_at": "2025-11-20T20:35:45.535491",
      "error": null
    },
    {
      "id": "61",
      "number": "61",
      "title": "Chapter 61: * 61 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/61/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "When we returned to a dusty meeting room for break time, we were distributed bento boxes.\nThe outside was all decorated in Christmas colors, but it was just a regular lunch on the inside.\nI left about half of it, tossed my garbage into a cardboard box, put my pass in my pocket, and walked around the store.\nIt wasn't my first time working here, so I knew they were pretty lax. Walking around as I pleased wouldn't get me in too much trouble.\nIt being Christmas, the store was crowded, yet the instrument shop on the fifth floor had hardly anyone in it.\nThere wasn't anything I particularly wanted to buy, but I found myself naturally drawn there.\nAs I gazed at guitars and organs, I recalled the music preparation room I often visited in high school.\nThat was also where I met Hiiragi the day of the graduation rehearsal, I remembered, which warmed my cheeks slightly.\nAs I walked from one corner of the store to another, something caught my eye: a Hohner Marine Band.\nIt was a ten-holes harmonica made of wood, and I actually kind of liked the design. Same way you can admire the functional beauty of a pistol. I even liked the ring of the name, \"Marine Band.\"\nAll of a sudden, I decided I'd buy it for my sister as a Christmas present. Whether she had any interest in instruments or not, I'd be alright if she just pretended to like it for the day.\nIt was just a little expensive for a harmonica, but I bought it without hesitation and even had it wrapped.\nI only realized after leaving the store, but a harmonica seemed like a perfect fit for my sister.\nIt was easy to imagine her little hands holding a harmonica and skillfully playing it. In fact, I felt like she must have actually played the harmonica in my first life.\nAfter that, I headed for the smoking area outside.\nI hadn't noticed while inside the building, but it was horribly cold. I didn't know when it started to snow, but it there was up to ten centimeters of it in places.\nThe clouds were so thick, the darkness made it feel more like night despite being afternoon. A ton of cars had their headlights on.\nI casually looked out over the parking lot, and saw a familiar blue car parked there - and my head twitched.\nIt was a car I'd seen often in my stalking days; that is, the car Tokiwa and Tsugumi rode around in. Being a fairly rare model, I knew it immediately.\nSo maybe I should have given that schedule Tokiwa gave me a closer look after all, I lamented. I definitely wouldn't have taken the job if I'd known those two would be here.\nAfter I finished my second cigarette, I leisurely returned to the break area. I got the schedule out of my bag and looked it over.\nAccording to the schedule, they were planning to get dinner at a fancy restaurant after this. Oh, joy.\nYou can probably guess what happened next; Tokiwa and Tsugumi came by the little raffle Hiiragi and I were running.\nThe moment I saw them, my eyes immediately darted around looking for a place to hide. I'd rather have died than meet Tokiwa at a time like that.\nI knew, with all certainty, that when he saw me in a place like this on a day like this doing this, he'd wring some happiness for himself out of it. I wasn't going to be his fodder today.\nI fled for the first place I saw, behind a Christmas tree up against the wall. It was a big tree, about five meters tall, so perfect for hiding behind.\nHowever, when I went around the back of the tree, there was already someone coming from the other side, and I skidded to a stop. It was almost a head-on collision.\nI don't think Hiiragi and I met eyes for more than a second.\nStill, we knew. We squatted together behind the tree and waited for Tokiwa and Tsugumi to leave.\nThankfully, we succeeded in them not seeing us, though it gave us a start when a kid came along and saw us, shouting \"Mommy, Santa's hiding! Two of them!\" Gimme a break, kid.\nAfter Tokiwa and Tsugumi left the raffle, I thought about what they were planning to do next. Perhaps Hiiragi, who sighed beside me, was thinking the same.\nYeesh, it's not often I feel this awful.\nFive o' clock came, and the end of the raffle approached; the visitors were petering out, too. Hiiragi and I idled together in the break room.\nIn the corner of the room was an old radio. It was wooden with two huge knobs, and played music very faintly.\nThere was nothing else to look at or listen to, so I focused on listening to the radio.\nIt was playing a song quite familiar to me.\nJohn Lennon's \"Starting Over.\"\nI started to casually and quietly hum along.\nOn this day in my first life, I thought, I'd done this too, hummed this same song.\nIt took a few seconds to realize I was remembering things I certainly shouldn't be able to.\nImmediately, I noticed a flood of memories from my first life coming back.\nA huge influx of information filled my brain so quickly that I almost fainted.\nAnd that was when I remembered that Tokiwa and Tsugumi were about to die.\n[+]",
      "scraped_at": "2025-11-20T20:35:46.616716",
      "content_scraped_at": "2025-11-20T20:35:47.113180",
      "error": null
    },
    {
      "id": "62",
      "number": "62",
      "title": "Chapter 62: * 62 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/62/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "If you look at a person's fortune in the long run, maybe it all balances out.\nThat perspective on life is usually adopted by luckless people as consolation.\nBut in this sole instance, one would look at it the opposite way.\nStrangely, I didn't show much reaction to this realization.\n\"Ah, right. Those two are going to die.\" That was all.\nI suppose it should have been something to rejoice over.\nAfter all, my hate for Tokiwa was unchanging, and Tsugumi couldn't ever be mine anyway.\nIndeed, when it comes to the unattainable, it's better that it just stops existing at all.\nI didn't feel sorry for them. Who cares? They've lived such a happy life already.\nIn fact, maybe you could consider it a happy thing that they could die in the peak of their happiness.\nNo doubt I could only say that as someone who'd lived a useless life for ten years.\nSix o' clock came around. If things were playing out how I imagined them, right now Tokiwa and Tsugumi were stopping the car radio and putting a CD in the stereo.\nIt was Lennon Legend, and they went from the first song, Imagine, down the tracklist in order.\nAnd by the time it reached the twelfth song, Starting Over, they would die.\nI stood up, went to the radio in the corner, and raised the volume.\nWhy had my memories come back just now? I pondered.\nWhy had I taken a break at this exact time? Why was there a radio in this room?\nWait - how long had there been a radio there? I knew that there hadn't been such a thing there last week, at least.\nI came to think that it was all a sign.\nBy the time the song ended, I had come to one baseless conclusion.\nI was being tested again.\nTo see if I could find the right partner in my second life.\nTo see if I could make the right choice.\n[+]",
      "scraped_at": "2025-11-20T20:35:48.139886",
      "content_scraped_at": "2025-11-20T20:35:48.594692",
      "error": null
    },
    {
      "id": "63",
      "number": "63",
      "title": "Chapter 63: * 63 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/63/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I wiped my wet face with a sleeve and looked at myself in the mirror. There I was, in that idiotic Santa getup.\n\"You have a right to know all this,\" I said.\n\"Every single thing is all my fault, for falling in love with the wrong person. If I hadn't done that, by all means I should have been living a life nearly unchanged from my first right now. And if I'd been the same, so would my family, and Usumizu, and you. Everything'd be the same, we'd still be living fulfilling lives.\n\"But I made an awful mistake. I messed up who I fell for. And on top of that, I went on believing she was the girl I was destined to be with, never noticing what I did wrong until this winter. Because I'm an utter moron. That threw all the cogs out of whack. Even a guy who I was really close to in my first life was awful to me the second time around. I'm like a contagious source of bad luck.\n\"In my second life, I became someone unfit for the position of \"the first me.\" And why should that happen, but the appearance of my double. Someone else was playing the part that had been given to me in my first life. And my girlfriend became someone no longer suited the role of \"the first her\" either, so that position was taken by her double. So we became friendly losers. I guess it's not impossible that could've been fate, but that's one piece of crap fate.\n\"I'm not the only one who fell in love with the wrong person. But Hiiragi, I know you couldn't have helped doing it. Anyone who knew me in my first life would have assumed \"I\" was Tokiwa, not my second-life self. ...Then again, us both falling for the wrong people made things get increasingly out of control. We couldn't have \"just passed each other by\" any harder.\n\"So we loved the wrong people. ...But this is what I think. Even if that love arose from a mistake, ultimately, it's the more real one for our second lives. Because of our initial misconception, we went thinking about Tsugumi and Tokiwa respectively for years. Now, Tsugumi is the \"real deal\" for me, and Tokiwa for you.\n\"And, to tell the truth, both of them are going to be gone from this world within an hour. ...I was thinking about it, and I feel like this is an ideal development for us. Because if we just keep waiting around like this, Tsugumi will never be mine, and Tokiwa will never be yours. Plus, whenever we see them, we'll unwillingly remember our first lives, forever trapped in the past. So it's for the best if Tsugumi and Tokiwa just go away. Then we'll be finally able to escape our impossible dreams and unfixable regrets. Yes, the moment they're gone, our second lives can actually begin. It's the most realistic, wisest way. We'll forget all about our first lives, forget all about Tokiwa and Tsugumi...\"\nI stopped.\nThat was enough.\nI exited the bathroom, back into the break room.\nI would just have to face Hiiragi and tell her the long speech I'd been practicing.\nThat was all there was to it.\n[+]",
      "scraped_at": "2025-11-20T20:35:49.606040",
      "content_scraped_at": "2025-11-20T20:35:50.094613",
      "error": null
    },
    {
      "id": "64",
      "number": "64",
      "title": "Chapter 64: * 64 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/64/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "And yet I had no idea whatsoever why I did what I did when I returned to the break room.\nI looked at Hiiragi (who was listening to the radio with her chin in her hands), took her hand, and flew out of the room.\nBut I had no other choice, really. I didn't know if I would be able to do what I was about to do on my own.\nAnd if there was anyone who would believe and help me, it was her.\nChildren's eyes lit up when they saw the two Santas dashing through the store.\nWell, it wasn't something you saw every day.\nOne kid I passed by on the escalator desperately tried to run against the escalator to follow me, but didn't make much headway.\nIt was honestly a pretty adorable sight.\n[+]",
      "scraped_at": "2025-11-20T20:35:51.106093",
      "content_scraped_at": "2025-11-20T20:35:51.582583",
      "error": null
    },
    {
      "id": "65",
      "number": "65",
      "title": "Chapter 65: * 65 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/65/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Hiiragi didn't say anything and just followed along. Perhaps she found something nostalgic about the hand that grabbed her.\nAnd I think I was right to assume so; after all, I felt much the same way.\nGoing outside, we were met with a fierce snowstorm. I got Hiiragi in the passenger seat, myself in the driver's, and started the engine.\nVisibility was so bad, you couldn't even make out the lines on the road or any signs. Couldn't even distinguish sidewalk from the road.\nI got Tokiwa's schedule out of my wallet and tried to figure out the route they'd be taking.\nLuckily, I knew the restaurant they were planning to go to. By taking the shortest route from there to Tokiwa's home, I should have been able to find the intersection that would have the accident.\nFrom the first song Imagine, to the twelfth song Starting Over... Estimating each song at about four minutes, that would be fifty minutes.\nDefinitely cutting it close; I wasn't sure if we could make it in time.\nAnd there was more for us to do than just get there. We also needed to make some preparations.\nI listed the things we needed - things that would stand out.\nStrobe lights. Traffic control sticks. Lamps. Flashlights. The brighter, the better.\nA strong wind sent snow flying up in front of the car, temporarily blocking my vision.\nI reflexively let off the gas pedal, then noticed that I was crossing the divider and quickly swerved the wheel the other way.\nCome on, get a grip, I told myself. What'll we have to show if we get in an accident first?\nIt was a tense situation, yet on the other hand, I couldn't help finding it funny. A strange smile welled up to my lips.\nFinding yourself doing things you wouldn't expect yourself to do is perhaps one of the best things in life.\nThis mainly afflicted me in my second life, but it feels good when you're able to do “unexpected\" things that you can't yourself explain.\nCaught by a red light, I reluctantly stopped the car. I probably could have blown through it, but I took the unlikely into account.\nLooking at the clock, we weren't that pressed for time.\nI looked over at the passenger seat and saw Hiiragi looking at me like she wanted an explanation.\nI thought for a little bit, then broke the ice.\n\"Originally, we were the ones who were supposed to die.\"\nMaybe that wasn't an appropriate way to phrase it.\n[+]",
      "scraped_at": "2025-11-20T20:35:52.593461",
      "content_scraped_at": "2025-11-20T20:35:53.074711",
      "error": null
    },
    {
      "id": "66",
      "number": "66",
      "title": "Chapter 66: * 66 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/66/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "\"That Christmas when we were twenty. That's today. It snowed terribly in our first lives, too. ...Do you remember? The same way Tokiwa and Tsugumi just did, we left the department store with plans to get dinner at a slightly fancier restaurant than usual, then go home and relax.\n\"But on the way back from the restaurant, that fierce blizzard not only made it hard to see, but caused a power outage for quite a ways around. Romantic, if you want to look at it that way. A Christmas blackout... who knows, maybe Santa tripped on a power wire. But the problem was, the roads we were driving along didn't even have working stoplights. It was a really large-scale outage.\n\"We were listening to the Lennon Legend CD in the car when it happened. You'd heard Starting Over on the radio earlier, so you told me you wanted to listen to the very best of John Lennon. It was a pretty Christmasy idea, I'd say. We heard the first song Imagine, the second Instant Karma, Mother, Jealous Guy, Power to the People, Cold Turkey, Love, Mind Games, Whatever Gets You thru the Night, #9 Dream. When Stand By Me ended, and the twelfth song Starting Over began... That's when it happened.\n\"With the blackout and the blizzard, we could hardly see anything but snow. I was trying to drive as carefully as I could. But all of a sudden - it was really instantaneous - I felt a huge impact like my body was being blown to pieces. At the same time, I felt like there was this blinding light. Maybe a truck or something collided with us. Maybe it was an intersection, but I thought it was a straight road. With no time to prepare, no time to regret, our lives immediately ended.\n\"...And yet the next time I woke up, I found time had been rewound ten years. No, to be exact, time had been rewound for both of us. ...Maybe we can call it a Christmas miracle. At any rate, we were given a second chance.\n\"But why was there any need to send us back a decade? Just a minute would have been enough for us to avoid the accident. And yet we went back ten years, with parts of our memories damaged on the trip. You could also consider that damaged memories are just what you get when you rewind that far.\n\"...Let's say there is a God, or a Santa Claus, or whatever you want to call it, some absolute entity like that, who decided to give us another chance. Why did they rewind us ten years? Well, this is the conclusion I came to. Maybe they can't just directly save people in trouble, like poof, you're saved. Maybe they can only give them a fair second shot at it. They can avert an irrational death, but that's about all they can do.\n\"So I don't know the specifics of how it happened. But looking at the situation, maybe our role is a supporting one. To support of our doubles. To give the seats we sat in during our first lives to other people in our second. To give it up to that picturesque happy young couple, and resign ourselves to second lives the polar opposite of our first. And naturally, we succeeded. We handed the parts of getting in the accident to Tokiwa and Tsugumi.\n\"...I honestly don't know if that's for the best. Because if we died that day, then it meant our lives were perfect from beginning to end. I feel like that's the far better choice than living an empty ten years.\n\"If we ignore them, the same accident will happen, and their lives will be lost. If I'm right, then in theory, that would be exactly what we'd want.\"\nHiiragi listened intently, not saying anything.\nI again felt nostalgic seeing her nod in the corner of my vision.\n\"However,\" I said. \"Today is too joyous a day to overlook such a tragedy. After all, it's Christmas Eve, and we're even dressed as Santa Claus. What would Santa Claus be if he didn't spread joy? ...Plus, just as I loved my first life, in way I have to love the couple that's reliving it. Much as I hate to admit it, Tokiwa is a dear other-self. And as mistaken as it may be, second-life me loves Tsugumi. I'm sure you feel the same way about those things.\n\"So I'd like us to show that we can take advantage of having a second try. With all the lessons and reflection of the first go, we'll make the second go much better.\"\n[+]",
      "scraped_at": "2025-11-20T20:35:54.077103",
      "content_scraped_at": "2025-11-20T20:35:54.559878",
      "error": null
    },
    {
      "id": "67",
      "number": "67",
      "title": "Chapter 67: * 67 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/67/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Once we found the to-be scene of the accident and made our preparations, we appeared to be about five minutes from the power outage.\nI think we were able to prepare with so much time to spare thanks to Hiiragi immediately knowing what I was trying to tell her.\nWe stood together under a streetlight and waited for the power outage.\nHiiragi timidly tapped my shoulder and asked: \"Have you ever saved someone like this before?\"\n\"No. This is my first time,\" I said. \"So I wouldn't say I'm doing such a good thing here. I should have been someone who could save innumerable people's lives, but I'm only now choosing to save two people I wanted saved. But isn't everyone like that, more or less? I don't think I should feel especially guilty.\"\n\"...I see. When you put it that way, you might be right. It's my first time using my memories to save anyone too,\" she said. \"Ever since the second time started, I never once thought to use my memories to do anything. You can see how it turned out, but really, I just wished I could copy my past life -\"\n\"So did I,\" I admitted with guilt. \"Never had any other intention.\"\n\"...I see,\" Hiiragi smiled, her head low.\nHer smile was with lips tightly shut, and the corners of her mouth only slightly raised, but it was oddly reminiscent of my own.\nIt was a smile of precaution. An expression commonly worn by cowards who feared even happiness.\nMy heart was filled with guilt to see her like that.\n\"I'm really sorry for getting you involved in this,\" I said. \"I know I have no right to ask you to help. After all - it's all my fault in the first place. If I'd driven more carefully in my first life, this wouldn't have happened. If I hadn't made such a stupid blunder, all the people around me would just be able to live happily.\"\nHiiragi raised an index finger. \"Hey, can you tell me one thing?\"\n\"What?\", I asked.\nHiiragi spoke faintly. \"Maybe what we're about to do, might not be a very good thing to do. Maybe we made an awful mistake competing for the ones we treasured most. Maybe it was your blunder that sent people's lives in a worse direction the second time. Maybe there's no going back from everything that's changed in the past decade. ...But still, there's no reason I can't be happy, is there?\"\nI faltered slightly with surprise. \"Err... Um, maybe not, I suppose.\"\n\"I'm glad I could talk to you like this again,\" Hiiragi said, then narrowed her eyes. \"Hey, do you think we should be rejoicing right now? Sure, we've been together all this time, but isn't this the first time we've really recognized each other? Can we call this a reunion in our second lives?\"\nI knew my mouth was loosening. \"You're right, you're right. Okay, well, let's celebrate our reunion.\"\nThis was really the kind of conversation that suited us, I thought.\nHiiragi awkwardly put out her hands. I gently embraced her, but of course, that was just as awkward. \"Oh no, I'm getting nervous,\" Hiiragi laughed in self-derision.\nBut it was our first time embracing or being embraced in ten years. It was to be expected.\n\"...I hope you don't get too mad,\" Hiiragi said, burying her face in my chest. \"In high school, I looked down on you as someone in a similar situation, to keep some stability in my mind. When times were tough, I'd promptly look over at you and think \"I've still got it better than him,\" comforting me. ...That's awful, isn't it?\"\n\"I thought you did,\" I awkwardly smiled. \"Because I did that too.\"\nHiiragi was silent for a while.\n\"In that case,\" she said, looking up, \"I think we can look at it this way. By you looking down upon me, and me looking down upon you, we were able to weather those years. Even when you weren't around, when I was feeling lonely or empty, I imagined you beside me. And if you were doing the same thing... In a sense, even when we lost sight of each other, we always supported each other. I think we can look at it that way. In a very contrary way.\"\n\"...It certainly is contrary,\" I chuckled, nodding.\nI met eyes with her. Perhaps because of the years of bad times that had piled up, we instinctively looked away.\nBut a line like this, I had to say looking her in the eye. Again, I looked firmly at her.\n\"Well, we have less than a minute left until the outage. It's almost time for us to save the people we mistakenly loved - but did indeed love.\"\nHiiragi replied with a decisive \"Right.\"\n\"But, um, can you wait for a second? Before the lights go out and everything goes dark, I want to check one last thing. ...I know I have no right to do this to you, either. Because I went chasing the wrong person from the start, too. But you and I aren't people with much integrity, so never mind who has what right.\"\n\"Check what?\"\nBefore I could finish saying it, she stretched up to kiss me on the cheek.\n\"I'm sorry,\" Hiiragi said. \"That's it.\"\nIndeed, that was all the checking that needed to be done.\nIn just a moment, I actually understood many things.\nI had always been rather focused on superficial things. It was a fault that affected my memory in my second life and even my way of thinking.\nIt led me to ignore feelings that I couldn't put into words. Even the fact that I'd done this was hard for me to express.\nI realized that I didn't remember anything about things I'd wanted to remember forever. I lost sight of what was important and what wasn't.\nI shouldn't have cared about memories from my first life that didn't even feel real. I should have considered them no more than \"one set of possibilities that could happen.\"\n\"So this is how close we were,\" she said, her eyes downcast.\nAlmost the same moment Hiiragi stepped away and turned around to face me, the lights all went out.\nTrue darkness, to which we were utterly indifferent, covered the town.\nJust like that day ten years ago.\n[+]",
      "scraped_at": "2025-11-20T20:35:55.560965",
      "content_scraped_at": "2025-11-20T20:35:56.042137",
      "error": null
    },
    {
      "id": "68",
      "number": "68",
      "title": "Chapter 68: * 68 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/68/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "It really was a ridiculous scene, I'd say.\nTwo Santa Clauses at night, after a power outage, wielding traffic control sticks to indeed control traffic. Not even your friends would believe that one.\nThe colorful strobe lights placed all around, from a certain point of view, looked undeniably like Christmas lights.\nRed, blue, yellow, green. Even though we had no time, we bothered to arrange them in a pretty way.\nI was so caught up in the bizarrely fantastical atmosphere that, when couples stopped their cars for us, I said “Merry Christmas!\" to them countless times.\nI shouldn't have wanted to say it one bit, but the freezing cold and the outfit must have done something to my head.\nIt really was an awful snowstorm, and just keeping our eyes open was difficult. I was unconsciously grinding my back teeth from the cold, and my jaw hurt.\nNearly my whole body was freezing, such that I couldn't even feel how clothed I was.\nPlus, we occasionally had to wipe off snow that covered the strobe lights, so we were moving hither and thither.\nIt certainly wouldn't have been surprising if we got run over. But we managed to survive, perhaps thanks to our distinctive outfits.\nFor one day, I was thankful to Santa Claus. If I were Jack Lantern, I'd have died for sure.\nIt would have been great to be a little warmer, though; it's not as good at protection from the cold as it looks. I was chilled to the core.\nWhile we did our traffic conducting, I was thinking about Hiiragi the whole time.\nAnd I don't mean in our first lives. I naturally recalled all the common points we shared in our second.\nWhen we rode the bus to the international school soccer meet, or an art appreciation event, or whatever, we had no one to sit with, so we always sat in silence in the frontmost seats.\nWe waited together outside the infirmary, waiting for the school nurse who would never come.\nDuring the baseball tournament, I hid in an empty classroom, and she did the same thing, and we both failed to attend the opening ceremony.\nOn the roll sheet for the launching of the culture festival, we were the only two marked as not attending.\nThe day of graduation rehearsal, we met in the music preparation room and formed a relationship of complicity.\nThe day of graduation, we were the only ones who immediately left after our homeroom teacher's long speech.\nEven in college, we were friendless as ever, always sitting in the back corner of the lecture room and looking sour.\nI didn't know if they were good memories or bad, but those memories comforted me the same way music did.\nAnd then - about twelve minutes after the blackout.\nThat blue car slowly drove by, and we saw them off.\nWe saw off the former us.\nFrom beginning to end, they didn't know about any of it.\nTokiwa and Tsugumi didn't know they were my and Hiiragi's doubles, and as long as we never told them, they would never know we saved their lives.\nBut perhaps that's for the best.\nPersonally, I found it thrilling to have saved their lives without them even noticing.\nWith them safe, our objective was completed. But after having come that far, we decided we wanted to see it through to the end.\nSo we continued conducting traffic until the power was back.\n[+]",
      "scraped_at": "2025-11-20T20:35:57.048535",
      "content_scraped_at": "2025-11-20T20:35:57.520725",
      "error": null
    },
    {
      "id": "69",
      "number": "69",
      "title": "Chapter 69: * 69 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/69/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "Once the power came back on, we were cold as corpses, our hair and skin frozen over, and had probably gotten colds or pneumonia or something.\nWe wanted to warm up somewhere, but all the stores were already closed.\nOn top of that, the car tires were stuck in the snow and it wouldn't get going, and I'd left most of my stuff at the department store, so I didn't even know where to start.\nWe decided first of all to turn up the heater all the way and warm up in the car.\nWe had no energy left for even the smallest conversation; we just shivered like idiots.\nJust then, I heard the sound of a bell. The clock struck midnight.\nYes, that moment signified the end of the repeat.\nAhead of us lay a world we knew absolutely nothing about.\nThere was no sign of an impending third loop.\nMy real girlfriend, teeth chattering, very faintly smiled at me. “Sure is cold...\", she said. It must have been quite an effort just to say that.\n\"Yeah, it is,\" I replied, but just as I said it, I felt something warm inside me.\nThinking about it, I hadn't had anyone to share in the cold with those whole ten years.\nI wonder why I felt so happy then all of a sudden?\nOur stand-ins would continue to take our spots, there was no making up all the classes I'd missed, my parents were going to get divorced any moment now, my sister was depressed, my best friend was going to kill himself, and right now I was about to freeze to death - but I was happy.\nWhatever happened from here on out, I felt like I could handle it.\nI felt that together with Hiiragi, we could make it well enough through anything.\nIt was a groundless belief, but beliefs don't always need ground to be powerful.\nMaybe I was just thrown off by the chaos of the day, but I supposed I might have been happier then than I was on my first twentieth Christmas.\nAnd that is a very, very impressive accomplishment.\nIt was a happy Christmas ten years in the making.\nWith hands still trembling, I took Hiiragi's. \"Hey, Hiiragi,\" I said. I hadn't quite gotten my thoughts in order, but I had to say something.\n\"We've lost a lot in these ten years. Maybe we've gained some things along the way, but compared to what we lost, it seems like next to nothing. I can't approve of these ten years, not at all. I feel we've lived ten almost entirely pointless years.\"\nHiiragi stared intently at her hand.\n\"But,\" I said, \"when I see you, I feel I can do it again from the start. There's no need to rewind time or anything. I just realized it, just now. Something outrageous. I think I've fallen in love with you again. And not even because you were my girlfriend in my first life. I've just fallen in love with the girl before my eyes. ...So what do we call our lost ten years? What a barren decade. Hiiragi, I'm going to do everything I can in hopes you'll love me again. It'll be like when we first met.\"\n\"...That might be kind of hard,\" Hiiragi smiled. \"Because I love you too much already.\"\nWell, I'll be. She knew exactly what I wanted to hear.\nI brought my face close and kissed Hiiragi.\nIt was awkward like always, but it made me so happy.\nIt was just like starting over.\n[+]",
      "scraped_at": "2025-11-20T20:35:58.533990",
      "content_scraped_at": "2025-11-20T20:35:59.022834",
      "error": null
    },
    {
      "id": "70",
      "number": "70",
      "title": "Chapter 70: * 70 *",
      "url": "https://lightnovelpub.org/novel/starting-over/chapter/70/",
      "original_time": "1 month ago",
      "novel_slug": "starting-over",
      "content": "I arrived home at dawn, not sleepy at all. In fact, I felt reborn.\nMy body felt lighter than usual, and looking in the mirror, I noticed my face had changed overnight.\nThe preparations for my rebirth had long been in order. But had it not been today, I probably wouldn't have been able to notice.\nIn the middle of the room, I shook a present my girlfriend had given me, and I heard mumbling from my bed.\nI looked and saw my sister starting to get herself up. It seemed she'd run away from home again.\nI quietly placed a paper bag near the pillow, careful that she didn't notice.\nShe drowsily looked at me and said, \"Big brother?\", then buried her face in the pillow again.\nBut just afterward, she noticed the present by the pillow and went “Ooh...\" with a slight delay, and not seeming entirely there. Then she sat up.\nShe took the present out of the bag, carefully tore the wrapping, and opened the case to find a harmonica.\nShe put it to her mouth and lightly blew. She pulled it away and went \"Ooh...\" again.\nMy sleepy sister felt like she temporarily lost her thorns, and a few traces of her first self showed through.\nI sat down on the bed and said to her “Hey.\"\nShe had waited here for me. That wasn't just chance.\nSo there was one thing I had to say.\n\"Your brother came back from ten years in the future.\"\nStill sleepy, she - naturally - laughed “Welcome back!\"\nI'd always kinda liked that response and said “It's good to be back,\" patting her head.\nShe looked at me disapprovingly, but inside, I figure she appreciated it, given her lack of resistance.\n\"Your brother came back from ten years in the future,\" I said. \"And so he got another shot at his life from age ten to twenty. ...When that second life started, I knew the mistakes I was going to make, and I knew what I should really have done. Starting right then, I could have been a prodigy, or gotten super rich, or been a prophet, or a messiah. It might have even been possible to be happier than I was in my first life. But I didn't want to change a thing. It would've been fine by me if I could just live the same life as before.\"\nMy sister looked at me, blinking.\n\"However, I messed up in reliving my first life. Even though I knew what was going to happen, it was impossible to live my life all as I remembered it - and I only realized that when it was much too late. Before I knew it, my second self was miserable compared to the first time, and it didn't end there. Most of the people I was close to in my first life lived good-for-nothing lives the second time. It was a chain of negativity. I've come to see in these ten years how my carelessness made a mess of everything. I feel like a plague upon the earth.\n\"...But because of that, now I know. I know that we should have been better off. And I know that the most subtle differences can change people. You can't know where people are going to end up - but that's why there's no reason we can't be happy someday. We can stop thinking that, because things have always been this way in the past, it means anything for our future.\"\nI closed my eyes, opened them again, and said,\n\"And so I want to start it all over again. I think it's time we start fighting back.\"\n“I don't get it,\" my sister of course replied.\n\"I think you will,\" I said.\n* Afterword *\nI recognize that this is an unbelievably inappropriate start to the afterword of my first book, but when I was a child, I really didn't care much for novels.\nThat alone is nothing to write home about, but even as an adult, I haven't found that's changed much.\nI don't mean to imply the very medium of the novel lacks any charm. When it comes to the creation of stories, I sense the most potential in novels, rather than movies or comics.\nBut most of the novels going around the world simply don't measure up to my artistic standards - no, just kidding, it's not that either.\nThere are countless writers whom I know I could never hope to live up to in my entire lifetime.\n\"So then why do you not like novels?\" Actually, I wrote these sentences so as to make you ask me that question yourself.\nWell, if you the reader fell for my scheme and have that question for me, I suppose I could answer it like this.\n\"There was someone who wrote about what I wanted. But they didn't write it in the way I wanted. There was someone who wrote in the way I wanted. But they didn't write about what I wanted.\"\nI believe that I'm in the wrong. Honestly speaking, it's that my tastes have been warped. Perhaps in my infancy.\nAnyhow, my reason is that, while I won't outright say there are hardly any books in this world that \"stick\" for me, it's a situation remarkably identical to it.\nSo that's why I came to think: \"Rather than dig through a sea of books where only one out of every hundred is a warped one that I like, it would be a lot faster to just write my own.\"\nAfter finishing my first book and looking back on it, I'm honestly suspect whether the story I wrote is a warped one that satisfies me or not. But given the time I put into it, I believe I did all that I could.\nI would appreciate if you took notice of any trace of that effort. And meanwhile, if you simply enjoyed the story without thinking anything, well.\nI think there could be no greater honor for an author.\n- Sugaru Miaki",
      "scraped_at": "2025-11-20T20:36:00.036429",
      "content_scraped_at": "2025-11-20T20:36:00.529509",
      "error": null
    }
  ]
}