{
  "metadata": {
    "scraped_at": "2025-11-22T15:37:30.324798",
    "total_chapters": 17,
    "novel_slug": "who-killed-the-hero",
    "novel_title": "Who Killed The Hero?",
    "first_scraped": "2025-11-22T15:37:00.054696",
    "last_updated": "2025-11-22T15:37:30.324798",
    "is_complete": true
  },
  "novel_info": {
    "id": "who-killed-the-hero",
    "slug": "who-killed-the-hero",
    "title": "Who Killed The Hero?",
    "cover_url": "https://lightnovelpub.org/media/covers/batch_2/novel_2074.jpg",
    "rating": 4.0,
    "chapters_count": 17,
    "rank": 485,
    "url": "https://lightnovelpub.org/novel/who-killed-the-hero/",
    "first_scraped": "2025-11-22T15:37:00.054696",
    "last_updated": "2025-11-22T15:37:02.781505",
    "scraped_at": "2025-11-22T15:37:02.781505",
    "author": "Daken",
    "status": "Completed",
    "genres": [
      "ACTION",
      "DRAMA",
      "FANTASY",
      "SLICE OF LIFE",
      "SUPERNATURAL",
      "TRAGEDY"
    ],
    "summary": "Eight years later, the boy became a hero and defeated the Demon King. However, at the same time, he became a person who would never return.Why did the hero die?Four years after his death, as his achievements were being compiled into literature, the truth behind his death was about to be revealed.",
    "stats": {
      "chapters": "17",
      "views": "247",
      "bookmarked": "4"
    }
  },
  "chapters": [
    {
      "id": "1",
      "number": "1",
      "title": "Chapter 1: Prologue",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/1/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "In this kingdom, the royal lineage was matrilineal.\nOriginally, it seemed to have been a lineage of priestesses serving the gods. They had preserved their lineage by marrying powerful men of their time and making them kings. The husbands could come from noble families within the country or royal families from other nations, but in most cases, they were required to have a noble lineage.\nThere was only one exception.\nThat was the hero.\nPeriodically, a demon king would appear, seeking to destroy the human world. The hero was the one to defeat the demon king. In this kingdom, they promised the position of king as a reward for the hero. By welcoming the hero, the royal family maintained their legitimacy and boasted their status as a kingdom that had saved the world.\nIn this way, the royal family had endured.\nAnd 15 years ago, a demon king appeared in this world. A king who ruled a powerful race called the demonfolk, hostile to the gods revered by humans and sought to destroy their human followers.\nAs a result of fierce battles, half of the world had already been conquered, and this kingdom was also suffering from invasion.\nIt was then that the hero appeared.\nIt was often unknown who would become the hero beforehand, but they were usually guided by a person called the prophet. The prophet would appear from nowhere, leave a prophecy, and then disappear. Their true identity was unknown.Four years ago, the prophet appeared in a small village within the country, foretelling the emergence of a hero.\nThe prophesied hero enrolled in Falm Academy, the kingdom’s hero training institution, and made a name for himself. He invited the renowned swordsman Leon, the holy woman Maria, and the sage Solon as his party members, and now they were being summoned to the royal palace.\nI am the kingdom’s princess, Alexia, and I am to be the hero’s reward.\nMy father seems to have some dissatisfaction with the hero.\nHe says things like, “He is of low status,” “He’s a mediocre man,” and “I wanted Leon to be the hero.”\nMy mother, the queen, has entered the temple as a priestess after my grandmother’s death and is not here. The princesses of this kingdom choose their husbands as kings, have children, and then enter the temple as priestesses, devoting their lives to the country.\nSwordsman Leon was the next heir of a powerful count’s family, with both talent and nobility. If the demon king hadn’t appeared, he would have likely become my companion.\nWhen I met him before, he was aware of that fact, but after the battle in Rozorov Forest, he said, “I wasn’t the hero,” and withdrew himself. Those around, including the king, were disappointed by his decision.\nAs for me, it didn’t matter. Indeed, Leon was a fine person. However, in the end, my marriage would not involve my own will. So it doesn’t matter who the hero is.\nI have devoted myself to academics, swordsmanship, and horsemanship since I was a child, and I have been evaluated for my talents. Still, I cannot even decide my own future. Being a princess in this kingdom is like a curse. After all, there has never been a prince born. If only I could have been born a prince, I might have had a slightly better life.\nRegardless of my thoughts, the audience began, and the hero entered the throne room.\nMy father, the king, praised the hero’s achievements in the Rozorov Forest, bestowed a reward, and officially recognized him as the hero.\nIt was the birth of Hero Ares.\nI was introduced to him as the reward.\n“Upon defeating the demon king, you shall become Alexia’s husband and the next king of this country.”\nThere was a slight stir in the room. Although it was customary, some nobles disapproved of elevating someone of low status to become the king.\nBut even the hero was risking his life. Otherwise, who would willingly invade the demon king’s territory and attempt such a reckless adventure to defeat him? The term “hero” was merely a euphemism for an assassin targeting the demon king.\nIn order to increase the success rate of the assassination, the hero’s reward must be something that will motivate them as much as possible.\nI too would be in trouble if the world perished.\nI must do my best to encourage this hero.\nI think I understand how I should behave for that purpose.\nI walked over to the kneeling hero and said,\n“Hero, please defeat the demon king and save the world. I will be waiting for your return.”\nI may still be a 12-year-old child, but I am beautiful, and I think I understand how to act to please someone. However, while I truly want the hero to save the world, my claim of waiting for his return is a lie.\nThe hero was an ordinary-looking young man with chestnut-coloured hair that bounced a little and matching brown eyes. He seemed to be well-trained but was of average height and build with no distinguishing features.\nHe looked troubled and said in a voice only I could hear,\n“Princess, I promise. I will definitely defeat the demon king.”\nHe smiled gently.\n“But I won’t return here. So, please marry someone you love.”\nFour years later, just as the hero had said, he defeated the demon king and never returned.\nAnother four years passed. The kingdom, which had finally regained its stability, launched a project to compile the hero’s achievements into a document in honour of the fallen hero.",
      "scraped_at": "2025-11-22T15:37:03.239649",
      "content_scraped_at": "2025-11-22T15:37:03.910322",
      "error": null
    },
    {
      "id": "2",
      "number": "2",
      "title": "Chapter 1",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/2/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“He was a friend,” was his succinct answer when asked about his relationship with the hero, Ares. His well-toned body was evident even through his clothes, his cropped blonde hair and neatly trimmed beard framing his handsome face. His overwhelming gaze indicated that he was no ordinary man.\nFriend—his relationship with Ares must have been more complicated than that. They had known each other since their academy days and were members of the same party, having survived countless near-death experiences together.\nLeon Müller, also known as the Sword Saint Leon, was once the leading candidate for the role of hero. “There’s no special meaning to it,” he said. “Before I met him, I never had anyone I could call a friend. I was born into a relatively high-ranking noble family. When you’re born into a noble family, relationships are either above or below you. You either respect or are respected, judging people you meet accordingly. Isn’t it terrible? That’s what being a noble is like.” He flashed a mischievous grin. The current Leon exhibited none of the airs typical of a noble. In fact, he was known for being fair and impartial, regardless of one’s social standing. Indeed, his casual manner of speaking to me made me feel no sense of the difference in our status.\n“So, how was it when you met Ares?”\n“I was a noble back then. Well, I’m still a noble, but I was living the life of one. I was also a candidate for hero. I had the pride that no one could surpass me in wielding a sword, and I was certain I was destined to become the hero. Everyone around me thought the same. So, I…” Leon’s eyes grew somber. “I hated him. A commoner who had the audacity to walk into the prestigious Falm Academy, reserved only for nobles, with his unimpressive appearance. I didn’t even want him in my line of sight.”\nThe Falm Academy, which still exists today, is renowned as an institution for nurturing heroes. However, it is not exclusively for nobles. Rather, it is open to anyone with the requisite skill. “Things were different back then,” Leon explained. “The original ideals of the academy had been lost, and it had become an institution where nobles sought to add prestige to their own offspring. Of course, anyone could enter if they had the money, so officially, there was no requirement for a certain social status. However, hardly anyone crazy enough to want to attend would have bothered. There were plenty of other ways to become strong: enrolling in private schools, becoming the disciple of a famous swordsman, or gaining experience as an adventurer.”\n“So why did Ares choose to attend Falm Academy?”\n“Simple. He wanted to become a hero. There were many ways to become a strong warrior, but only Falm Academy could recognize someone as a hero. Well, looking back, it wasn’t really necessary to attend the academy to become a hero, but at the time, people believed it, and so did he.”\n“What was your first meeting with Ares like?”\n“I wish I could say I’ve forgotten, but I still see it in my dreams. I glanced at him and dismissively said, ‘You’re not qualified to be a hero.'” What did Ares say in response? “‘Even so, I must become one,’ he replied. I hadn’t expected a commoner to talk back to me, so I was furious. I thought about cutting him down right then and there, but a teacher stopped me. They didn’t want any incidents involving weapons within the academy. While the teachers also seemed to view Ares as an out-of-place individual, they must have thought killing him would be going too far.”“What kind of student was Ares?”\n“He was mediocre. He had been an adventurer for a short while before entering the academy, so his combat skills were decent. However, his sword technique was self-taught, so he had to start from scratch. We had a few matches before graduation, but I never lost to him.”\n“But isn’t it widely believed that Hero Ares had excellent grades since his academy days?”\n“That’s a fabrication. After he defeated the Demon Lord, people from his academy days changed their tune and began singing his praises. They claimed he ‘had the radiance of a hero even as a student.’ But he didn’t shine at all. He was, however, abnormal.”\n“Abnormal?”\n“In mock battles during class, he would fight until he won or was genuinely defeated. He didn’t give up over minor injuries. He even faced teachers with full force. If he didn’t understand something taught in class, he would ask teachers or classmates until he grasped it. He practiced sword forms late into the night.”\n“Wouldn’t that just make him a dedicated student?”\nAs a hero’s anecdote, it seems rather weak. “It went beyond dedication. Ares seemed to have no concept of rest. He didn’t have a single moment of free time. He spent all his time on ‘becoming a hero.’ He wasn’t really sleeping; he just collapsed when he reached his limit. At first, some people picked on him because he was a commoner, but they soon stopped associating with him. His obsession was apparent to everyone as being beyond the norm.”\n“Even with all that effort, was he still just an average student?”\n“No, he did grow in his own way. To put it simply, it was more like ‘if you go that far, you’ll see some results.’ Effort alone can’t surpass talent; that’s an undeniable fact. In the end, he never surpassed me in swordsmanship, nor did he become the best in other fields. Of course, his grades weren’t bad, but anyone could achieve that level of performance if they put in that much effort… Well, not many people could actually put in that much effort, though.” Indeed, Ares wasn’t the top student at graduation. That honor went to Leon.\n“I was able to become the top student because I had the support of my family’s status as earls. If there had been royalty in the same class, they would have been the top student. Of course, I did have excellent grades,” Leon said with a grin. It was a cheeky smile, but one that made him likable.\n“By the way, when did you and Ares become friends?”\n“It was during an outdoor training exercise at the end of our third year. As a culmination of everything we’d learned in three years, we went on an expedition to the Rozoroff Great Forest to fight monsters.” The Rozoroff Great Forest is still known as a treacherous place where monsters roam. At the Falm Academy, this outdoor training exercise is still carried out as a traditional event.\n“Even though it’s called a dangerous place, the strength of the monsters varies depending on the location. The forest is so vast that several countries occupy parts of it. Students go to areas where relatively weak monsters appear. Experienced adventurers accompany them as teachers, along with knights for protection. There should have been little danger… but one of the demons targeted the exercise.” This story is famous and has become part of the Hero’s tales. The members who later formed the Hero’s party defeated the attacking demon.\n“It wasn’t as glamorous as it seems in the Hero’s tale. Most of the teachers and knights were killed, and of course, some students were sacrificed as well. It was a disgrace to the kingdom. To cover it up, the surviving students were hailed as heroes.” Indeed, the large number of casualties emphasized the demon’s strength, and consequently, the bravery of the students who defeated it, despite being mere students.\n“Later, we realized that the demon we faced wasn’t particularly strong among its kind; it was just cunning. It probably aimed to gain fame with little risk by killing students who might become heroes. The teachers and knights might have fared better if they hadn’t been forced to protect us.” Even if weak, a demon is one of the most powerful species among monsters.\n“How did the students manage to defeat it?”\n“It’s simple. We were capable of winning from the start. Even as students, Maria, Solon, and I had exceptional power. However, we lacked real combat experience. We could defeat weak monsters, but we didn’t know how to work together to defeat stronger ones. I charged in alone and was easily defeated. Solon was confused when his magic proved ineffective. Maria was dumbfounded by the sight of bodies she couldn’t heal.”\nMaria the Saint and Solon the Sage are well-known members of the Hero’s party. But at that time, they hadn’t yet unleashed their full potential. ”\nSo, what was Ares doing?”\n“As soon as he saw the demon, he told everyone to run. He ordered us to scatter and flee without grouping up. I thought he was a coward for telling us to run without even fighting. But those who listened to him survived, while those who tried to fight died.”\n“What about Ares himself?”\n“He hindered the demon’s pursuit of the fleeing students. Instead of directly confronting the demon, he maintained distance and restrained its movements. He likely wanted to save as many people as possible. That’s why, when I was defeated by the demon , he intervened. If he hadn’t come, I would have died.”\n“Did Ares try to make you escape as well?”\n“No, he told me, ‘Get up! And fight!’ Can you believe it? Telling me to fight right after I lost to the demon? I thought there was no way I could win.”\nBut you fought. “For the first time in my life, I was beaten so badly that my pride was shattered, but still, a commoner was fighting alone. As a noble from an earl’s family, I couldn’t just run away. And he said to me, ‘Weren’t you going to become a hero?’ So, I mustered up the last bit of courage I had and stood up. In hindsight, that was the first time I ever showed true courage. Until that moment, I had never faced any difficulties in my life. That’s why, when I faced the terrifying demon, I was quickly discouraged and resigned myself to death.”\n“How did you fight an opponent you couldn’t defeat? ”\n“I fought the same way he did. Instead of facing the demon head-on, I kept my distance, looked for openings, and attacked. I once mocked it as the fighting style of the weak, unworthy of a knight. But trying it made me realize it was effective against stronger opponents. We should have used that tactic against the powerful monsters from the beginning. Ares and I attacked whenever we saw an opportunity. Following Ares’ instructions, Solon began using magic for diversion. Maria focused on healing us as we fought. And, eventually, we won.”\n“Was it the first time the hero’s party functioned effectively in a battle?” “It might sound simple, but that’s true. While we were fighting, we didn’t think we could win. We couldn’t even tell if our attacks were effective. But, because he fought without any hesitation, we were able to fight as well. He was knocked down time and time again, but he always got back up and faced the enemy. I later realized that he must have been anticipating this kind of battle since the mock battles in our lessons. That’s why he never gave up easily in those mock battles and kept trying until he could win. He had learned many things in the classes we all took for granted. How to fight against a strong opponent, how to manoeuvre… that difference became apparent during the field exercise.”\n“Did you think of him as a friend because he saved your life?”\n“It could be, or it might not be.”\nLeon gazed into the void. “At that time, I thought, ‘Ah, so this guy was the hero.’ It’s not sour grapes1He means he is not feeling inferior to Ares and is being objective in saying what follows , but after regaining our footing, I was the one who dealt the most damage to the demon. In terms of ability, I was indeed stronger than him. But it wasn’t about that. A hero needs strength, but that’s not all. Social status didn’t matter at all. It’s about the very essence of being a hero. I wasn’t a hero. And for the first time, I acknowledged someone else as an equal, regardless of their social standing.”\n“Why did the hero die?”\n“That must have been the fate of the man called Ares. That’s all there is to it.”\n1He means he is not feeling inferior to Ares and is being objective in saying what follows",
      "scraped_at": "2025-11-22T15:37:04.923846",
      "content_scraped_at": "2025-11-22T15:37:05.555006",
      "error": null
    },
    {
      "id": "3",
      "number": "3",
      "title": "Chapter 2",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/3/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "Shortly after entering the academy, I was approached in class. “You don’t have what it takes to be a hero,” said a blond, well-dressed, and well-built young man with striking blue eyes and handsome features.\nWhen I responded that I still had to become a hero, he became angry and reached for his sword at his waist. The teacher intervened quickly and the situation was diffused, but from then on, he became my enemy.\nI soon found out that his name was Leon Müller. He stood out in our class and had a reputation among the teachers due to being the son of a count. He also had considerable talent with the sword.\nHe was blessed with good blood, physique, and talent, and he did not neglect his training. He trained outside of class and showed no signs of arrogance or complacency with his talent. Of course, he was the top candidate for becoming a hero.\nI thought that he might become the hero instead of me, and I even hoped that he would. I didn’t want to burden him with the title of hero. However, until he became a hero, I couldn’t give up.\nI decided to focus on my training more than he did. I trained twice as hard as he did outside of class because I had no one to socialize with. Our warrior class instructors were mostly former knights who had retired due to age or injury, but they were still skilled.\nThey had a bias towards our noble classmates, so they did not directly teach me often, but what they taught in class was very helpful. There were few teachers who had a favourable impression of me, but when I asked a question, they would answer it properly.\nWith that in mind, I practised swordsmanship in the corners of the academy where no one could see me. I also checked my form by practising in front of mirrors or glass if possible. Through my classes, I learned that my swordsmanship was full of unnecessary movements.\nI realized that I had not learned proper swordsmanship, and I was taught the many extra movements I made. In contrast, Leon’s swordsmanship was ideal. His sword was beautiful, and he wasted no movements.\nI practised my swordsmanship based on his form and challenged him as much as possible in class simulations. Every time I did so, I was defeated by Leon and ridiculed by him. “You should hurry up and leave the academy,” he said.However, strangely enough, Leon seemed to dislike it when other students made fun of me. Once, when I carelessly left my sword in the classroom, some classmates took it and tried to make it their own. “That sword is too good for a commoner like you.\nI’ll use it instead,” said the classmate, and the other classmates laughed and agreed. “That sword is important to me. Can I have it back?” I couldn’t give up that sword no matter what they offered me. I confronted the classmate, determined to take it back no matter what.\n“What? How dare you talk back, you commoner!” They were a little intimidated by my strong will, but they surrounded me with their larger numbers. “Hey,” then Leon spoke up. “You there, what did you learn about a warrior’s sword?” Leon questioned the classmate who had taken my sword.\n“Uh…well, a warrior’s sword is their life,” the questioned man stammered. “I see. So is your life also stolen goods?” The man was surprised and stumbled to answer, “No, that’s not it. I was just fooling around…” “Are you going to be a warrior who jokes about life?”\nThe man who had been questioned silently returned my sword. After confirming that, Leon left, but I chased after him to express my gratitude. “Thank you, you really saved me there.” To that, Leon was harsh.\n“Didn’t I tell you that the sword is the life of a warrior? It’s a disgrace for a warrior to let someone take it from them. It’s foolish to steal someone else’s sword, but it’s even more foolish to forget where you put it!” He was absolutely right.\nAfter that incident, I kept my sword with me at all times. At the end of the summer of our third year, Leon approached me while I was practising with my sword behind the school building as usual. He rarely talked to me, and he didn’t have his usual entourage with him.\n“You’ve become quite good at wielding a sword,” he said. Since he never used flattery or sarcasm, he must be giving me a compliment. I stopped swinging my sword and turned to face Leon. “I’ve been using your swordsmanship as a model.”\n“I see. I’m not bad at it, but aside from me, your form is the best. Of course, the other guys in our class haven’t been training seriously, so that’s part of it.” It was a pleasant thing to hear. When I entered the knight class, I was the worst swordsman in the class, but now I was second only to Leon.\nHowever, it was also true that none of my classmates, except for Leon and me, were taking the class seriously. They seemed to be afraid of going to the Demon King’s territory and were just trying to get by. Leon was probably frustrated by that. “Thank you. My efforts have paid off.” “Is that so? You’ll need to work even harder from now on.”\n“I don’t think the results match the effort you put in. If you swing your sword thousands of times a day and this is the level you’ve reached, it means you don’t have any talent,” Leon’s criticism was accurate.\nAfter swinging the sword day and night for over two years, if this was the level of skill, then my talent was very limited. “Even so, it’s fine. I have to become a hero, so I have to improve my sword skills even if it’s just a little bit,” I replied.\n“Why do you aspire to become a hero so much?” Leon asked with a serious expression. “A prophet appeared in my village and prophesied the emergence of a hero. If I don’t do it, no one else will,” I answered.\n“Do you really think you’re a hero?”\n“I don’t know. I don’t think I’m very suited for it. To tell you the truth, I think you’re more suited to be a hero,” I said.\n“What?” Leon looked genuinely bewildered. “Then why did you insist on becoming a hero? You should have left it to me. You wouldn’t have had to go through such rigorous training every day,” he said.\n“No, that’s not right.”\n“What’s wrong?”\n“Being a hero is not something you just become. Everyone expects you to do it, and you’re unilaterally burdened with the responsibility of defeating the Demon King, risking your life. And if you fail, the world will end. There’s nothing more unfair than this. It’s not worth it,” I explained.\n“…………” Leon hesitated for a moment before speaking. “Yesterday, my father told me to give up on becoming a hero,” he said.\n“Why?”\nLeon’s father must have expected him to become a hero. “The situation in the war seems to be pretty bad. It seems impossible for a hero to invade the Demon King’s territory. Even a hero can’t defeat the Demon King,” he said.\nI see, if the situation is bad, then they can’t even support a hero who enters the Demon King’s territory. Without support, it’s like jumping into a death trap. “I’m worried about you,” he said. “I know that!” Leon shouted.\n“But, I’ve been striving to become a hero since I was a child! Becoming a hero and saving the world was my dream! I don’t care about my life anymore! But…”\nHis father, who was a count, must have given him an absolute order. It was also because he was concerned about Leon’s safety. Leon couldn’t go against his father’s order. “I’ll become a hero, so it’s okay,” I began swinging my sword again.\n“I’m sure I’ll defeat the Demon King. So, it’s okay.” “Are you saying that you’re stronger than me, commoner?” Leon grimaced. “Why can you say that? You’re just an ordinary person! You have no power! You can’t defeat the Demon King!”\nHe denounced me as if he was venting his hatred. “I’ll keep trying until I can defeat him. If I fail once, I’ll try again. If I fail twice, I’ll aim for the third time. It’s as simple as that.” I wasn’t that optimistic. I didn’t think it would go so smoothly on the first try.\n“What are you talking about? If you fail once, that’s the end. There’s no second chance.” “But we have no choice but to keep trying. The important thing is not to give up and to stay calm. If you give up and waste your life in despair, it’s over.\nNo matter what, I will see it through to the end. That’s why I learned both offensive and recovery magic.” “……….” After staring at my face for a while, Leon said, “Hmph, what can a commoner like you do? I’m the one who will defeat the Demon King.\nI can’t just leave the fate of the world to a commoner. It would be beneath me to entrust the fate of the world to a commoner. No matter what anyone says, I’m going to the Demon King’s territory. Definitely.”\nLeon, who was about to leave, turned back as if he had thought better of it. “Promise me one thing. If I become the hero, you’ll join my party.” It was an unexpected statement.\n“What If I become the hero?” “It’s something that’s unlikely to happen. But…” Leon showed a smirk. “I’ll join your party when it happens.”",
      "scraped_at": "2025-11-22T15:37:06.570985",
      "content_scraped_at": "2025-11-22T15:37:07.271820",
      "error": null
    },
    {
      "id": "4",
      "number": "4",
      "title": "Chapter 3",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/4/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“He was a hero to me too,” she answered with a warm smile when asked about her relationship with the hero. Maria Lauren was a priest who served as the recovery role in the hero’s party. She is currently a bishop and in charge of the operation of the church. She is called Saint Maria because she promoted reforms that allowed commoners to receive the miracles of the gods, mainly used only by the nobles, such as recovery magic.\n“My relationship with him began when we were in the academy. One day, he approached me suddenly and asked me to teach him recovery magic. At first, I thought he was trying to pick me up. It was always like that whenever a man approached me,” Maria said with a mischievous smile. She has long black hair like silk, porcelain-white skin, and intelligent eyes. In the hero’s legend, her beauty was also praised, and it was still shining, becoming even more refined.\n“But when I heard him out, I realized he was serious. He thought that the hero was a warrior who could use both attack magic and recovery magic.”\nOriginally, the hero was supposed to be a warrior who could use both attack and recovery magic, and it still is, but was it such a strange idea?\n“It was strange indeed. Rather, having an innate talent for both attack and recovery magic was necessary. At that time, it was considered impossible to become a warrior who excelled in both, and even if one had both, becoming a successful warrior was impossible.”\nBut since he was the hero who defeated the demon king, isn’t he the one who makes the impossible possible?\n“Well, that’s true,” she agreed.\n“But for more than 200 years had passed, no one like that had appeared. At the academy, they also tried to train warriors who could use both attack and recovery magic at first, but they quickly abandoned it because it was so inefficient. Attack and recovery magic are incompatible because the concept of magic is taking advantage of the world’s reason or mana, and we priests interpret the world’s reason as God’s grace and use its power as a proxy. Our fundamental ways of thinking are different, making it difficult to reconcile them.”\nThe difference in the way that attack magic used by wizards and recovery magic, which is the miracle of the gods, was still a topic of debate. While some could reconcile both, it had the disadvantage that both remained at a low level.\n“In addition, training as a warrior and training as a priest are different. At the academy, classes were divided by career goals to specialize and optimize efficiency.”“So, did you teach Ares recovery magic?”\n“I was interested. I wondered if someone without talent could receive God’s grace.”\nMaria was a woman full of love, but her story was provocative. What exactly was the talent required to become a priest?\n“It’s about whether you can sense the existence of God, regardless of how devout you are,” she firmly denied the relationship between faith and talent.\n“While feeling the presence of God can deepen one’s faith, it is not true that faith deepens one’s ability to sense God’s presence. I’ve seen many people who are more devout than I am, but they don’t feel God’s presence. That’s just talent.”\nIt is a well-known fact that innate talent – divine grace – is necessary for priests, but it is rare for a bishop to deny the connection between talent and faith.\n“It’s not like it’s a taboo or anything. There are plenty of people who refuse to acknowledge it. Now then, let’s get back on track. He had neither talent nor faith and was someone who thought, ‘If God really exists, then why do demons exist?’ It’s a blunt statement, but there are many who think that way among those who actually fight demons like warriors.” The relationship between God and demons has often been the subject of debate, but the priests have consistently avoided a clear answer, saying\n“It is God’s deep plan.”\n“Anyway, I was curious. Can someone without talent or faith learn recovery magic? So, that’s why I started teaching him recovery magic.” Can anyone learn recovery magic so easily?\n“No, it’s not easy, especially for someone without talent. It was quite difficult to teach someone who had never felt the presence of God to ‘perceive the existence of God.’ It’s like teaching a dog to speak.” But it was supposed to work out well. In the hero’s tale, the hero is said to be able to use God’s miracles.\n“Well, it worked out – or did it? He seemed to gradually feel the presence of God after I taught him. And after spending over two years on it, he finally learned the basics of recovery magic.”\nIn the end, he learned it, so isn’t that a success?\n“If you’re aiming to be a priest, you can learn it in as little as a month. In fact, if you have talent, you can do it unconsciously. However, in his case, there was no progress for two years. I couldn’t understand why he could continue to make an effort.” Even though there was no progress, couldn’t it be said that he became a hero because he aimed to learn recovery magic?\n“Is that so? At first, I thought the same thing – ‘Ah, it’s true that people without talent can’t perform God’s miracles.’ But he continued to practice recovery magic without any sign of learning for two years. If it were an ordinary person, they would have given up if they didn’t see any results for three months. Perhaps with something like talent or faith as a foundation, they could have continued, but he had neither.”\nWhy couldn’t you understand why Ares was practicing recovery magic?\n“There is a legend that says that the ancient hero could use recovery magic, but we don’t know if that is true. Also, for over ten years until now, the roles of the party have been clearly defined. As long as the warrior role functions as the vanguard, there is no need to use recovery magic. It can be said to be common sense. Therefore, not only me but everyone at the academy felt strange that he was practicing recovery magic.”\nNow that you mention it, it’s true that the vanguard warrior doesn’t necessarily need to use recovery magic. It would be convenient if they could, but if the party functions properly, there is little need for it.\n“That’s right. However, I only taught him about the existence of God and did not watch him practice closely. I gave him advice a few times, such as ‘you have no talent,’ but in the end, I couldn’t stop him.” However, did Ares manage to learn recovery magic?\n“Even without talent or faith, it was proven that one could learn to use healing magic. However, I thought it was not very significant because he had only learned basic healing magic, which could only heal small wounds and bruises. Even among us priests, it was common sense that we didn’t need to heal the damage that wasn’t necessary during battle. If we took care of every small wound, there would be no end to it. However, he understood the importance of healing even small wounds.\nIgnoring even small injuries can slow down movement. Moreover, any injury, big or small, can hinder movement. If you want to move with all your might, you need to heal all your wounds. I healed his major damage, but he healed his minor injuries himself. The tenacity of the hero’s fighting style is based on basic healing magic.”\nThe hero’s legend praises Ares’ perseverance in facing any adversity without succumbing. Was the secret to this in basic healing magic?\n“Yes, that’s right. He knew the importance of building up such small things. Even if despairingly powerful demons appeared, he defeated them by accumulating small wounds, and even if impossible difficulties arose, he overcame them by accumulating diligent effort. It may sound simple, but it took a lot of time. We fought for three days and nights and defeated the enemy, but then we all collapsed and slept right there. If we were attacked then, we would have been wiped out.”\nMaria smiled nostalgically as she remembered that time. But if they did nothing but that, the journey would become quite long. The hero’s journey shouldn’t have been that long.\n“Well, if we had left everything to him, the journey would have taken an unbelievably long time, but Leon, Solon, and I were all excellent ,so we could solve most things in no time. That’s when we said to him, ‘If we leave it to you, the Demon King will die of old age.’ We were probably twisted people trying to look down on him like that. But he just laughed and scratched his head and said, ‘Thanks, I appreciate it.’ We were the ones who looked foolish.”\nYou seem to be having fun answering, but did you like Ares?\n“I have answered that question many times before, and I always answer the same thing. I don’t like Ares, it’s true.”\nThere was no lie in her expression as she answered.\n“It is intrusive to ask, but it is rumoured that you cannot forget Ares and have remained single.”\n“I just missed my chance to get married. If I had a little more courage, I might have been married long ago. They call me a saint, but the real me is a very timid person.”\n“Why did the hero die?”\n“It’s sad, but it must have been God’s will. Ares’ role as a human was simply that.”",
      "scraped_at": "2025-11-22T15:37:08.289044",
      "content_scraped_at": "2025-11-22T15:37:08.913278",
      "error": null
    },
    {
      "id": "5",
      "number": "5",
      "title": "Chapter 4",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/5/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "At the academy, students were classified into classes based on the profession they aimed for: warrior, priest, or mage. However, they were only able to learn their specialized fields, which was a complete miscalculation. The school was known as the “Hero-Producing School,” so I thought even in the warrior class, they could learn a certain amount of attack magic and healing magic. However, due to the inefficiency of teaching both melee combat and magic at the same time, and above all, the innate talent required for magic, it was completely specialized.\nBut that didn’t mean I could give up. A hero must be able to use both attack magic and healing magic, and above all, I myself felt the need for it.\n“Can you teach me healing magic?” I spoke to a famous person in the priest class named Maria Loren. She was a beautiful woman with long, beautiful black hair and transparent, white skin. She was probably the most beautiful woman I had ever met among the people I had met so far. Of course, I didn’t speak to her just because she was beautiful. Among the other people in the priest class who were struggling to take classes, she was the only one who remained calm, so I thought she might teach me healing magic. Also, she was highly regarded as a saint and was known as a compassionate person.\n“I don’t think warriors need to use healing magic, do they?” She answered with a smile.\n“I want to be a hero. That’s why I want to be able to use magic.” When I said that, Maria’s eyes widened. The other people around me also began to murmur.\n“I see… it’s true that a hero is supposed to be that kind of person. However, do you know that it’s now considered inefficient to balance sword and magic skills, and not recommended?”\n“I know. I was refused by the teacher when I asked to be taught healing magic.”\n“Huh, so you came to me because you were turned down by the teacher?”\n“Yeah. I heard you were also excellent in the priest class, and that you were as compassionate as a saint, so I thought you might teach me.”\n“Do you not think you are being too presumptuous, even though Maria-sama is kind?” A slightly plump girl in the priest class, who had a strong-looking face, interjected. Her demeanour seemed more suitable for the warrior class than the priest class.“No, it’s okay,” Maria said gently to the plump girl.\n“Well, I’m still far from being a saint and still in the midst of training, but it is our duty to lead people and serve God. If it’s okay with you when I have time, I can teach you about God.” Maria smiled with overflowing kindness.\nUpon hearing this, those around them praised Maria one after another.\n“How kind she is,”\n“As expected of the Holy Lady,”\n“To teach the teachings of God even to commoners.” At that moment, I also sincerely thanked Maria and expressed my gratitude. However, I would soon come to realize the truth behind her words of being\n“far from a Holy Lady.”\nSometime later, while I was swinging my sword behind the school building, Maria approached me.\n“Are you free, Ares?”\n“Oh, Maria. Are you going to teach me about healing magic?”\n“No, there’s no point in teaching healing magic to someone who cannot feel the presence of God. It’s like teaching arithmetic to a monkey. Do you understand?”\n“Well, sort of.” Although I was bothered by being compared to a monkey, I understood what she meant.\n“So, how can I feel the presence of God?”\n“Please bring me some delicious bread.” Maria smiled gently.\n“Huh? Bread? How does that have anything to do with God?”\n“Don’t think about it. Just feel it. Now, go and buy some bread. Hurry!” Although I was confused, as the student being taught, I ran as fast as I could to buy some bread.\nAnd so, I purchased the most delicious-looking bread I could find at the school store, and returned to the back of the school building with it in hand.\n“What’s this?” Maria looked at the bread I had bought with a cold, disdainful gaze, as if she were looking at a dead bug.\n“It’s bread, but what’s wrong with it?”\n“Sigh… You don’t understand, do you? I said ‘delicious bread’. Did you properly address God? Did you say, ‘Where can I find delicious bread?'”\n“Huh? Does God know where the delicious bread is?” Is God a bread lover or something?\n“God is omniscient and omnipotent, so He knows everything. Whether it’s delicious bread or sweets. You had to perceive God’s presence and bring back the bread. Trying to get away with buying bread from a nearby store is…blasphemy against God, you know?” It seems that searching for delicious bread was the first step in getting to know God. …Or was it really?\n“Well, it’s okay for today. I am compassionate and also hungry.”\n“Huh?” Was I just used as a servant because she was hungry?\n“Be careful next time.” With that, Maria took the bread from me and walked away. —\nAnd then, on a cold winter day, I was summoned by Maria to the riverbank.\n“As a compassionate person, I have come up with a trial for you.” At this point, I had a bad feeling about this.\n“No, I mean, couldn’t you just teach me in a normal way?”\n“What are you talking about? Despite receiving guidance from a priest in your childhood, you still couldn’t perceive the existence of God, right? There’s no way you can learn in a normal way, can you?” Maria showed an overly exasperated expression.\n“I’ve gone through the trouble of thinking up a trial for such a pitiful lamb like you. Are you really saying you don’t want to do it?”\n“Well, if you put it that way, I’m not saying I don’t want to, but…”\n“I see. Shall we begin then?” Maria picked up a stone from the riverbank and offered a prayer to it. The stone, blessed by God, emitted a faint light.\n“Please take this stone.” I was handed the glowing stone.\n“What am I supposed to do with this?”\n“Throw it as far as you can towards the river. The further it goes, the better.” I threw the stone as instructed, but since the river was quite wide, the stone landed with a splash in the middle of the river.\n“Well then, go and get it.”\n“What?!”\nThis woman is saying something outrageous.\n“This is a stone blessed by God’s protection. If you can perceive God’s existence, you should be able to easily find it.”\n“No, no, no, there’s no point in searching for it at the bottom of the river, is there?” It’s clearly a deep river with a fast current. You could drown if you’re not careful. Searching for the bottom of the river is madness.\n“Ha…what are you talking about?” Maria let out a big sigh.\n“You can’t feel God’s presence in your daily life, can you? Then you have no choice but to put yourself in an extreme situation, right? Do you understand what I’m saying?”\n“Well, no, but when you put it that way…”\n“I’m glad you understand,” Maria said, beaming.\n“So do your best.” From there, I spent three hours in the ice-cold river, like hell, trying to find the stone. Since it’s at the bottom of the river, it’s hard to tell if the stone is glowing or not. For the time being, I picked up stones at random at the bottom of the river and handed them over.\n“Are your eyes rotten?” Maria said coldly and threw the stone back into the river. She’s a heartless woman. I repeated that many times, managed to find the stone, and when I finally came out of the river feeling like I was dying, Maria said with a glossy evil smile,\n“Did you feel God’s presence?”\nIn this way, Maria’s trials were held every week, but I still couldn’t learn any healing magic, and I entered my third year. The only thing I learned was the location of the delicious bread and sweets shops in the capital city. When I pointed this out to Maria, she said,\n“If you remember the location of a good sweet shop, it will make women happy. It will be useful in the future.” Well, I can’t even imagine a future where I’m friends with a girl, aside from the witch in front of me… I was skeptical about the effectiveness of the trials, but since there was no one else to rely on for healing magic, I had no choice but to believe in her. However, one day, I felt a vague change in my senses. Specifically, I became unusually good at finding delicious bread and sweets.\n“Could it be that I’m hearing the voice of God?” Thinking that, I tried reciting the prayer I learned long ago, and succeeded in healing one of the small wounds on my arm.\n“I did it! What Maria said was true!” To be honest, I was so moved because I had almost given up. What on earth, Maria was a real saint! Why couldn’t I believe in her more? If I had believed in her and done the trials properly, I might have learned it sooner!\nMy heart was filled with gratitude and apologies towards Maria. I immediately headed towards the cleric class to express my thanks to her.\n“Thank you, Maria! I can finally use recovery magic!”\n“Really?” Maria was left speechless, and I will never forget her reaction.",
      "scraped_at": "2025-11-22T15:37:09.914907",
      "content_scraped_at": "2025-11-22T15:37:10.620248",
      "error": null
    },
    {
      "id": "6",
      "number": "6",
      "title": "Chapter 5",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/6/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“The guy isn’t a hero, he’s just an idiot,” said the man who was hailed as the Great Sage with disgust. The man wearing a purple magician’s robe was skinny and had a stern expression, and his appearance seemed very nervous. His way of speaking was also rough, making people not want to get too close unless they had a reason to. That was Solon Berkeley.\nHe had been hailed as a prodigy since childhood, and it was said that he was more skilled in magic than his teachers when he entered the Falum Academy. To this day, he has made many contributions to the world by creating new magic and making magical discoveries.\n“What exactly is a hero, anyway? Someone with exceptional strength? Someone with powerful magic?” – Someone who defeats the demon king?\n“Is defeating the demon king what makes someone a hero? Or does being a hero mean defeating the demon king? It’s ridiculous. It’s like asking which came first, the chicken or the egg. He had no strength or magic. He had none of the necessary qualities of a hero. Yet they entrusted the fate of the world to him? That’s insane. He shouldn’t have been the one to do it, and the people who left it to him were out of their minds.”\nBut he defeated the demon king.\n“That’s just the result. He was lucky… no, that’s not it. Anyone could have done it with the amount of effort he put in. Leon, Maria, and I should have put in more effort too. The others are out of the question. They did nothing and yet they continue to live carefree lives. It’s truly frustrating.”\nBut Leon said that his effort was abnormal.\n“Abnormal? Do you think you can defeat the demon king just by swinging your sword a thousand times a day? Do you think you can become proficient in defeating the demon king by casting magic a hundred times? That’s impossible, isn’t it?”\n“The goal is not to aim for the position of knight commander or court mage. We have to put in the effort to defeat the Demon Lord. It’s only natural to go beyond the norm to accomplish that. ──You taught magic to Ares, didn’t you?”\n“He was persistent. He kept pestering me to teach him magic. The teachers of the magic department refused to teach him. And rightly so. They don’t teach magic to warriors because it’s inefficient and a waste of time. That’s why he came to me and said, ‘You know more about magic than the teachers, so please teach me magic.'”“It was just a simple lesson. It was like killing time. But teaching magic to people led to various discoveries. Well, it wasn’t a bad experience. Now, I have disciples because of him. If it weren’t for him, I would have continued to look down on others and never taught anyone anything until I died.”\n“Did Ares have any talent in magic?” “No, he didn’t. He had the least magical aptitude of anyone I’ve ever met. You met Leon and Maria, right? Didn’t they say the same thing? He had no talent for anything, not even swords or magic. He was just an ordinary person.”\n“But it’s said that the Hero Ares used magic.” “Sort of… If he were to use a fire spell, using a flint and steel would have been faster. That’s all it was. He trained to death to get that far. I thought it was useless.”\n“But it was useful?” “It was. He had such crappy magic, but it worked. And not just once or twice. He was good at using magic. Or maybe he was resourceful? For example, instead of using a fire spell directly on the enemy, he would use oil as a fuel source. He would use wind magic to get into the enemy’s eyes while fighting with swords. He used magic in such a way that even weak magic was effective. I learned a lot from him. Magic can become 1 to 10 times stronger, or it can become 0, depending on how you use it. In the battle of Rozorof Forest, my first battle, I tried to use my strongest magic against a demon, and it didn’t work. I was so embarrassed. At that time, he told me, ‘Use weaker magic to buy some time. That’s all you can do right now.’ If it had been a normal day, I wouldn’t have listened to his orders. But I was so stunned at the time that I acted like a puppet and did what he said. And it worked.”\n“And that’s why you decided to form a party with Ares?” “I was arrogant at that time. I thought I could defeat the Demon Lord alone without forming a party. I thought, ‘I’ll team up with Leon or Maria if I have to.’ Maybe Leon and Maria thought the same way? But after spending time with Ares, I realized that I was wrong. I couldn’t have done it alone.”\n“They may have the appearance of saintly people, but deep down, they should have the same arrogance and disdain for others as I did. But in the Rosoroff Forest, they were confronted with their own helplessness and were crushed, and that’s when they teamed up with me. Without them, we would have each joined different groups like followers and would have died early. Each of us was certainly excellent, but without them, we couldn’t have united.”\nDid you display your power because of Ares?\n“I don’t know. But one thing I can say is that even if Leon, Maria, and I weren’t there, someone else might have become the hero and defeated the Demon King, but if Ares wasn’t there, the Demon King wouldn’t have been defeated.”\nCan’t that be called the quality of a hero?\n“Don’t be ridiculous. I already told you, he’s just an idiot. Being a hero isn’t a big deal. Ordinary people should just behave themselves. We were certainly geniuses. But we were arrogant bastards who rested on our laurels. However, he had nothing. He was a big stupid jerk who was called a hero for nothing. It’s easy to say ‘hero-sama.’ But what do those people really know about him? Do they think he defeated the Demon King just because he was a hero? Do they know what he did and what he sacrificed for it? There were many people more talented than him. Including me. It’s because we didn’t do anything that he had to become a hero.”\nYou fought the Demon King as a wise man. You didn’t do nothing, did you?\n“Of course, it was natural for me to fight the Demon King. I’m a genius, you know. Leon and Maria also fought because they had to. It was like a duty and destiny imposed on us. But he was different. He twisted fate and fought the Demon King. Even if that’s what he wanted, I don’t want him to be called a hero.”\nWhy did the hero die?\n“I don’t know. Is that all you wanted to ask? Then leave. Our conversation is over.”\nWhat was the cause of Ares’ death?\n“…Is that really what you wanted to know?” Solon, who had seemed sullen until just now, laughed with interest. “As we reported, Ares was killed by a demon. That’s for sure. But we didn’t see him die.”\nDid he die at the hands of the demon king’s subordinates, even though you defeated the demon king?\n“Well, that’s how it turned out,” said Solon.\n“Why weren’t you there at the time?”\n“We were just unlucky, that’s all.”\n“It could be speculated that you killed him based on the circumstances.”\n“Well, you could certainly think that way. But it’s impossible. Even if we wanted to kill Ares, we couldn’t.”\n“Was it because Ares was strong?”\n“No, it’s just that it’s impossible.”\n“Lastly, what was Ares to you?”\n“He was a friend. Just a friend. My only friend. But I lost him in that battle. He was just an ordinary and humble man… oh, but he did have one obsession.”\n“An obsession?”\n“When we set out on our journey to defeat the Demon King, the king had an artist draw us. Ares gave the artist detailed instructions. ‘Make my nose a little higher,’ ‘Make my eyes a little bigger,’ he said. Even though the artist would have beautified us without any instructions, we laughed at how picky he was. At that time, we thought he had a complex about his ordinary appearance, which was not befitting of a hero.”\nSolon’s lips twisted into a small smile. “If you want to know more about Ares, go to his hometown of Taris Village. If you want to document the hero, you can’t afford to miss that.”",
      "scraped_at": "2025-11-22T15:37:11.622102",
      "content_scraped_at": "2025-11-22T15:37:12.233932",
      "error": null
    },
    {
      "id": "7",
      "number": "7",
      "title": "Chapter 6",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/7/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "Having grown accustomed to the sword training I had imposed on myself and Maria’s weekly trials, I decided to set my sights on the next goal: acquiring offensive magic.\nI tried asking a wizard-class teacher, but was quickly refused. Well, that was to be expected. I had already set my sights on a student who seemed likely to teach me offensive magic:\nSolon Berkeley, a future great sage known as a child prodigy. Perhaps due to his magical prowess surpassing that of his teachers since his enrollment, he was also a troublesome student who rarely attended class. There was one reason why I chose him. He seemed to be just wandering around the academy aimlessly and looked bored. So, when I saw him that day, I immediately approached him.\n“Solon Berkeley, can you teach me magic?”\n“No.” Solon answered without even looking at me and tried to leave. With his gaunt, stern face, he exuded an aura of rejection towards others.\n“Wait a minute, can’t you at least hear me out?” I circumvented his path and blocked his way.\n“There’s no need to listen. You’re Ares, the crazy guy who’s really aiming to be a hero. You keep repeating pointless sword training after looking up to Leon as your model, and Maria treats you like a toy once a week. And now you want me to teach you attack magic? Ridiculous. Why should I waste my time, a genius, on someone like you? It’s your choice to waste your life, but if you get in my way, I won’t show any mercy.” With an even more severe expression, Solon ranted on.\n“You know well enough. If you know the reason, we can talk. Please, teach me magic.”\n“Huh? Did you listen to me? I said, don’t get in the way of a genius, you ordinary person.”\n“But aren’t you bored?”“Bored? Me?”\n“When you’re at the academy, you seem like you have nothing to do. And you don’t seem to have any friends either.”\n“You don’t have any friends either! I’ll kill you!” I could tell from the way Solon concentrated his magical power in his right hand that he was serious, so I quickly stepped aside. It seemed like not having friends was bothering him.\n“Don’t ever mess with me again,” he spat and walked away. ──── A week later, when I saw Solon again, I approached him.\n“Hey, Solon. Have you thought about what we talked about last time?”\n“Do you have no memory? Or has Maria’s trial messed with your head? Also, don’t call me by my name so casually, I’ll kill you.” From that point on, every time I saw Solon, we would have the same exchange. He would insult me with words like\n“die,”\n“trash,” and\n“garbage,” but thanks to the mental toughness I had gained from Maria’s trial, his insults didn’t affect me. And then, one day, about a month later, he finally stopped in his tracks.\n“Fine, I get it, I get it, you worm. There is some truth to what you say. I am indeed bored at the academy. I only came here because of some stupid obligations.”\nAccording to what I heard, Solon was enrolled in this academy just for the sake of the academy’s reputation.\n“We are low-ranking nobles. My father is a skilled magician, but the difference in social status is insurmountable. The chairman of this prestigious academy put pressure on my father to enroll me to add prestige to the academy as someone who produced Solon Berkeley. The first month was spent passing the time with the academy’s books, but now I have nothing to do. However, even those who teach have the right to choose their students.”\nSolon then took out several books from his pocket. It was not physically possible to fit that many books in his pocket. Is this also some kind of magic?\n“These books were distributed to the students of this academy’s magic class. If you read and understand them, you can use basic magic, but in reality, talent is also necessary. I’m not saying you’ll become able to use magic. Just memorize the contents of the book. Well, I’ll give you a week.”\n“A week?! So many books in such a short time…”\nIt’s outrageous compared to the one-year curriculum of the magic class.\n“Is it impossible? You think it’s more impossible to become a hero. You’re saying you want to use magic without having any talent in the first place. If you’re going to whine about something as trivial as this, you won’t be able to use magic.”\nWhen I think about it, Solon is not saying anything strange at all. Above all, compared to Maria’s trials, it’s a decent task.\n“Got it. One week. I’ll remember it. Teach me magic when I come back.”\n“I don’t tell lies.”\nSaying that, Solon left. I returned to my room and immediately started reading the books. The content was a bit difficult, but there were also commonalities with the magical books I read before, so it wasn’t impossible to understand. From that day on, I stopped practicing with the sword, avoided Maria’s trials, and read books even if it meant sacrificing my sleep. I spent all my time reading. And a week later, when I saw Solon, I ran up to him.\n“I’ve memorized them!”\n“I see.” Solon was indifferent to my enthusiasm.\n“Then let’s get started.” He started walking towards the school building.\n“Where are we going? Aren’t you going to check whether I remember it or not?”\n“I won’t ask you to do something you can’t do. And you’re someone who doesn’t lie, so there’s no need to check.” I was momentarily taken aback, but quickly followed after Solon. — Solon led me to an empty classroom.\n“Then, try chanting the fire spell.” I chanted the fire spell written in the book as instructed, but nothing happened.\n“Hmm, the spell is not wrong. But I can’t sense any mana in the spell. Do you have a clear image of the fire?”\n“Yes, as it says in the book, I’m imagining the fire in the fireplace.”\n“Your image is weak. Imagine a more intense flame.” Solon gave me detailed instructions and taught me more about the contents of the book. We didn’t see much progress, but Solon was always serious.\n“I see. That’s interesting. It’s possible that we could analyze the fundamental principles of magic in more detail,” said Solon.\n“But I don’t even have the slightest hint that I can use magic,” I replied.\n“That’s precisely why it’s interesting. I was able to use magic without even realizing it, but if we can figure out what we need to focus on when casting spells, it might increase the efficiency of magic. If you can figure out the path to casting magic, it might be possible to fundamentally improve it,” Solon explained.\nAlthough Solon’s words were somewhat confusing, he explained them passionately. He only came to the academy once a week, so he only taught magic then. However, we had become friendly with each other during our conversations. I had initially thought he was a sarcastic and difficult person to approach, but in reality, he was caring and had a good heart.\n“They called me a child prodigy and a genius, but I’ve been dealing with the dirty dealings between the nobles since I was a child, so I have my own distortions. Because of that, I couldn’t trust the people around me, and I was always alone,” Solon said with a self-deprecating tone.\n“Maria is the same way. She was really like a saint when we were kids, but she became twisted under the weight of the expectations of those around her. Even now, she appears nice on the surface, but internally, she’s quite repressed. However, she’s the only one who can feel the presence of God to that extent. She’s different from the old geezers who hold bishop positions because of their social status. If Maria couldn’t teach you, no one else could. In her core, she’s still a saint,” Solon spoke with complex emotions about Maria.\n“So, what is Maria’s trial like?” I asked.\n“I was whipped many times the other day. They said that if I prayed to God in earnest, I wouldn’t feel any pain. However, in the process of being whipped, the body’s natural healing abilities come into play, and it’s possible to feel the presence of God,” Solon said.\n“I see… But healing one’s own wounds is the first step toward the miracle of God’s healing. Perhaps as you are whipped, you may start feeling the presence of God?” I replied.\n“During the whipping, Maria’s face gradually changed into a radiant smile, and it was scary, but I didn’t feel any pain after a while. Maria called it a ‘miracle of God,’ but I think it was just because I was whipped so many times that I lost feeling,” Solon explained.\nI knew I had to learn healing magic as soon as possible, but I had doubts about Maria’s guidance.\n“That’s impressive. It doesn’t look like there are any marks left on your body though…” Solon glanced over my body briefly.\n“Maria healed the whip marks cleanly. She said, ‘Since the contents of the trial are a secret, it is necessary to eliminate the evidence.'”\n“Now, shall we start the magic training? You must not waste the time of a genius like me!” Solon averted his gaze from me and began the special magic training.\nMy school life passed like this. I devoted all my available time to training. I was looked at with strange eyes by those around me, including students and teachers, and was ridiculed for\n“working hard for nothing,” but I couldn’t give up on becoming a hero.\nAnd then, not long after I entered my third year, I was able to use magic. A small flame magic was activated from my fingertips.\n“You did it!” Solon was delighted as if it were his own achievement.\n“This is amazing! Without talent, you shouldn’t be able to use magic! Your efforts have overturned that! This is something to be proud of! It’s a groundbreaking achievement that overturns traditional magical theory!”\nI was so overwhelmed by his joy that I forgot to be happy myself. As the joy gradually overwhelmed me, tears ran down my cheeks.\n“Thank you, it’s all thanks to Solon.”\nFinally, the magic that I had dreamed of is now available to use. So that I will never regret again.",
      "scraped_at": "2025-11-22T15:37:13.236276",
      "content_scraped_at": "2025-11-22T15:37:13.853872",
      "error": null
    },
    {
      "id": "8",
      "number": "8",
      "title": "Chapter 7",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/8/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "The village was neither big nor small, just one of the typical mountain villages. It was quite far from the capital city and would take 10 days on horseback to get there. The people there lived by farming and had a peaceful lifestyle. This was Tariz Village, which became famous for producing a hero.\n“Do I know about Ares? Of course! I was his friend!” The man was asked if he knew about Ares and began to talk about him smoothly, as if he was used to it. He searched for people around Ares’ age who might still be alive and asked about Ares.\n“Ares could do anything from a young age. He was strong, fast, and smart. He was good-looking too, so all the girls his age liked him.” The man continued to talk about Ares, seemingly comfortable with the topic.\n“He was amazing. Give him a sword and he would become better than any adult in no time. He also learned healing magic from the church’s priest. And that’s not all. He read an old, tattered book on magic that belonged to the village chief’s house and learned magic as well. Even I and the village chief couldn’t read the special letters in that book. He studied hard and learned to read those letters. That’s why he became a hero!”\n“So Ares could use swords, magic, and even healing magic when he was in this village?” “Of course. You know that, don’t you? The Hero Ares is famous for being able to use swords, magic, and even healing magic. He was a special person, that’s why he became a hero, right?”\n“Why did such a special person like Ares bother to enroll in the Falum Academy?” “Why? To be recognized as a hero, he had to enrol there, didn’t he? Or maybe he went there to find his companions? I don’t know much about it. Maybe the fortune teller told him to go to the capital city?” “The fortune teller?”\nIs that about the prophet?\n“Yes, that’s the one. One day, he came to our village and said, ‘A hero will appear from this village to save the world.’ Everyone knew immediately that it was about Ares. He was truly a special person.” The prophet is a person known for appearing at the crossroads of the world and delivering prophecies. Well, given that his activity spanned over 1,000 years, it’s uncertain whether he was human or not. Some have suggested that he might have been multiple people.\nDid Ares meet the prophet directly? “I don’t remember. That fortune-teller disappeared quickly. He was just, well, a weird person, with dignity, and just a mysterious person.”\nAfter receiving that prophecy, Ares set off for the capital?“Yes, that’s right. I thought to myself that Ares was amazing.” ──Amazing?\n“Well, although it’s peaceful now, in those days, monsters were rampaging, and the journey to the capital was dangerous. Because of that, trade was disrupted, and the village suffered. That’s what I heard from my parents.”\nAnd a 14-year-old boy travelled that dangerous journey alone?\n“Yes, that’s right. Well, I guess he thought that an adult would just slow him down if he came along. But he made it there on his own. He really was amazing.” I parted ways with the simple village person and headed to Ares’ home. It was the current village chief’s house. Ares was the son of the current village chief and the grandchild of the village chief who went on the journey. “Thank you for coming all this way to see us. I understand that you have some questions about our son, Ares,” said the village chief’s wife, Shera, who had arranged to meet me in advance by letter. Perhaps because of that, Shera welcomed me warmly. She seemed to be in her 50s, but had a dignified presence, and I could imagine that she had been a beautiful woman when she was younger.\nWhat kind of child was Ares?\n“He was a very well-behaved child. He was smart and didn’t cause any trouble. He even helped out around the house. He was truly… a good child.” Shera spoke slowly, as if reminiscing.\nHe had a reputation for being able to do anything?\n“Rather than saying ‘anything’, he was a skilled child. However, I didn’t think he was as outstanding as everyone said. He could certainly wield a sword decently, perform small miracles of the gods, and use magic, but they were not of a very high level. He stood out because this is a small village, but if he went to a more populous place, he would have been evaluated as a ‘slightly unusual and talented child’. ”\nBy any chance, are you not from this village?\n“Yes, you figured it out. I’m from the capital city and not from this village. I met my husband at school in the capital city where we were both good students and athletes. After we got married, we moved to this village. Actually, my husband and I weren’t anything special. I don’t really talk about this, though,” said Shera, smiling.\nHowever, Ares was chosen as the hero.\n“It was strange. He was our pride and joy, but he wasn’t that kind of child. The villagers praised him as the one mentioned in the prophecy, but my husband and I didn’t believe it. Who would want to put their own child in danger to fight the demon king? No parent wants their child to do such dangerous things. Rather than not believing it, we probably didn’t want to believe it. We would have preferred someone else to be the hero if possible.”\nEven so, you sent him off as a hero.\n“My father-in-law, who was the village chief at the time, was enthusiastic about it, and so were the villagers. They were all delighted that a hero was coming from their own village. At that time, the world was shrouded in a heavy atmosphere due to the appearance of the Demon King. This village was no exception. When the appearance of the hero was announced, the whole village was overjoyed. We couldn’t deny that it was different. So, we sent him to the Falm Academy to get stronger and find comrades to travel with.”\nWas it your will to send him to the Falm Academy?\n“It was my husband’s and my will. We knew that the Falm Academy was a training institution for heroes. However, we also knew that it was a school where only nobles went, so we told him that he didn’t have to go if it was too difficult for him to get in. Our goal was to make him stronger and find comrades, so we thought that anywhere he could achieve that goal would be fine. He was a flexible thinker, so we thought he would do well if we told him that, but in the end, he entered the Falm Academy.”\nWhat did Ares himself think of being chosen as a hero?\n“He was a clever child, so he read the atmosphere of the village and behaved as everyone wanted him to. But I think he was anxious inside. He was probably the one who was most aware that he wasn’t that exceptional. I remember seeing him outside swinging his sword relentlessly when I woke up in the middle of the night. He couldn’t sleep because of his anxiety.”\nHowever, he defeated the Demon King.\n“…… And then he died too. I should be happy that the world was saved, but my husband and I can’t be happy. Why did he have to die? I still think that. There should have been many more talented people who could have done it, but why did it have to be him?” Shera wiped away her tears. She looked away from me and looked around the room. I noticed a sword hanging on the wall. It was beautiful, but it was heavily worn.\nWhat’s that?\n“That’s the sword of that child. Only the sword came back. It was a sword that had been passed down in this house for generations. I don’t know its history, but it fought alongside that child until the end. It must have been a good sword. The fact that only that sword came back is the only consolation. That’s all that’s left of his belongings.”\nDid one of the hero’s companions bring back the sword?\n“I haven’t met any of the people who were with Ares. Zack brought it back.”\nWho is Zack?\n“He’s that child’s cousin of the same age. He’s the child of the master’s younger sister, but both parents were adventurers. His father was from Marika, and when Marika was invaded by the Demon King, they went to rescue them and both died in battle. Zack was left in our care before they left.”\nHow was Zack able to bring back the sword? “He went to the capital with that child. After that child died, he said he received the sword through someone else there. So he brought it back to this village.”\n— The villagers said that Ares travelled alone.\n“He had luggage, so we couldn’t let him go alone. And since those two grew up together, they were very close. Zack was there, so I think Ares was a little relieved to be able to travel with him. The villagers exaggerate Ares’ accomplishments, so they don’t talk about Zack… Maybe they really just forgot about him because he was such an unremarkable child.”\nWhere is Zack now?\n“After coming here, he said he would ‘leave on a trip soon’ and that was it. I suggested that he live in this village, but he stubbornly refused. He said, ‘I’m sorry, I let Ares die. I’m sorry.’ There was nothing for that child to apologize for…”\nDid Zack travel with Ares?\n“He was just accompanying him to the capital. That child was just an ordinary child, so he couldn’t go on a journey to fight the Demon King. He was hardworking and tried his best at everything, but he was somewhat clumsy. But he was a really good kid, you know? Ares was able to learn many things because Zack was with him. When Ares started something, Zack would stick with him until the end. Do you know how hard it is to continue learning alone? Being able to continue because there’s someone who does it with you.”\nWhat do you think of the pictures of the hero that have spread throughout the world?\n“They look a lot like that child. We also bought a big picture of the hero and hung it up in our house, you know?” Indeed, there was a large painting of the hero’s heroic figure hanging prominently in this house.\nDo Ares and Zack look alike? “As cousins, they do look quite alike. But Ares has slightly larger eyes and a higher nose. It’s a small thing, but it changes the impression quite a bit. Ares was often complimented on his appearance, while Zack was said to have no distinguishing features. It’s strange how such a small difference can make such a big impact.”",
      "scraped_at": "2025-11-22T15:37:14.862385",
      "content_scraped_at": "2025-11-22T15:37:15.464971",
      "error": null
    },
    {
      "id": "9",
      "number": "9",
      "title": "Chapter 8",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/9/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“I’m glad Zack came with me,” Ares said after we had left the village and walked a fair distance.\n“But was it really okay for me to bring you along? Wouldn’t it have been better to have a proper adult with us?” I voiced what I had been thinking all along. I had been concerned that it was a bit reckless to send two 14-year-old boys to the capital. When Ares was being sent to the capital, it was decided that someone from the village would accompany him. Initially, several young unmarried men were considered for the role, but Ares chose me. However, strangely, no one objected to this decision.\n“Even if an adult came who I’m not close to, it would just be awkward. Besides, all those people who flatter me as a hero and want me to fight monsters are the kind who aren’t willing to risk themselves,” Ares criticized the villagers, something he doesn’t usually do. I was surprised to hear that.\nIndeed, among the villagers who were candidates to be Ares’ traveling companion, some were openly pleased that they weren’t chosen. They knew that the journey would be dangerous. Although Ares rarely spoke ill of others, he was clearly dissatisfied with the villagers’ attitudes.\n“Well, the monsters are strong, so I don’t blame them. My parents were also killed, and I don’t want to fight anyone,” I learned that both of my parents were adventurers who made a living by fighting monsters. They were killed during a major battle against the demon king’s army.\n“But if I become a hero, I’ll have to fight those monsters. I’ll have to defeat the demon king, too. What does it mean to be a hero? I never wanted to be one. But if I don’t do it, the world will be destroyed. It’s a terrible story,” Ares said with a dry laugh.\n“…Sometimes at night, I heard my mother crying. She really didn’t want me to become a hero,” I also knew that. Ares’ parents, who were also my foster parents, had doubts about the credibility of the prophecy. They didn’t want Ares to become a hero if they could help it. However, Ares’ grandfather, the village chief, was delighted with Ares and most of the villagers celebrated Ares as a hero.\n「Don’t worry! Ares can handle it! He can use swords, magic, and even divine miracles! He’s defeated many monsters before. There’s no one in the capital who can match him!」 I forced a bright tone of voice, even though it was a bit of a stretch.\n“I don’t know… There are no specialized warriors, mages, or priests in Tarriz Village. Everyone here is just an amateur. Even if we appear strong here, we don’t know how it will be in reality,” Ares said, and I was shocked to hear him speak like that, even though I had been by his side the whole time.\n“Oh, sorry about that. I guess I said something unnecessary after leaving the village. Even though I’ve decided to go as the hero, I’m feeling a little timid,” Ares said apologetically.After that, Ares stopped speaking timidly. But I couldn’t shake the feeling of what had been said during that exchange.\nThe journey was going smoothly. In the villages we stopped at along the way, Ares negotiated like an adult, and we obtained water and food in exchange for a small amount of money. Even when we encountered monsters, we tried to avoid fighting and only fought when it was unavoidable. Even in battle, Ares ensured my safety and fought calmly and steadily, using his attack and healing magic accurately and finishing off monsters with his sword. He truly looked like a hero.\nWe were now walking on a road through a dense forest. The sky should have been a clear blue, but the large trees on both sides of the road were so tall that they blocked out the sky, causing me to feel a vague sense of anxiety. This road used to be a busy route leading to the capital, but since the appearance of the Demon King, the forest had become infested with monsters, and there was no human traffic at all. We hadn’t encountered anyone in half a day of walking. On the other hand, we had encountered many monsters, but Ares had defeated them all with ease.\n“He really is amazing. Ares could’ve done this all by himself, couldn’t he?”\nI also had a sword for self-defense, but I never had the chance to use it. During our journey, I only practiced with it as a partner for Ares.\n“Zack, you rely on me too much. Doing something alone is tough. I can keep moving forward because you’re here with me. When I learned the sword, studied magic, and was taught healing magic, it was the same. At first, everyone starts doing it together, but when things don’t go well, one by one drops out. In the end, it’s always just you and me who are left,” Ares said with a slightly strained but cheerful voice.\n“I never learned magic or divine miracles, though,” I replied with a laugh.\n“That’s a shame, but you stuck with me until the end. That’s impressive enough. It’s hard to continue doing something that doesn’t go well. I was lucky that I could handle many things, but if I couldn’t do something well, I might have given up halfway like everyone else,” Ares said.\n“I can’t even imagine Ares not being good at something. But I also wanted to learn at least one thing,” I said honestly.\nAs I was about to say more, Ares suddenly stopped. I also stopped and looked around, sensing something was wrong. It was too quiet. Even the sounds of animals in the forest were gone.\n“Oh, you noticed. As expected of the hero,” someone said as they appeared from behind a large tree in front of us. It was a person, but with purple skin, a muscular body twice the size of a human, ears that were probably twice as long as ours, and bright red eyes.\n“Run! It’s a demon!” Ares shouted. Hearing that, I immediately started running behind me. Demons were servants of the Demon King, and although they looked like humans, they were overwhelmingly stronger in both physical and magical abilities. I ran away immediately, partly because I was scared of demons, but also because I didn’t want to slow Ares down. Soon, I heard the clash of swords. Ares had started fighting the demon. I ran into the forest and watched the fight from a safe distance behind the trees. The demon swung a giant sword that I had never seen before, with the force of a gust of wind.\n“I heard that the prophet had found the hero, but he is still just a kid. If we kill him while he’s still growing, it’s not a big deal.” The relaxed demon attacked, and Ares was on the defensive. Ares calmly dodged attacks that could not only cause injury, but also death, and blocked those he couldn’t dodge with his sword. Ares endured the attacks as time slowly ticked by. The demon, who initially showed no signs of worry, eventually became impatient.\n“You’re pretty good at defense, but what about magic?” Frustrated with his inability to land a hit, the demon stopped using his sword and instead tried to cast a spell with his left hand. Ares didn’t miss the opportunity.\n“Ha!” He stepped forward like a released arrow, quickly slashing at the demon’s outstretched hand. Several of the demon’s fingers flew into the air.\n“Gyaaa! You brat!” The injured demon quickly regained his grip on his sword and attempted to counterattack Ares. However, his sword lacked the sharpness it had just moments ago. (He can’t hold his sword properly since he lost his fingers!) Was Ares aiming for this? If so, that was impressive! Ares immediately switched to the offensive, and the demon was forced to defend.\nAres did not aim for a big blow, instead he targeted the opponent’s openings and dealt small amounts of damage.\n“Ku, this!” The demon, who had countless small wounds, gradually weakened in the eyes of the onlookers. Victory was within reach, but Ares continued to fight steadily. Finally, the demon, who had missed Ares’ sharp blow, dropped his sword with a clang on the ground. Ares took advantage of this moment and swung his sword towards the demon’s neck. However, the demon blocked the strike with his empty left hand. Although the blade dug into his arm, it did not cut him in half.\nOn the contrary, the demon seemed to have absorbed the sword with the bulging muscles of his arm.\n“It won’t come out!?” This was the first time Ares had raised his voice in the fight.\n“I’ll let you have the left hand,” the demon grinned and grew a huge claw on his right hand, then attacked Ares. Ares released his sword and tried to avoid the attack, but his abdomen was slightly slashed. Against the approaching demon, Ares chanted a spell.\n“Wind!” He aimed the wind magic at the demon’s eyes.\n“Tch!” The demon dodged the spell, but in the meantime, Ares had moved back and widened the distance between them. The demon pulled out the sword that was embedded in his left hand and threw it into the forest behind him. His left hand hung down limply. He probably couldn’t use it properly. Ares muttered something. Perhaps it was a spell, but the magic he knew was basic and unlikely to be effective against the demon.\n(Oh no!) Thinking that, I ran towards Ares with my sword in hand from within the forest. The demon started moving. Ares drew the demon’s attention enough for him to cast a fire spell. The fire wrapped around the demon’s head, but he kept charging. Ares managed to avoid him, but his movements seemed slow. Was it because of the wound on his stomach from earlier?\n“Ares, catch!” I threw my own sword towards Ares. The demon raised his right claw. Ares skillfully caught the spinning sword and jumped into the demon’s chest, piercing him deeply.\n“Got him!” I exclaimed, but,\n“I’ll give you a mercy kill, but you’ll be coming with me…” The demon, impaled by the sword, sank his large fangs into Ares’ neck. Blood spurted out vigorously from Ares’ neck.\n“Ares!” My scream echoed through the forest.",
      "scraped_at": "2025-11-22T15:37:16.474661",
      "content_scraped_at": "2025-11-22T15:37:17.104966",
      "error": null
    },
    {
      "id": "10",
      "number": "10",
      "title": "Chapter 9",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/10/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "In the end, Ares managed to survive. Thanks to the fact that the demon died immediately, his neck wound was not as serious as expected and was healed by a recovery spell. However, the wound was only sealed and not fully healed.\nAres’ neck was discolored and in terrible condition.\nMoreover, using all of his magic to heal the wound left him unable to stand on his own due to magic exhaustion and the pain of his injuries. In addition to the abdominal injury, which was not fully healed, there was also a risk of his life being in danger. I minimized my belongings and began to walk with Ares, supporting him on my shoulder. Ares’ sword, which was thrown away earlier, had been found and was now in my possession. He begged me to bring it along with us.\n“I’m sorry,” said Ares, his face pale.\n“Don’t worry about it. I’m trying to save the hero who will save the world. You’re quite the hero, aren’t you?” I joked, but there was no escaping the heavy footsteps. We were walking at less than half the speed of a normal walk. We didn’t know when we would reach a village at this rate. As time passed, Ares’ condition worsened. Either due to the abdominal injury or high fever, Ares finally became unable to walk. I had to carry him on my back, which was difficult as he was about the same size and weight as me. I would walk for a bit, then rest. At this rate, even after a month, we would not be able to leave the forest, let alone reach a village.\nDuring a break, I tried to use a recovery spell I had learned from a village priest on Ares. As it had never succeeded before, it was no surprise that no divine miracle occurred.\n“(This is a lifelong request! Please heal Ares’ wounds!)”Despite desperately praying to the gods, my pleas went unanswered. I regretted not putting more effort into learning recovery magic as I wondered if such a minor injury could end up killing Ares. My own powerlessness brought tears to my eyes, but Ares was in such a state that he couldn’t even see me crying.\nCarrying Ares on my back, we struggled to make any progress. My own body was feeling worse, with fatigue and hunger taking their toll, but worst of all, we had run out of water. There was no sign of any rivers or water sources nearby, and the forest was too steep for us to venture far into it. I knew the importance of water, but we had used up most of it yesterday to clean Ares’ wound, and now we had none left.\nI tried to cast a water magic spell that Ares and I had practiced together, but I had never successfully cast it before and nothing happened. Ares would have been able to cast it easily. Why did I have to be the one to get injured? Why couldn’t I cast a simple spell?\n“Fetching water from a well would be faster,” said one of the companions I had studied magic with, commenting on Ares’ first successful water magic spell. It was true, but there was no guarantee that there would always be a well or river nearby, especially while travelling and fighting monsters. Now I understood this all too well.\nAs night fell, everything became pitch black. I heard roars and growls from creatures around us, but I couldn’t see anything. I was scared and desperately wanted a fire. I tried to cast a fire magic spell, but as expected, nothing happened. A putrid smell emanated from Ares’ body. His wound had likely started to rot, but I was too afraid to remove the bandage to check. If I could use a fire magic spell, I could have burned his wound closed. I had not packed any flint, thinking that Ares’ fire magic would be sufficient. Now, I realized the importance of fire in such situations. The darkness of the forest was terrifying, and the cold was unbearable. Ares had a high fever, but it was only affecting parts of his body near his wound. His fingers were so cold that I couldn’t feel any warmth, even when we huddled together.\n“I just want a small fire so that I can use magic. (If I have another chance, I’ll definitely learn magic)” I made a promise to myself, trembling with fear in the darkness.\n──── Morning came. I couldn’t sleep well. Ares had been moaning all night, and he looked like a corpse with the blood drained from his face. I myself was still exhausted, with no physical or mental strength to carry Ares on my back.\n“What should I do? What the hell should I do…” Despair made me blurt out.\n“Kill me…” Ares let out a groaning voice.\n“I’m done for. If I stay like this, Zack will be dragged down with me. Besides, it’s painful to continue like this. It’s terrifying to feel my body rotting away. Please, put me out of my misery with my sword.” Ares spoke with a small, breathless voice.\n“I can’t do that! You’re my brother, my best friend, we’ve been together all this time! There’s no way I could do something like that!” Ares and I grew up like brothers. I can’t even imagine killing him.\n“That’s exactly why. You should know how I feel right now. Zack has no choice but to leave me behind and move on. But if you leave me like this, I’ll just be eaten alive by insects and beasts while still alive. So please, let me die. Then you can go ahead alone.” Ares’ eyes were closed. He just kept grimacing in pain.\n“What am I supposed to do alone in the royal capital? You’re a hero, aren’t you? If the hero dies, the world will end!”\n“I wasn’t the hero after all. The prophet only said, ‘A hero will appear from this village to save the world.’ They never said anything to me. And when I heard the prophet’s words, I imagined it was Zack who would be the hero, not me.”\n“That’s not fair! You can’t help it if you can’t use magic! If you could use magic, you could have healed Ares’ wound! You can’t even use a sword properly…”\nI couldn’t take it anymore and broke down in tears.\n“I don’t know why, but that’s what I thought,” Ares said, his face contorted in pain.\n“Oh, it hurts so much. Please, Zack, please make it easy for me.”\nI could tell he was truly suffering. And I knew what I had to do.\nCrying, I drew my sword and aimed it at Ares’ chest as he lay on the ground. Ares kept his eyes closed and tried to smile, even though he was in pain. He was doing it for me.\nMy hands were shaking. After a few moments, I plunged the sword into Ares’ chest. I felt the resistance of flesh and bone before the sword plunged into his chest like a vacuum. Ares’ lips moved faintly, as if trying to say something, but only one word came out:\n“Mom…”",
      "scraped_at": "2025-11-22T15:37:18.117062",
      "content_scraped_at": "2025-11-22T15:37:18.841155",
      "error": null
    },
    {
      "id": "11",
      "number": "11",
      "title": "Chapter 10",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/11/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "Eight years have passed since then. This forest hasn’t changed at all. The towering trees that cover the sky and the atmosphere that vaguely conveys a sense of unease. Nothing has changed.\nAlthough the Demon King was defeated, there are still many monsters, and the road through the forest, which is deserted, is in disrepair. I searched for the place where I left Ares’ body, relying on faint memories, but I couldn’t find it.\nEven if I remembered the exact location, there would be nothing left, as I didn’t have the strength or energy to bury the body and just covered it with a cloak.\n“What are you doing, Ares? This is no time to dawdle here. We need to hurry back to the capital and report our victory over the Demon King. There are still many remnants, and our strength is needed more than ever.” Leon called out to me as I strayed from the road and entered the forest. He is in a hurry to get back. As the next head of the earldom, he has accomplished great things and wants to report to the royal palace with pride. It’s only natural. Maria and Solon are also promised positions once they return.\n“Leon, Maria, Solon. This is where we part ways. Please tell everyone that the hero Ares has died.” My words caused the three of them to widen their eyes in shock.\n“What foolishness are you spouting, Ares? We have finally defeated the Demon King, haven’t we? Let’s return together! If you do, you can marry the princess and become the king! If you become the king, I would be willing to serve you!” After pausing for a moment, Leon continued,\n“Are you worried about becoming the king? Even if you are a hero, some of the nobles may oppose a commoner becoming the king. But if that happens, I’ll be there to support you!”\n“The Earl’s family will support us with all their might. No one will be allowed to complain,” said Leon, who used to insult me by calling me a commoner and saying things like\n“I’m going to be the next king as a hero!” when we first met. Compared to back then, he has changed a lot. No, his core hasn’t changed. Leon has always been a noble and chivalrous knight who thinks only of the country and has no personal greed.\n“That’s right, Ares. Becoming king is also a trial as a hero. It’s not like you to give up here, you know?” Maria smiled kindly.“I will take control of the church, so let’s seize power together” … The content of what she said was not gentle.\n“Ares, why? Tell us the reason,” Solon asked calmly.\n“I’m sorry, but I’m not Ares. I wasn’t really a hero,” I finally said what I had wanted to say for a long time.\n“What are you talking about? If you’re not Ares, then who are you?” Leon looked suspicious.\n“I’m Zack, my real name is Zack. I’m sorry for deceiving you all this time,” I bowed my head to the three of them.\n“Zack? Why did you fake your name?”\nSolon continues to question,\n“Why did you pretend to be Ares?” From there, I began to talk about the past. A prophet appeared in my hometown and I left as Ares’s companion, but halfway on the journey, we were attacked by a demon and Ares was injured. I had to deal the final blow. Then I traveled alone to the capital and enrolled in the academy…\n“He defeated a demon at 14!? I can’t believe there was such a man…” Leon marvelled at Ares’s bravery. Yes, Ares was amazing. He did all of that at just 14 years old. If he had lived, he could have defeated the Demon King much earlier.\n“I understand Ares’s story. But why did you need to deceive others by using his name?” Solon leaned against a nearby tree. Perhaps he thought it would be a long story.\n“It’s because I killed the hero. That’s why I had to take on the responsibility of being the hero. It was my duty.” I had come this far to take responsibility for killing the hero.\n“Ares died because of the demon. It’s not your fault,” Maria said.\n“…No, Ares died because of me. I still feel the sensation of piercing him with my sword. And I didn’t defeat the Demon King as Zach, I did it as Ares. If I had remained as Zach, there’s no way I could have done it.”\n“But Ares is already dead, isn’t he?” Solon crossed his arms and tapped his arm with his finger. He must have been frustrated.\n“Ares’s mother…Shera, who raised me, is a very kind person. I can’t tell her that ‘Ares died because he couldn’t become a hero.’ The truth is, she didn’t want Ares to become a hero,” I explained.\n“So you want to take all the credit for Ares’s achievements and leave?” Solon’s words were laced with anger.\n“The achievements were supposed to belong to Ares in the first place.”\n“Are you an idiot?!” Finally, Solon began to raise his voice. He was originally short-tempered and had a sharp tongue.\n“You are the hero! Ares fell on the way! That’s the truth! And I know the words of the prophet. ‘The hero who will save the world will appear from this village.’ It doesn’t necessarily mean Ares. You were the hero from the beginning!” As a sage, Solon’s points were correct. I knew that too.\n“I’m just an ordinary person who couldn’t use a sword or magic. I’m not fit to be a hero. And to me, the hero is Ares.” I had only been following in Ares’ shadow all this time.\n“Ah, you’re just an ordinary person! You were the person with the least talent in the academy! And you defeated the demon king! We know how much training you went through and how much you paid for it! We worked day and night, with no rest, even if we couldn’t get enough results, we kept moving forward. Maybe you didn’t have the qualifications to be a hero. But you saved the world! I won’t recognize anyone else as the hero but you!” Solon said, hiding his face with his hood. His tone was strong, but his voice was filled with emotion.\n“Thank you, Solon. Just by hearing you say that, I’m already satisfied.” My efforts that I thought would never be rewarded had finally borne fruit, and I had three friends who recognized that. That was enough.\n“Are you really leaving, Ares… no, Zack?” Maria had a genuine expression on her face, not the usual saintly facade. She was sincerely worried about me.\n“Don’t go, Zack. I’m the one stopping you. Refusing my wish is blasphemy against God, you know?”\n“Thank you, Maria.” Maria’s face, which she rarely shows, is undoubtedly the most beautiful in this world.\n“If you say that, it makes me hesitate. But I have to go. If I keep moving forward, I might meet someone, and then they’ll find out that I’m still alive. That’s the one thing I want to avoid. I was planning on leaving a little earlier, but I wanted to continue traveling with you guys for as long as possible.”\nIt was a difficult and harsh journey, but the days I spent with my companions were good memories for me.\n“Where are you going?” Leon asked.\n“First, I’ll return to the village and report that Ares defeated the Demon King and return this sword to Ares’ parents. Then I’ll leave this country and go on a journey.”\nI intended to meet Shera-san one last time before leaving this country. If I stayed in this country, the thing I wanted to hide might eventually be revealed.\n“His Majesty the King is not yet of an age where he needs to hurry and decide on the next king. Come back anytime. I’ll be happy to welcome you.”\n“Thank you, Leon. I think you’d make a splendid king.”\n“Of course.” Leon laughed.\n“There’s no one more suited to be king than me. But I’m not so debased as to accept credit that should go to you.”\nHe was truly a noble man. It’s a shame he doesn’t want to become king.\n“Well, I’m going then.” I turned my back to my companions.\n“Wait.” Solon called out.\n“What are we to you, or rather, what am I to you?”\n“Well…” He hesitated for a moment.\n“We’re best friends, aren’t we?” They had been through thick and thin together since their days at the academy. There was no other fitting way to describe their relationship.\n“I see. You’re still as shameless as ever to call a genius like me your best friend. But maybe we could have become just regular friends,” Solon chuckled.\n“Congratulations, Solon. You never had any friends since you were a child, did you?” Maria teased, but Solon gave her a stern look and retorted,\n“If you ever go missing, I’ll always find you and bring you back. That’s what friends are for.”",
      "scraped_at": "2025-11-22T15:37:19.860106",
      "content_scraped_at": "2025-11-22T15:37:20.489178",
      "error": null
    },
    {
      "id": "12",
      "number": "12",
      "title": "Chapter 11",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/12/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“I see you’ve come.” Solon was sitting in the room as if he had been waiting for me. He was wearing his usual purple robes as a sage. It seemed he was anticipating my arrival.\n“Why did you do something as foolish as revealing that Ares was not the hero?”\n“It was bound to come out eventually.”\n“I reviewed the investigation report. When you referred to ‘Ares,’ you were talking about Ares. But when you referred to ‘that guy’ or ‘him,’ you were talking about Zack.” Solon didn’t answer the question and gave a faint smile.\n“When did Zack become Ares? According to the investigation, Zack was already calling himself Ares when he arrived in the capital…”\n“He was attacked by a demon on the way to the capital, and Ares died. That’s what Zack says, anyway,” Solon replied, as if testing me. He was implying that Zack might have killed Ares.\n“I believe him. But why did you bring this up now?”\n“I already told you, didn’t I? He has no talent. He’s bad at lying. It’s a miracle he wasn’t found out all these years. You probably didn’t think he was dead either, did you, Princess Alexia?”\nAt those words, I fell silent.\n“After we returned to the kingdom, you were proposed to a few times. The primary candidate was Leon. But you and Leon both refused, citing that the recently deceased hero was your fiancé. You’ve been avoiding marriage proposals ever since.”It wasn’t just Leon; Solon was also a candidate. However, he refused as well. I kept refusing marriage proposals that came my way, and Leon and Solon supported my decision. Only Maria said, “For the sake of the kingdom’s peace, you should get married soon,” and tried to convince me to get married.\n“But that can’t go on forever. His Majesty won’t allow it anymore. That’s why you started a project to document the hero’s achievements. To search for him.”\nThat’s right. As part of the country’s policies, I proposed compiling the achievements of the hero into a document and started investigating it myself, believing that he was still alive. However, I had no idea that he wasn’t actually Ares.\n“There are many meddlesome people besides us. Leon is using the power of his earldom to gather information on where he went, and Maria is utilizing the church’s information network to search for him. I have also come up with a few magical spells to search for him.”\n“But you haven’t found him yet?”\n“He went outside the country. It’s not that easy to find him.”\nI felt like Solon’s grumpy expression had softened a bit.\n“Why are you searching for him?”\n“To bring him back. He’s my friend. Life without friends is boring.”\nHe spread his arms and tried to joke. “…Doesn’t Zack want to reveal himself as the hero? Are you still going to bring him back?”\nThat’s the concern. Zack wants to stick to his lies.\n“Who is he lying for? If he went all the way to Talis Village, he should know, right?”\n“For Shera-san. He wants to at least make it seem like Ares was the hero for her sake.”\n“That’s right. She is Ares’ mother and his foster parent. He even had her draw a picture that resembled Ares.”\nThe first time I saw the picture, I thought it was a bit embellished, but there was a reason for it.\n“So what now? Zack won’t come back just for his lies. He’s a strong-willed person who defeated the Demon Lord. But at the same time, we can’t tell Shera-san the truth. We don’t want to waste Zack’s resolve.”\n“That’s true.” Solon readily acknowledged.\n“But what if Shera knew about the lie from the beginning? What would you do then?”\n“I don’t know… I mean, what could we do?”\n“I know. She definitely knows.”\n“Why do you say that?”\n“If you go back and see Shera again, she will tell you.”\n“Do you mean I have to go back to Talis Village again?” It was a ten-day journey by horse, not an easy trip.\n“What? I’ll take you there. I’m not called the Great Sage for nothing.”\n“Are you saying you can teleport us there?”\n“The spell is complete. Only I can use it.”\nSolon said it so casually, but teleportation magic was legendary and not easy to perform.\n“So, what do you say, Princess? Are you too scared to use magic to get there?” Solon challenged.\nOf course, it was scary—magic I’d never seen before. But it was too late to back down now.\n“Very well. Let’s go.”\nWhen I answered that, Solon stood up and led me to another room. In the deep basement of the mansion, a large magic circle was drawn on the floor.\n“For now, we will teleport from this room, and we can only return to this room.”\nThe content was groundbreaking. When Solon and I stood at the center of the circle, he began chanting. The magic circle emitted a pale blue light that engulfed us. In the next moment, we found ourselves in a forest near Talis Village. The scent of plants was strong.\n“Where are we?”\n“We’re in a forest near Talis Village. I chose a place where we won’t be seen. Shera’s house isn’t far from here. Let’s go.”\nSolon started walking briskly. Although he looked like a scholar, he moved like one of the hero’s party members. I hurried after him. Soon we reached the village chief’s house. I knocked, and Shera opened the door.\n“You’ve come again… I thought you would.” She smiled nervously and led us inside.\n“Um… who is this person?”\n“He’s Solon Barclay, known as the Great Sage.”\n“Great Sage… It’s amazing that someone like you would come all the way here. I’m Shera Schmidt. Nice to meet you.” Shera bowed politely to Solon, then knelt before me.\n“You’re Princess Alexia, aren’t you?”\nI explained once more our investigation and belief that Ares—Zack—was alive, and how Leon, Maria, and Solon were all searching for him.\n“But haven’t you found him yet?”\n“He went outside the country. It’s not easy to find him.”\n“What’s the point of looking for him?”\n“To bring him back. He’s my friend. Life without friends is boring.”\n“…Zack doesn’t want to reveal he’s the hero. Are you still going to bring him back?”\n“It’s for Shera. He wants to make Ares the hero for her sake.”\n“That’s right. She’s Ares’ mother and guardian. He even had a picture made to resemble Ares.”\nShera’s eyes filled with tears as she spoke:\n“But that child had become so magnificent—it was unbelievable. His body was trained like I’d never seen. Only his eyes remained the same. His hands were rough and callused, as if he’d swung a sword tens of thousands of times. Blisters and scars covered his palms. Then I realized: ‘Ah, this child defeated the Demon Lord—for Ares and me.’ I couldn’t tell him his kind lie was a lie.”\nMy vision blurred. Solon hid his expression under his hood.\n“I didn’t want Ares or Zack to become heroes. I just wanted them to grow up and live happily. That’s no longer possible for Ares, but at least I want Zack to be happy. And I have to hear about Ares’ final moments from that child’s own mouth. It’s my duty as his mother. So, Princess Alexia, please find that child—find Zack. I beg of you.”",
      "scraped_at": "2025-11-22T15:37:21.500193",
      "content_scraped_at": "2025-11-22T15:37:22.139491",
      "error": null
    },
    {
      "id": "13",
      "number": "13",
      "title": "Chapter 12",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/13/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "After the battle in the Rozorov Great Forest, I joined forces with Leon, Maria, and Solon and was officially recognized as a hero. When I first entered the royal castle, I sensed a subtle atmosphere. Everyone must have been thinking,\n“Why is this guy here instead of Leon and the others?”\nBut since I myself had the same thought, I didn’t really care. The king didn’t seem to have high expectations for me personally, but he seemed to have high hopes for my party, which had gathered excellent people. The war situation with the Demon King’s army was deteriorating, so he couldn’t help but have high hopes. In the midst of all this, the princess Alexia, whom the king introduced to me, stood out.\n“This is my daughter, Alekzia. Once you have defeated the Demon King, I will make you Alekzia’s husband and the next king of this country.”\nThe first time I saw her, I thought,\n“What a beautiful girl.”\nHer long flowing golden hair and beautiful blue eyes that looked like gems exuded intelligence. She was only 12 years old and still had some childishness, but she had a dignified and beautiful charm that was different from Maria’s.“Hero-sama, please defeat the Demon King and save the world. I will be waiting for your safe return,”\nshe said to me with a smile. I thought she was trying too hard. She’s still a 12-year-old girl. Even though it’s tradition, she probably doesn’t want to marry a man she doesn’t even like who is six years older. She too is playing the role of a\n“princess,”\nsuppressing her true feelings.\n“Princess, I promise. I will definitely defeat the Demon King,”\nI said to her in a voice only she could hear.\n“But I won’t come back here. So please marry the person you love.”\nI’m not a real hero, so I can’t marry the princess. And it’s ridiculous to become a king. Besides, I wanted this cute girl in front of me to decide her own future. I wanted to give her that choice. Alekzia was surprised to hear my words and opened her big blue eyes wide. It was nice to see her real expression. If I think that I’m fighting to protect the future of children like her, even if I’m a fake hero, I can move forward.\nDuring our stay at the castle, we received hospitality parties and had our portraits drawn. We were treated for several days, and we were provided with practical and good equipment, but I kept my sword and only had it maintained. I intended to fight until the end with this sword. While at the castle, I mainly trained with Leon on swordsmanship. Although my sword skills had improved considerably, I still could not match Leon’s. However, by using attack and healing magic effectively, I was able to fight persistently and put up a fight that was almost on par with him.\n“Your fighting style is still messy,”\nLeon commented, but he had no malice. Leon understood that such fighting style was necessary for fighting against monsters. However, it consumed both physical and magical power, so my body was greatly exhausted. When the training was over, I collapsed during the training session.\n“I’ll go ahead,”\nLeon said as he still had enough energy. Although our battle was even, his movements were not wasted, and he still had plenty of energy left. While waiting for my strength to recover, someone approached me. It was Princess Alexia.\n“I was watching,”\nshe said, her tone more rough than when we first met.\n“Leon is better with the sword. I know because I also learned swordsmanship. Your fighting style is not beautiful and, how should I put it… it’s embarrassing.”\nAs expected, she was a straightforward princess. I couldn’t help but smile wryly.\n“Um… I’m sorry. I don’t know how to talk to royalty properly.”\nI’m not good with etiquette. I leave the responses to nobles and important people mainly to Leon and Maria because I don’t understand them at all.\n“Just be normal. I’m not expecting the hero to be formal,”\nshe said, seemingly not caring much about etiquette. I appreciated that, and I liked her personality.\n“I’m not that strong. That’s why I aim to win no matter how embarrassing or messy my fighting style is,”\nI said.\n“Even though you’re a hero, you’re not that strong?”\n“So how do you plan on defeating the Demon King?”\nIt seems like she is asking out of curiosity rather than belittling me.\n“Well, I’ll have to use all sorts of methods, won’t I?”\n“Like what?”\n“Let’s see. For example, if the Demon King’s castle is going to burn down, I’ll set it on fire and burn the whole thing down.”\n“Set fire to the castle?!?”\nPrincess Alexia covered her mouth in shock.\n“I mean, using oil and considering the direction and strength of the wind, things like that. It would make things a lot easier.”\n“But that’s not something a hero would do. It’s cowardly, isn’t it? I’ve always thought that being a hero was a bit like being an assassin, but to really do something like that…”\nPrincess Alexia seemed a little puzzled.\n“Well, even though I’m called a hero, I’m weak, you know. I’ll defeat the Demon King by any means necessary. Because if I don’t defeat the Demon King, everyone will be in trouble, right? If poison works, I’ll use poison, and if negotiating with monsters will make them fight on our side, then I’ll negotiate with them. No matter what anyone says, I have to see this through.”\nI’m not really like a hero, and I’m not actually a hero. That’s why I’m going to fight without choosing my methods.\n“You’re not just like a hero on the outside, but on the inside too, aren’t you? Then why are you doing this? Because if you’re not coming back here, it means you don’t want to be king, right? What’s your goal?”\nShe looked at me with curious eyes.\n“My goal is to defeat the Demon King. I haven’t thought about what comes after that. I’ll risk my life to defeat the Demon King… No, maybe it would be better if things turned out that way.”\n“If I defeat the Demon Lord and die in the process, everyone will stop doubting that Ares is the true hero. Maybe that’s the future I’m hoping for.\n“No way,”\nPrincess Alexia said, pointing her finger at me, her face flushed with anger.\n“Ares Schmidt, what are you thinking? I’ve never heard of a hero fighting the Demon Lord to the death. There’s no such thing as a dark hero’s adventure! Got it? A hero’s job is to defeat the Demon Lord and return to the castle.”\nHer way of speaking was kind of like that of a 12-year-old girl, and I couldn’t help but laugh.\n“But if I come back, you’ll have to marry me, won’t you? Won’t that be a problem?”\nEven as I said that, I couldn’t help but think that I wanted to return to the castle and see her grow up into a beautiful woman.\n“T-That would be a problem, but… it’s okay! I’ll figure something out! So promise me! Promise me you’ll defeat the Demon Lord and come back alive! This is an order from the princess!”\nShe gave me an order with a slightly troubled look on her face, but it was very cute.\n“Okay, I understand. I promise to defeat the Demon Lord and make sure I survive too.”\nI intentionally changed\n“come back alive”\nto\n“make sure I survive.”\n“So, Princess Alexia, promise me you’ll marry someone you love, okay?”\n“I’m going to fight for everyone to be happy, so I don’t want you to have an unwanted marriage or anything now that the Demon King is gone.”\n“I understand. If you keep your promise, I’ll keep mine too.”\nShe turned away and hid her expression as she made that promise.",
      "scraped_at": "2025-11-22T15:37:23.155492",
      "content_scraped_at": "2025-11-22T15:37:23.771693",
      "error": null
    },
    {
      "id": "14",
      "number": "14",
      "title": "Chapter 13",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/14/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "“We resolved the issue with Shera, but we still don’t know where Zack is, right?”\nWe had returned to Solon’s mansion using teleportation magic and were facing each other in the room.\n“There is likely only one person in this country who knows his whereabouts,”\nSolon said, taking a sip of tea his disciple had brought.\n“Who is it? I’ve interviewed most of the people involved with the hero, and I don’t think anyone was closer to Zack than you guys, who were members of his party,”\nI asked.\n“The prophet. The prophet probably knows where Zack is,”\nSolon replied. Upon hearing Solon’s answer, I felt let down. The prophet was a mysterious person of unknown identity. As a supernatural being, it was even more difficult to find their whereabouts than Zack’s.\n“Isn’t it harder to find the prophet’s whereabouts?”\n“No, I have an idea of who the prophet is,”\nSolon answered, taking another sip of tea.\n“Their identity? What do you mean?”\n“This is what I found out after defeating the Demon Lord,”\nSolon began, placing his tea cup on the table as if to prolong the suspense.\n“The prophet is probably the counterpart of the Demon Lord on the human side.”\n“The counterpart of the Demon Lord on the human side?… What does that mean?”\nI couldn’t quite grasp what he was saying.\n“The Demon Lord is the king who rules over monsters and is closest to the evil god. Well, even though we call it the evil god, it’s only from the human side. From their perspective, our god could be considered an evil god.”\n“God becoming a demon? Solon, are you saying something dangerous in front of the royal family?”\nThe royal family of this country has a deep connection with the temple. If you say something wrong, even the Great Sage may be impeached. Of course, I have no intention of doing such a thing.\n“No problem. The concept of good and evil is just a matter of perspective. We embarked on a long journey to defeat the Demon King, but there are also beliefs and justice on the side of the demons. Ultimately, the battles between humans and demons are a proxy war for the gods they worship. We were reminded of this many times during our journey.”\n“……”\nWhat Solon was talking about was not something I could agree with right away, but as someone who had never left the country, I couldn’t deny his stories of fighting outside.\n“So I thought, ‘If there is a demon king on the demon side, there must be a counterpart to the demon king on the human side.'”\n“And that’s the prophet?”\n“That’s right. Since the hero is the one directly defeating the Demon King, he is the most suspicious as such, but we know that is not the case. Therefore, the prophet who is finding the hero is the most suspicious.”\n“I kind of understand what you’re trying to say, but the Demon King was so powerful, yet the hero… Zack didn’t have that kind of power. The prophet only prophesied the existence of the hero and didn’t do anything, so it seems unbalanced.”\nDemons are strong, but humans are weak. Then the gods should give humans more power.\n“The authority of a god is probably different. No matter what anyone says, humans ultimately rule over most of this world. Humans, who are weaker in power than demons. The Demon King temporarily reverses that situation, but it never becomes a long-term thing.”\nNow that he mentions it, that’s true. The Demon King has never had complete control over the world. Even though he was supposed to be so strong.\n“He may not have strong power, but in that sense, the role played by the prophet is important. I don’t even know what the prophet is doing specifically.”\n“So is the prophet someone close to a god? Then…Maria? She’s called the Saint, and she should be the one who feels the most the presence of the gods.”\nEven though she is called the Saint, Maria has a somewhat dark feeling, so I could understand if she were called the prophet.\n“No, that’s not it. She’s just excellent at recovery magic. She’s on a different level than ordinary monks in terms of power, but that doesn’t mean she’s close to a god. Personally, I think she has a higher affinity with the demons than with the gods.”\nIt seems that Solon has been friends with Maria since childhood, but he has a quite harsh evaluation of her.\n“And the activity period of the prophet exceeds 1000 years. It is not a role that one person can continuously bear. They should be in this country, right? The clan that has been serving the gods for a long time,”\nsaid Solon, looking at me intently.\n“Huh? Wait, me? Are you saying that the royal family is the prophet?”\nI couldn’t imagine that the royal family was being suspected.\n“Yes, that’s right. The royal family of this country originally has roots in the priestess who serves the gods, and the female line has continued unnaturally. And the role of the priestess is always passed on to the next princess, and they continue to offer prayers at the temple without interruption. Therefore, it is likely that the current prophet of this generation is the current queen,”\nSolon explained.\n“That’s not possible! My mother is a kind person! There’s no way she would do anything suspicious like being a prophet!”\nI recalled my mother in my memory. Even as a child, she was a beautiful, kind, and wonderful woman.\n“How long has it been since you met your mother?”\nSolon ignored my objections.\n“I haven’t met her for over ten years since my grandmother, who was the queen dowager, passed away and I took over the role of the priestess. As you know, when you become a priestess, contact with people is strictly limited, right?”\n“I know that. But I don’t know what the priestess does at the temple. They say that they offer prayers to the gods, but what does that mean in concrete terms? What does it achieve to offer prayers to the gods?”\nI was at a loss for words. If my mother were to pass away, I would become the next priestess, but I wasn’t told specifically what I would be doing.\n“You don’t know either, do you?”\nSolon read my expression and seemed to understand that I didn’t know anything.\n“The temple in this country is a divine realm. Even the royal family cannot easily enter it due to strict restrictions. Information is probably thoroughly restricted. The fact that even the next generation of priestess, the princess, is not taught anything until she enters the temple is evidence of this. What is so secret that it needs to be kept hidden to this extent? Why does the prophet only appear in this country and why is the hero only born in this country? If we analyze these things, it’s imaginable that the royal family, or rather the queen’s family, is the prophet. ”\n“Th-that’s ridiculous…”\nI couldn’t easily deny it. I had nothing to refute his argument. Moreover, since my opponent was a great sage, I couldn’t just dismiss this as a mere delusion.\n“Let me be clear. You being a princess is precisely why you hinted that Zack was the hero. As a princess, I thought you could enter the temple and find out where Zack was.”\nIt seemed that he had been planning to use me from the very beginning. However, I was also using Solon to find Zack, so it was a mutual relationship.\n“Why do you think the prophet knows where Zack is?”\n“There must be some connection between the prophet and the hero. That’s why the prophet is able to identify the hero. In fact, the previous heroes married princesses and became kings of this country. This case is the only exception.”\nI didn’t know what to say in response.\n“I just want you to go to the temple and meet the queen. I don’t want anything more than that.”",
      "scraped_at": "2025-11-22T15:37:24.786328",
      "content_scraped_at": "2025-11-22T15:37:25.383735",
      "error": null
    },
    {
      "id": "15",
      "number": "15",
      "title": "Chapter 14",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/15/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "The temple was located in the underground of the royal castle. It is said that the castle was built on the site of the temple, rather than building the temple in the underground of the castle, almost as if to protect or hide its existence. Descending the stairs that lead to the temple, the white marble floor and walls shimmered in the flickering light of the torches. It felt almost too orderly and inorganic, as if rejecting the presence of people. When I began to feel like I was falling into a bottomless pit, I finally saw the door leading to the temple. In front of the door, there were two priests dressed in pure white robes, with their faces covered by veils. Since only women are allowed to enter the temple, both of them were female priests, but they had swords at their waists. They looked eerie, like uncertain ghosts. They also came from a family that served as priests for generations and had pledged absolute loyalty to the royal family, not just the princess’s family. They received strict training, and their swordsmanship was said to surpass even that of knights.\n“Please inform my mother… and serve as an intermediary for the priestess. Tell her that Alexia has come.” I said to the priests, who didn’t even budge when I arrived. Then, the priests moved to the sides as if to widen the way, and the door slowly began to open on its own.\n“We have heard from the priestess. Please enter inside.” I didn’t know which one of them spoke, or maybe both of them did at the same time. Contrary to my expectations, it seemed that they had no intention of stopping me. Apparently, they knew in advance that I would come here. Beyond the door was a long corridor, and after passing through it and opening another door, a vast space that utilized a cave spread out before me, enveloped in light that didn’t seem like it was underground. The first thing that caught my eye was a huge goddess statue, so intricately crafted that it looked alive. In front of the goddess statue’s altar, there was a person dressed in white clothing, standing like a lifeless statue.\n“Mother…” A gasping voice escaped her lips. Although her appearance overlapped with her memories, the glamorous expression that was loved by everyone had disappeared, replaced by a deep sense of emptiness.\n“Alexia, I know the reason why you came here. And that you were incited by Solon.” Her eyes were cold, and her words lacked warmth.\n“Do you know about Solon?” How would she know that Alexia had been in contact with Solon, while she was in a place that seemed so isolated from the outside world?\n“I know him well. He’s a little too clever, which makes him difficult to handle.”\n“Him? Mother, were you close with Solon?” Solon has been renowned as a child prodigy from a young age, but he shouldn’t have had much to do with the royal family.\n“What did Solon tell you that made you come here?” Her mother didn’t answer and instead returned the question.“Mother, are you saying that you’re a prophet?”\n“That is a fact. I am a prophet, and my family is the closest to God. And you are one of us as well.” She felt like she was about to faint. Although she was mentally prepared for it, hearing it said again was a shock.\n“Why?” That was all she could manage to say.\n“This is the fate of our clan, an inescapable destiny, which one could call a curse from the gods.” Mother glanced gently at the goddess statue behind her.\n“How did Solon say the Prophet should guide the Hero?”\n“I don’t know the exact method…”\n“That’s right. Even at that time, Solon didn’t know the full extent of it…Very well, I will teach you the secret of our clan as your successor.” She gave a faint sardonic smile, even mocking herself.\n“I cannot die.”\n“What?” I couldn’t understand what she meant at first.\n“When I die, the world ends, and time rewinds until the cause of my death is removed.”\n“What does that mean…?”\n“You asked if I was close to Solon. He was one of the heroes I guided, just like you. His wisdom and magical power were unrivaled, and he was the closest to defeating the Demon King except for Zack. He was also the one who uncovered the true identity of the Prophet. Although he has no memory of it now, or rather, it never happened.” Mother closed her eyes and looked back on that time. Was it just my imagination that I sensed sorrow in her expression?\n“It wasn’t just Solon. I guided Leon and Maria as well, but they fell in the middle of their journey. While they were all talented, they had a tendency to rely on themselves and underestimate others, which ultimately made them unworthy of being heroes. There were many other candidates for the hero, but none of them succeeded. As for me…as the Prophet, I don’t know who the hero is. I will continue to repeat time forever until someone capable of defeating the Demon King is found.” I was speechless. Even though I understood, my mind rejected it. Then how many times did Mother repeat time?\n“It takes almost 10 years for one hero to reach the end. I have repeated this cycle over 100 times.”\n“So, that means over 1,000 years…?”\nIt was an unimaginably long period of time. Can humans endure such a time?\n“Yes, after a journey that lasted more than a thousand years, I found Zack. However, at first, I tried to guide Ares. I knew of a talented boy in a distant village and led Ares with a slight hope. Ares was a talented boy, and I had high expectations, but it ended without reaching the royal capital. He immediately committed suicide, and I thought about doing it over again, but I became interested in Zack, who was with Ares for some reason.”\n“…Suicide?” It was an unacceptable word to hear.\n“If I repeat more than a hundred lives, my own death is insignificant. My first death was caused by monsters. At that time, the Royal Castle was attacked by the Demon King’s army, and everyone in the castle was killed. If I were to repeat that tragedy, I wouldn’t hesitate to commit suicide.” Then, does that mean that she has taken her own life countless times over the past 1000 years?\n“Do you pity me, Alexia? But it’s over now. The boy who had no talent and no expectations, who had traveled this long journey, defeated the Demon King. His determination to defeat the Demon King was stronger than anyone else I have seen, and he had an indomitable spirit that could withstand any humiliation or difficulty. He was truly worthy of the name of the hero.” The hero was the human that the prophet had searched for over a long period of time. There was no fate or miracle there, and as a result, the human who defeated the Demon King was given that name. I was speechless for a while, but there was one thing that bothered me. It was a discussion of a possibility.\n“…Mother, that is, couldn’t Zack and Ares have defeated the Demon King together with Shera, Ares’s mother, still alive? I met Shera, Ares’s mother, in Tariz Village. She was deeply saddened by Ares’s death. She was also the one who raised Zack. I just felt sorry for her…” As far as I could tell, Ares was a talented person. If that was the case, wouldn’t it have been possible to defeat the Demon King with Ares still alive, together with Zack?\n“Zack’s strength came from the tragic determination of Shera, Ares, and Zack himself. Without that, it would have been impossible to defeat the Demon King. Zack’s feat in defeating the Demon King was a build-up of a slight possibility, like threading a needle. There is no guarantee that it can be replicated. And Alexia, are you asking me to die to test that possibility?” …It would come to that. It may be cruel to demand that much from her mother.\n“I have witnessed countless tragedies and disasters. Considering that, Shera’s grief is just one of the common tragedies.”\n“However, Mother, wasn’t it you who chose Ares? Neither Ares nor Zack wanted to become heroes. Shera didn’t want it either.”\n“Let’s admit that. I didn’t take any action, but it’s also a fact that I chose and abandoned Ares. Yes, I killed the hero Ares.” She acknowledged her mistake, but there was no sense of remorse in her expression. The mother I knew shouldn’t have been like this.\n“But Alexia, I never wanted to become a prophet. Do you know what I thought during the repeated cycles of time?”\n“You didn’t want to be born as royalty?” It was something that I myself had occasionally thought.\n“Why is it my turn? Why did the demon king’s invasion have to happen in my era? I resented and cursed it over and over again. If only this were my mother’s era, or my child’s era. Why do I have to suffer so much? The demon king won’t be born for another hundred years. You will end your life without experiencing anything like this. Let me be clear. I envy you. Even though you were born into the lineage of priestesses, you will hardly use that power.”\n“That’s not…” I felt it was unreasonable, but I could understand my mother’s feelings to some extent. She must have had a difficult and treacherous journey over the past thousand years to become so cold and indifferent. Enough to want to impose it on other humans.\n“Do you understand? Even looking at your face is unpleasant for me. I know why you came here. You want to know where Zack is, don’t you? He’s in the village of Letin in the former Marica Kingdom, his father’s homeland. If you want to see him, go there.” Marica Kingdom was a country near the demon king’s territory and was the first country to be destroyed by the demon king’s invasion. It was also where Zack’s parents lost their lives.\n“The conversation is over. I forbid you from entering your temple as long as I am alive. Leave this place as soon as possible.” After finishing her words, my mother closed her eyes, as if there was nothing else to say. I didn’t think I was hated that much, and I bowed my head in sadness and headed towards the door. However, I reconsidered and turned back to face my mother.\n“Mother!” There was no response from my mother to my call.\n“Thank you very much! Thanks to you, the world has been saved! Even if I’m hated, I’m proud to be your daughter! I’m glad to have been born as the daughter of such a strong mother!”\nTears fell unknowingly. Through my blurred vision, I thought I saw a faint expression change on my mother’s face. Was that just my wishful thinking?\n“I love you, mother! I will surely love you until the day I die! Please remember that, won’t you?” I bowed deeply to my mother and then left, feeling as though I was being dragged away by my hair.",
      "scraped_at": "2025-11-22T15:37:26.398585",
      "content_scraped_at": "2025-11-22T15:37:27.064821",
      "error": null
    },
    {
      "id": "16",
      "number": "16",
      "title": "Chapter 15",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/16/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "The first time this dreaded power was activated was when the Demon King’s army attacked and conquered this castle, and the Demon King himself broke the barrier and came to the temple. After taking Alexia’s life before my very eyes, he killed me. I remember being struck by the shock of Alexia’s death more than my own impending death. The next time I woke up, I was back in the world ten years ago. I held young Alexia in my arms and cried. She didn’t understand what had happened and looked bewildered, but she gently hugged me back with her small hands. I vowed never to let this child die again.\nI understood what had happened to me. When I inherited the role of the shrine maiden from my mother, I also inherited the records of the previous shrine maidens along with their power.\n“World Compilation” is a powerful ability given by God to the shrine maiden’s clan to keep them alive and counter the Demon King. Shrine maidens don’t die from aging, but only when they die from other causes does the ability activate. This power has been used not only in battles against the Demon King, but also in various situations. Examples include rebellions by vassals, betrayal by the king who was her spouse, and assassinations. However, none of these incidents required\n“World Compilation” to be used repeatedly. Only in battles against the Demon King did it have to be used over and over again.\nThe first thing I did with\n“World Compilation” was to form a coalition army to counter the Demon King’s army. I thought that moving the country as a whole would be more effective in defeating the Demon King than relying on individuals like the hero. I persuaded my husband, the king, and persuaded the surrounding countries to prepare for the Demon King’s army early on. Since I knew the invasion route and attack patterns from my first experience, I was able to prepare for battle perfectly. Thanks to this, the coalition army fought valiantly and successfully repelled the Demon King’s army. However, no matter how many times they repelled them, the Demon King’s army immediately attacked again. By bringing active demons under his control, he reinforced his forces and continued to attack without interruption. Eventually, the coalition army became exhausted, the frontline country fell, and the coalition army quickly collapsed, and I experienced my second death.\nIn the second\n“World Compilation”, I considered going on the offensive with the coalition army. I realized that defending alone would not work, and that it was necessary to strike at the enemy’s base. However, this did not work politically. A huge budget was needed to mount an expedition to the distant Demon King’s land. Even if they won, there were almost no territorial or monetary benefits. Moreover, the Demon King’s army was not yet a direct threat. The expedition plan was abandoned, and eventually they allowed the invasion of the Demon King’s army.\nUpon seeing the demon army invade the kingdom, I felt sick to my stomach. Ultimately, for the third time and beyond, we decided to follow tradition and search for a hero. If the country wouldn’t act, then there was no other choice but to send a small group of elite warriors to defeat the demon king. Fortunately, there were many talented young people, such as the sword saint Leon, the saint Maria, and the sage Solon, whom we had high hopes for. In particular, Leon was an excellent candidate, with a noble upbringing and great skill. However, when we actually sent him to the demon king’s territory, he couldn’t adapt to the adventurer-like journey due to his high status, and he couldn’t cope with the sneak attacks from the demons — being betrayed by the humans who were supposed to protect him, and so on. In the end, he died about three months after beginning his journey.\nThe next candidate was Maria. There was some hesitation in making a priestess the hero, but she had a bad personality in a good way, and was skilled at controlling people’s hearts. Maria progressed smoothly, as expected. She made good use of her companions and not only dealt with the demons’ attacks, but even outsmarted them. However, her party could not truly believe in each other, and gradually began to show cracks. Then, when they faced a powerful demon, the party fell apart, and she died about a year later.The third candidate was Solon. He had a difficult personality, and we thought his chances of success were lower compared to Leon and Maria, but he excelled in magic and intelligence. When I gave him information I had gathered from my past experiences, he used it to his full advantage, infiltrating deep into the demon king’s territory and even confronting the demon king himself. However, the gap in power between him and the demon king was overwhelming, and he eventually died in despair.\nAfter that, I tried guiding different people, trying to get better results. I once had Leon, Maria, and Solon in the same party, but they just bickered with each other, and the results were not good. Through these trial and error attempts, my mind gradually began to wear down. I stopped caring about people’s deaths, and began to accept my own death easily.\n“Anyway, I can just start over.”\nWhen it didn’t work out with people from the capital, I started looking at talent from the countryside, and that’s when I noticed Ares. He was not only skilled in swordsmanship, but also in magic, had a good head on his shoulders, and had a flexible mentality. His abilities weren’t that high, but he was a well-balanced boy. However, he died on his way to the capital, too early.\n“Another wasted effort.” I immediately thought about dying, but for some reason, I became interested in the boy who was traveling with Ares. The talentless and powerless boy named Zach. He impersonated Ares and entered the Phalum Academy, working hard to become a hero. I saw myself in his perseverance, no matter how little he achieved, and no matter how much effort went to waste. And then, before I knew it, he became a hero. He was weaker than any other hero, and a disheveled, muddy mess of a hero.\nZach teamed up with Leon, Maria, and Solon, and managed to harmonize them together. He didn’t try to use them well, but tried to bring out the best in them.\nI also gave Zack information I knew whenever I could, and he overcame numerous difficulties and trials.\n“Maybe Zack can defeat the Demon King?” My expectations of him grew stronger. However, at the same time, a conflict arose within me. It was about Ares. Zack was fighting for Ares, dedicating himself to become Ares’ replacement. I knew that painfully well. But if he defeated the Demon King like this, the world would continue to move on with Ares still dead. After much hesitation, I talked to Zack when he was just one step away from the Demon King’s castle.\n“If you could go back to the world where Ares is still alive, what would you do?” Zack’s eyes widened.\n“Go back? Not come back to life?”\n“You won’t come back to life. You’ll just go back before you die and try again.”\n“What about memories?”\n“They won’t remain. Only I will remember. But I can guide Ares to not die.” Zack looked at me for a while and then said,\n“What about the Demon King? We’re almost there, but can we make it back here again?”\n“…I don’t know,” I honestly replied. It seemed like a miracle that we had made it this far, and I had no confidence that we could reproduce it again.\n“Well, then, it’s okay.”\n「Huh?」\n“It must be hard to start over again, right? Even if someone told me, ‘you can start your life over again,’ I don’t think I could do it. I don’t want to go through all that hardship again,” he said, laughing.\n“But if we continue like this, what about Ares?”\n“I’m sorry about Ares, and of course, I would want him to come back to life if that were possible, but if it means everything we went through until now would be for nothing, then I don’t think it’s worth it. It’s not just me; everyone’s effort would be in vain. That’s why I’m going to keep moving forward.”\n“Is that okay?”\n“Yeah, this is the choice I made. I am the one who abandoned Ares. I killed him. So, you don’t have to look so sad.”\nFace?\nDue to the power of the priestess, my appearance projected from the temple to the Demon Lord’s realm is just an illusion, and there should be no way to distinguish between young and old, male and female. There is no way to read expressions. I am just an existence that can only watch from the temple and cannot do anything.\n“You can’t possibly understand me.”\n“I somehow do. Maybe it’s the atmosphere? I had a feeling you were a little like Shera-san. I thought you were a kind, motherly person.”\nShera…that’s Ares’ mother. She must not have been pleased with her son becoming a hero. Of course not. Even I wouldn’t want to send my own daughter on such a harsh and dangerous journey. No parent would want to send their child into such peril. But I am imposing it on someone else’s child.\n“I…am not kind.”\n“Are you sure about that? I don’t think so. The prophet’s purpose is to defeat the Demon Lord, right? But you’re proposing to start over again when you’re just one step away from achieving that. You couldn’t do that if you weren’t kind.”\n“…………”\n“But you know, if I died without being able to defeat the Demon King, and I had to start over again, I’d like to be guided to learn magic before setting out on the journey. I’m not very good at it, so it would be difficult to teach me, but please help me. Then, I think I can travel with Ares as his companion without letting him die this time.” Zack said, as if it were a joke, expressing his regrets and true wishes, then he left.\nAfterward, Zack and his companions fought a fierce battle and defeated the Demon King, and my thousand-year journey came to an end. Finally, I was liberated from the long cycle of reincarnation and shook with joy. Finally, I could meet my end as a human.\nHowever, that joy disappeared the moment I opened my eyes from my sleep.\n“The dead can never return.” It wasn’t just about Ares. Many people had died because of my choices. In the beginning, during the\n“World Compilation,” I had worked hard to save as many people as possible, but over time, I had become neglectful of that effort, thinking\n“It’s useless anyway, it doesn’t matter.”\nBut this time, we succeeded in defeating the Demon King. We could have saved even more people. Afterwards, I blamed myself continuously. I wished for my life to end quickly, with only that in my heart.\nAfter a few years, Alexia appeared before me. She had entered the sanctuary by force after a long argument with the temple guards. Apparently, she had come here to ask about Zack’s whereabouts, instigated by Solon.\n(What a foolish daughter.) She had entered the sanctuary out of mere curiosity without even properly understanding my suffering or Zack’s feelings. A blackness rose in my heart. After telling Alexia everything, I offered her the poisoned wine that I had been using to prepare for my own suicide.\n“If you are also a member of the priestess clan, show me your determination. If you can overcome the fear of death, I will tell you Zack’s whereabouts.” It was just a threat. I thought the spoiled girl would just go home.\nHowever, Alexia…\nAfter answering\n“understood, mother” to the priestess, she drank the poison and died while leaving a gentle smile while looking at me. In the face of Alexia’s death, I remembered why I had been\n“world building.” Wasn’t it to save this child and cross over death many times for her sake? This child had come here with her own determination. I had used that as an outlet for my pent-up emotions. I pierced my own throat with a dagger, collapsed onto Alexia’s body, and returned to the world one hour ago. I instructed the priestesses to let Alexia in, and waited for the second visit from my daughter. After the sound of the door closing, I opened my eyes and confirmed that Alexia had left. Silence returned to the sanctuary.\n“Thank you, Alexia. My beloved daughter.” It was a lonely journey where no matter what I did or what I tried, people kept dying due to my guidance and my choices, with no reward or gratitude, and I thought of it as a cursed role.\n“But deep down, I wanted to tell someone…” My legs had lost their strength, and I leaned against the altar while tears of joy and sorrow mixed and flowed.\n“I will never meet that child again…” It was the only atonement I could give myself.",
      "scraped_at": "2025-11-22T15:37:28.070303",
      "content_scraped_at": "2025-11-22T15:37:28.686312",
      "error": null
    },
    {
      "id": "17",
      "number": "17",
      "title": "Chapter 16",
      "url": "https://lightnovelpub.org/novel/who-killed-the-hero/chapter/17/",
      "original_time": "3 months, 3 weeks ago",
      "novel_slug": "who-killed-the-hero",
      "content": "It took some time to get to the village of Retin. Since Solon’s teleportation magic can only go to places he has been before, they had to go near where the Marika Kingdom used to be and then make their way to Retin Village from there.\n“Magic is not omnipotent. It is impossible to identify the location of a place you have never been to and move there,” Solon said proudly for some reason. However, that would mean he had been to Tariz Village.\n“I went nearby to try to meet Ares’ parents. But I couldn’t meet them in the end,” he answered a bit grumpily and shyly. Ah, this person looks arrogant, but in reality, he is a timid and kind person. He probably relied on me to ask about Shera-san because he couldn’t visit her himself. They borrowed horses from the city they teleported to and headed for Retin Village. I’m good with horses, but surprisingly, Solon could also ride them.\n“I wasn’t very good at it, but I had the opportunity to ride for a long time during my travels. Zack taught me. It’s one of the few things he taught me,” Solon said proudly. Marika Kingdom, where they used to be, still bore the scars of the invasion by the Demon King’s army, and the entire country was devastated.\n“The closer you get to the Demon King’s territory, the more places like this you will find,” Solon seemed to have no particular feeling. He must have seen many such sights during his previous travels. But for me, who had never been out of the country, it was shocking. I realized how little I knew. Surely my mother had seen even more intense sights. Finally, they arrived at Retin Village, which was located near the sea. The buildings and fields were still quite devastated, but compared to the other places they passed, it was relatively good. Smoke showing signs of people living could be seen rising in the sky. When they asked the villagers who were working in the fields about Zack, they quickly told them his whereabouts.\nHe came to this village two years ago to help with its reconstruction. He works energetically and also defeats monsters that occasionally appear, so he seems to be a valuable presence. When I went to the designated location, he was stacking bricks for a house. He had chestnut-colored hair that was slightly wavy, and brown eyes that matched it. He looked his age, but he hadn’t really changed much. He looked good in the clothes of the village people, and there was nothing strange about it, which made him even more like them. Zack noticed us approaching right away. He had a good instinct, as expected of a hero.\n“Hey, isn’t that Solon!?” He was surprised. Well, we had come all this way, so we needed to surprise him. Solon walked up to him and hugged him.\n“I’ve been looking for you.” It was just one sentence, but it felt very heavy.\n“Ah,” Zack replied, hugging him back. After a while, he looked at me.\n“Is that Princess Alexia? What are you doing here?” I was happy that he remembered me. Solon moved away from Zack and kept some distance.“I know about your lies, as does Shera-san,” he said. Zack looked surprised.\n“That’s troublesome… Is that so? But why did the princess come all the way here just to say that?”\n“I came to fulfil a promise.”\n“Promise?”\n“To fulfil the promise of marrying the person I love.”\n“Huh?” He looked puzzled. Solon grinned.\n“The person you love, is it me?” What a clueless person. I nodded silently.\n“Um…” Zack blushed and scratched his head, looking embarrassed. Then, after a little thought, he said,\n“I know a good sweets shop in the capital city. Would you like to go together?”\n—————————————\nMessage from the Author:\nThank you for reading until the end. The plot of this work existed before the first one, but I felt it was a bit difficult to write, so I put it off. However, I received an encouraging review in the first work, saying that I was a\n“promising author”, so I decided to try my best to write it. Thank you very much, Omochi-san, for writing the review. I was very happy. However, after writing it, I thought,\n“Was it still difficult?” I just hope that this work was at least a little interesting for those who read it. Lastly, I would appreciate it if you could give me a rating, even if it is low.\nI would like to use that as a guideline for the future. We have also published our third work,\n“A merchant who was expelled from the party, being called a burden, saves the world with the power of money. Even if told\n“I always thought of you as a friend,” it’s too late now.” If you are interested, please take a look. (Added on March 19th)\nMessage from the translator (me):\nHello everyone, it’s Jayhem here! I just wanted to express my gratitude to all of you for taking the time to read this novel. I sincerely hope you enjoyed the story as much as I enjoyed translating it.\nIn the upcoming days, I’ll be dedicating my efforts to translating more works of similar quality to this novel. So, if you have any recommendations (even if you just want a continuation of a dropped series), please don’t hesitate to share them with me. I’m eager to hear your suggestions! (Only exception, will not translate anything NSFW)\nAlso if there is anything unclear or some adjustments you would like me to apply to the translations (Inconsistent naming, clarifying something, different spacing, etc), I’m all ears and will fix it asap!\nIf you find value in my translations and wish to support me, I would be incredibly grateful for any contributions made through my Ko-fi page (I’ll be placing a button at intervals of every 10 chapters or upon the completion of a novel, as I’d prefer not to have it displayed too frequently). Your support would mean a lot to me and help me continue providing quality translations for you all.\nLastly, if you’re interested in seeing more works from this author or the ones mentioned in the previous message, just give me a shout, and I’ll be more than happy to deliver. Thanks again, and happy reading! Love yall *^*\nExtra: I’m going to be uploading a complete short novel translation tomorrow\n“I am the villainess. My fate is to be hanged and die, but I want to live a life of catching a wonderful husband and say\n“yippee!” with joy.” (Just a heads up if your interested)",
      "scraped_at": "2025-11-22T15:37:29.693863",
      "content_scraped_at": "2025-11-22T15:37:30.318181",
      "error": null
    }
  ]
}